una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
#define 	AT91C_HDMA_DIS7_0                    ((unsigned int) 0x0 <<  7) // (HDMA) No effect.
#define 	AT91C_HDMA_DIS7_1                    ((unsigned int) 0x1 <<  7) // (HDMA) Disables the channel 7.
#define AT91C_HDMA_RES0       ((unsigned int) 0x1 <<  8) // (HDMA) Write one to this field to resume the channel 0 transfer restoring its context.
#define 	AT91C_HDMA_RES0_0                    ((unsigned int) 0x0 <<  8) // (HDMA) No effect.
#define 	AT91C_HDMA_RES0_1                    ((unsigned int) 0x1 <<  8) // (HDMA) Resumes the channel 0.
#define AT91C_HDMA_RES1       ((unsigned int) 0x1 <<  9) // (HDMA) Write one to this field to resume the channel 1 transfer restoring its context.
#define 	AT91C_HDMA_RES1_0                    ((unsigned int) 0x0 <<  9) // (HDMA) No effect.
#define 	AT91C_HDMA_RES1_1                    ((unsigned int) 0x1 <<  9) // (HDMA) Resumes the channel 1.
#define AT91C_HDMA_RES2       ((unsigned int) 0x1 << 10) // (HDMA) Write one to this field to resume the channel 2 transfer restoring its context.
#define 	AT91C_HDMA_RES2_0                    ((unsigned int) 0x0 << 10) // (HDMA) No effect.
#define 	AT91C_HDMA_RES2_1                    ((unsigned int) 0x1 << 10) // (HDMA) Resumes the channel 2.
#define AT91C_HDMA_RES3       ((unsigned int) 0x1 << 11) // (HDMA) Write one to this field to resume the channel 3 transfer restoring its context.
#define 	AT91C_HDMA_RES3_0                    ((unsigned int) 0x0 << 11) // (HDMA) No effect.
#define 	AT91C_HDMA_RES3_1                    ((unsigned int) 0x1 << 11) // (HDMA) Resumes the channel 3.
#define AT91C_HDMA_RES4       ((unsigned int) 0x1 << 12) // (HDMA) Write one to this field to resume the channel 4 transfer restoring its context.
#define 	AT91C_HDMA_RES4_0                    ((unsigned int) 0x0 << 12) // (HDMA) No effect.
#define 	AT91C_HDMA_RES4_1                    ((unsigned int) 0x1 << 12) // (HDMA) Resumes the channel 4.
#define AT91C_HDMA_RES5       ((unsigned int) 0x1 << 13) // (HDMA) Write one to this field to resume the channel 5 transfer restoring its context.
#define 	AT91C_HDMA_RES5_0                    ((unsigned int) 0x0 << 13) // (HDMA) No effect.
#define 	AT91C_HDMA_RES5_1                    ((unsigned int) 0x1 << 13) // (HDMA) Resumes the channel 5.
#define AT91C_HDMA_RES6       ((unsigned int) 0x1 << 14) // (HDMA) Write one to this field to resume the channel 6 transfer restoring its context.
#define 	AT91C_HDMA_RES6_0                    ((unsigned int) 0x0 << 14) // (HDMA) No effect.
#define 	AT91C_HDMA_RES6_1                    ((unsigned int) 0x1 << 14) // (HDMA) Resumes the channel 6.
#define AT91C_HDMA_RES7       ((unsigned int) 0x1 << 15) // (HDMA) Write one to this field to resume the channel 7 transfer restoring its context.
#define 	AT91C_HDMA_RES7_0                    ((unsigned int) 0x0 << 15) // (HDMA) No effect.
#define 	AT91C_HDMA_RES7_1                    ((unsigned int) 0x1 << 15) // (HDMA) Resumes the channel 7.
// -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- 
#define AT91C_HDMA_EMPT0      ((unsigned int) 0x1 << 16) // (HDMA) When set, channel 0 is empty.
#define 	AT91C_HDMA_EMPT0_0                    ((unsigned int) 0x0 << 16) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT0_1                    ((unsigned int) 0x1 << 16) // (HDMA) Channel 0 empty.
#define AT91C_HDMA_EMPT1      ((unsigned int) 0x1 << 17) // (HDMA) When set, channel 1 is empty.
#define 	AT91C_HDMA_EMPT1_0                    ((unsigned int) 0x0 << 17) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT1_1                    ((unsigned int) 0x1 << 17) // (HDMA) Channel 1 empty.
#define AT91C_HDMA_EMPT2      ((unsigned int) 0x1 << 18) // (HDMA) When set, channel 2 is empty.
#define 	AT91C_HDMA_EMPT2_0                    ((unsigned int) 0x0 << 18) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT2_1                    ((unsigned int) 0x1 << 18) // (HDMA) Channel 2 empty.
#define AT91C_HDMA_EMPT3      ((unsigned int) 0x1 << 19) // (HDMA) When set, channel 3 is empty.
#define 	AT91C_HDMA_EMPT3_0                    ((unsigned int) 0x0 << 19) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT3_1                    ((unsigned int) 0x1 << 19) // (HDMA) Channel 3 empty.
#define AT91C_HDMA_EMPT4      ((unsigned int) 0x1 << 20) // (HDMA) When set, channel 4 is empty.
#define 	AT91C_HDMA_EMPT4_0                    ((unsigned int) 0x0 << 20) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT4_1                    ((unsigned int) 0x1 << 20) // (HDMA) Channel 4 empty.
#define AT91C_HDMA_EMPT5      ((unsigned int) 0x1 << 21) // (HDMA) When set, channel 5 is empty.
#define 	AT91C_HDMA_EMPT5_0                    ((unsigned int) 0x0 << 21) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT5_1                    ((unsigned int) 0x1 << 21) // (HDMA) Channel 5 empty.
#define AT91C_HDMA_EMPT6      ((unsigned int) 0x1 << 22) // (HDMA) When set, channel 6 is empty.
#define 	AT91C_HDMA_EMPT6_0                    ((unsigned int) 0x0 << 22) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT6_1                    ((unsigned int) 0x1 << 22) // (HDMA) Channel 6 empty.
#define AT91C_HDMA_EMPT7      ((unsigned int) 0x1 << 23) // (HDMA) When set, channel 7 is empty.
#define 	AT91C_HDMA_EMPT7_0                    ((unsigned int) 0x0 << 23) // (HDMA) No effect.
#define 	AT91C_HDMA_EMPT7_1                    ((unsigned int) 0x1 << 23) // (HDMA) Channel 7 empty.
#define AT91C_HDMA_STAL0      ((unsigned int) 0x1 << 24) // (HDMA) When set, channel 0 is stalled.
#define 	AT91C_HDMA_STAL0_0                    ((unsigned int) 0x0 << 24) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL0_1                    ((unsigned int) 0x1 << 24) // (HDMA) Channel 0 stalled.
#define AT91C_HDMA_STAL1      ((unsigned int) 0x1 << 25) // (HDMA) When set, channel 1 is stalled.
#define 	AT91C_HDMA_STAL1_0                    ((unsigned int) 0x0 << 25) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL1_1                    ((unsigned int) 0x1 << 25) // (HDMA) Channel 1 stalled.
#define AT91C_HDMA_STAL2      ((unsigned int) 0x1 << 26) // (HDMA) When set, channel 2 is stalled.
#define 	AT91C_HDMA_STAL2_0                    ((unsigned int) 0x0 << 26) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL2_1                    ((unsigned int) 0x1 << 26) // (HDMA) Channel 2 stalled.
#define AT91C_HDMA_STAL3      ((unsigned int) 0x1 << 27) // (HDMA) When set, channel 3 is stalled.
#define 	AT91C_HDMA_STAL3_0                    ((unsigned int) 0x0 << 27) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL3_1                    ((unsigned int) 0x1 << 27) // (HDMA) Channel 3 stalled.
#define AT91C_HDMA_STAL4      ((unsigned int) 0x1 << 28) // (HDMA) When set, channel 4 is stalled.
#define 	AT91C_HDMA_STAL4_0                    ((unsigned int) 0x0 << 28) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL4_1                    ((unsigned int) 0x1 << 28) // (HDMA) Channel 4 stalled.
#define AT91C_HDMA_STAL5      ((unsigned int) 0x1 << 29) // (HDMA) When set, channel 5 is stalled.
#define 	AT91C_HDMA_STAL5_0                    ((unsigned int) 0x0 << 29) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL5_1                    ((unsigned int) 0x1 << 29) // (HDMA) Channel 5 stalled.
#define AT91C_HDMA_STAL6      ((unsigned int) 0x1 << 30) // (HDMA) When set, channel 6 is stalled.
#define 	AT91C_HDMA_STAL6_0                    ((unsigned int) 0x0 << 30) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL6_1                    ((unsigned int) 0x1 << 30) // (HDMA) Channel 6 stalled.
#define AT91C_HDMA_STAL7      ((unsigned int) 0x1 << 31) // (HDMA) When set, channel 7 is stalled.
#define 	AT91C_HDMA_STAL7_0                    ((unsigned int) 0x0 << 31) // (HDMA) No effect.
#define 	AT91C_HDMA_STAL7_1                    ((unsigned int) 0x1 << 31) // (HDMA) Channel 7 stalled.
// -------- HDMA_VER : (HDMA Offset: 0x1fc)  -------- 

