una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
// *****************************************************************************
//               REGISTER ADDRESS DEFINITION FOR AT91SAM3U1
// *****************************************************************************
// ========== Register definition for SYS peripheral ========== 
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0x400E1290) // (SYS) General Purpose Register
// ========== Register definition for HSMC4_CS0 peripheral ========== 
#define AT91C_CS0_MODE  ((AT91_REG *) 	0x400E0080) // (HSMC4_CS0) Mode Register
#define AT91C_CS0_PULSE ((AT91_REG *) 	0x400E0074) // (HSMC4_CS0) Pulse Register
#define AT91C_CS0_CYCLE ((AT91_REG *) 	0x400E0078) // (HSMC4_CS0) Cycle Register
#define AT91C_CS0_TIMINGS ((AT91_REG *) 	0x400E007C) // (HSMC4_CS0) Timmings Register
#define AT91C_CS0_SETUP ((AT91_REG *) 	0x400E0070) // (HSMC4_CS0) Setup Register
// ========== Register definition for HSMC4_CS1 peripheral ========== 
#define AT91C_CS1_CYCLE ((AT91_REG *) 	0x400E008C) // (HSMC4_CS1) Cycle Register
#define AT91C_CS1_PULSE ((AT91_REG *) 	0x400E0088) // (HSMC4_CS1) Pulse Register
#define AT91C_CS1_MODE  ((AT91_REG *) 	0x400E0094) // (HSMC4_CS1) Mode Register
#define AT91C_CS1_SETUP ((AT91_REG *) 	0x400E0084) // (HSMC4_CS1) Setup Register
#define AT91C_CS1_TIMINGS ((AT91_REG *) 	0x400E0090) // (HSMC4_CS1) Timmings Register
// ========== Register definition for HSMC4_CS2 peripheral ========== 
#define AT91C_CS2_PULSE ((AT91_REG *) 	0x400E009C) // (HSMC4_CS2) Pulse Register
#define AT91C_CS2_TIMINGS ((AT91_REG *) 	0x400E00A4) // (HSMC4_CS2) Timmings Register
#define AT91C_CS2_CYCLE ((AT91_REG *) 	0x400E00A0) // (HSMC4_CS2) Cycle Register
#define AT91C_CS2_MODE  ((AT91_REG *) 	0x400E00A8) // (HSMC4_CS2) Mode Register
#define AT91C_CS2_SETUP ((AT91_REG *) 	0x400E0098) // (HSMC4_CS2) Setup Register
// ========== Register definition for HSMC4_CS3 peripheral ========== 
#define AT91C_CS3_MODE  ((AT91_REG *) 	0x400E00BC) // (HSMC4_CS3) Mode Register
#define AT91C_CS3_TIMINGS ((AT91_REG *) 	0x400E00B8) // (HSMC4_CS3) Timmings Register
#define AT91C_CS3_SETUP ((AT91_REG *) 	0x400E00AC) // (HSMC4_CS3) Setup Register
#define AT91C_CS3_CYCLE ((AT91_REG *) 	0x400E00B4) // (HSMC4_CS3) Cycle Register
#define AT91C_CS3_PULSE ((AT91_REG *) 	0x400E00B0) // (HSMC4_CS3) Pulse Register
// ========== Register definition for HSMC4_NFC peripheral ========== 
#define AT91C_NFC_MODE  ((AT91_REG *) 	0x400E010C) // (HSMC4_NFC) Mode Register
#define AT91C_NFC_CYCLE ((AT91_REG *) 	0x400E0104) // (HSMC4_NFC) Cycle Register
#define AT91C_NFC_PULSE ((AT91_REG *) 	0x400E0100) // (HSMC4_NFC) Pulse Register
#define AT91C_NFC_SETUP ((AT91_REG *) 	0x400E00FC) // (HSMC4_NFC) Setup Register
#define AT91C_NFC_TIMINGS ((AT91_REG *) 	0x400E0108) // (HSMC4_NFC) Timmings Register
// ========== Register definition for HSMC4 peripheral ========== 
#define AT91C_HSMC4_IPNAME1 ((AT91_REG *) 	0x400E01F0) // (HSMC4) Write Protection Status Register
#define AT91C_HSMC4_ECCPR6 ((AT91_REG *) 	0x400E0048) // (HSMC4) ECC Parity register 6
#define AT91C_HSMC4_ADDRSIZE ((AT91_REG *) 	0x400E01EC) // (HSMC4) Write Protection Status Register
#define AT91C_HSMC4_ECCPR11 ((AT91_REG *) 	0x400E005C) // (HSMC4) ECC Parity register 11
#define AT91C_HSMC4_SR  ((AT91_REG *) 	0x400E0008) // (HSMC4) Status Register
#define AT91C_HSMC4_IMR ((AT91_REG *) 	0x400E0014) // (HSMC4) Interrupt Mask Register
#define AT91C_HSMC4_WPSR ((AT91_REG *) 	0x400E01E8) // (HSMC4) Write Protection Status Register
#define AT91C_HSMC4_BANK ((AT91_REG *) 	0x400E001C) // (HSMC4) Bank Register
#define AT91C_HSMC4_ECCPR8 ((AT91_REG *) 	0x400E0050) // (HSMC4) ECC Parity register 8
#define AT91C_HSMC4_WPCR ((AT91_REG *) 	0x400E01E4) // (HSMC4) Write Protection Control register
#define AT91C_HSMC4_ECCPR2 ((AT91_REG *) 	0x400E0038) // (HSMC4) ECC Parity register 2
#define AT91C_HSMC4_ECCPR1 ((AT91_REG *) 	0x400E0030) // (HSMC4) ECC Parity register 1
#define AT91C_HSMC4_ECCSR2 ((AT91_REG *) 	0x400E0034) // (HSMC4) ECC Status register 2
#define AT91C_HSMC4_OCMS ((AT91_REG *) 	0x400E0110) // (HSMC4) OCMS MODE register
#define AT91C_HSMC4_ECCPR9 ((AT91_REG *) 	0x400E0054) // (HSMC4) ECC Parity register 9
#define AT91C_HSMC4_DUMMY ((AT91_REG *) 	0x400E0200) // (HSMC4) This rtegister was created only ti have AHB constants
#define AT91C_HSMC4_ECCPR5 ((AT91_REG *) 	0x400E0044) // (HSMC4) ECC Parity register 5
#define AT91C_HSMC4_ECCCR ((AT91_REG *) 	0x400E0020) // (HSMC4) ECC reset register
#define AT91C_HSMC4_KEY2 ((AT91_REG *) 	0x400E0118) // (HSMC4) KEY2 Register
#define AT91C_HSMC4_IER ((AT91_REG *) 	0x400E000C) // (HSMC4) Interrupt Enable Register
#define AT91C_HSMC4_ECCSR1 ((AT91_REG *) 	0x400E0028) // (HSMC4) ECC Status register 1
#define AT91C_HSMC4_IDR ((AT91_REG *) 	0x400E0010) // (HSMC4) Interrupt Disable Register
#define AT91C_HSMC4_ECCPR0 ((AT91_REG *) 	0x400E002C) // (HSMC4) ECC Parity register 0
#define AT91C_HSMC4_FEATURES ((AT91_REG *) 	0x400E01F8) // (HSMC4) Write Protection Status Register
#define AT91C_HSMC4_ECCPR7 ((AT91_REG *) 	0x400E004C) // (HSMC4) ECC Parity register 7
#define AT91C_HSMC4_ECCPR12 ((AT91_REG *) 	0x400E0060) // (HSMC4) ECC Parity register 12
#define AT91C_HSMC4_ECCPR10 ((AT91_REG *) 	0x400E0058) // (HSMC4) ECC Parity register 10
#define AT91C_HSMC4_KEY1 ((AT91_REG *) 	0x400E0114) // (HSMC4) KEY1 Register
#define AT91C_HSMC4_VER ((AT91_REG *) 	0x400E01FC) // (HSMC4) HSMC4 Version Register
#define AT91C_HSMC4_Eccpr15 ((AT91_REG *) 	0x400E006C) // (HSMC4) ECC Parity register 15
#define AT91C_HSMC4_ECCPR4 ((AT91_REG *) 	0x400E0040) // (HSMC4) ECC Parity register 4
#define AT91C_HSMC4_IPNAME2 ((AT91_REG *) 	0x400E01F4) // (HSMC4) Write Protection Status Register
#define AT91C_HSMC4_ECCCMD ((AT91_REG *) 	0x400E0024) // (HSMC4) ECC Page size register
#define AT91C_HSMC4_ADDR ((AT91_REG *) 	0x400E0018) // (HSMC4) Address Cycle Zero Register
#define AT91C_HSMC4_ECCPR3 ((AT91_REG *) 	0x400E003C) // (HSMC4) ECC Parity register 3
#define AT91C_HSMC4_CFG ((AT91_REG *) 	0x400E0000) // (HSMC4) Configuration Register
#define AT91C_HSMC4_CTRL ((AT91_REG *) 	0x400E0004) // (HSMC4) Control Register
#define AT91C_HSMC4_ECCPR13 ((AT91_REG *) 	0x400E0064) // (HSMC4) ECC Parity register 13
#define AT91C_HSMC4_ECCPR14 ((AT91_REG *) 	0x400E0068) // (HSMC4) ECC Parity register 14
// ========== Register definition for MATRIX peripheral ========== 
#define AT91C_MATRIX_SFR2  ((AT91_REG *) 	0x400E0318) // (MATRIX)  Special Function Register 2
#define AT91C_MATRIX_SFR3  ((AT91_REG *) 	0x400E031C) // (MATRIX)  Special Function Register 3
#define AT91C_MATRIX_SCFG8 ((AT91_REG *) 	0x400E0260) // (MATRIX)  Slave Configuration Register 8
#define AT91C_MATRIX_MCFG2 ((AT91_REG *) 	0x400E0208) // (MATRIX)  Master Configuration Register 2
#define AT91C_MATRIX_MCFG7 ((AT91_REG *) 	0x400E021C) // (MATRIX)  Master Configuration Register 7
#define AT91C_MATRIX_SCFG3 ((AT91_REG *) 	0x400E024C) // (MATRIX)  Slave Configuration Register 3
#define AT91C_MATRIX_SCFG0 ((AT91_REG *) 	0x400E0240) // (MATRIX)  Slave Configuration Register 0
#define AT91C_MATRIX_SFR12 ((AT91_REG *) 	0x400E0340) // (MATRIX)  Special Function Register 12
#define AT91C_MATRIX_SCFG1 ((AT91_REG *) 	0x400E0244) // (MATRIX)  Slave Configuration Register 1
#define AT91C_MATRIX_SFR8  ((AT91_REG *) 	0x400E0330) // (MATRIX)  Special Function Register 8
#define AT91C_MATRIX_VER ((AT91_REG *) 	0x400E03FC) // (MATRIX) HMATRIX2 VERSION REGISTER 
#define AT91C_MATRIX_SFR13 ((AT91_REG *) 	0x400E0344) // (MATRIX)  Special Function Register 13
#define AT91C_MATRIX_SFR5  ((AT91_REG *) 	0x400E0324) // (MATRIX)  Special Function Register 5
#define AT91C_MATRIX_MCFG0 ((AT91_REG *) 	0x400E0200) // (MATRIX)  Master Configuration Register 0 : ARM I and D
#define AT91C_MATRIX_SCFG6 ((AT91_REG *) 	0x400E0258) // (MATRIX)  Slave Configuration Register 6
#define AT91C_MATRIX_SFR14 ((AT91_REG *) 	0x400E0348) // (MATRIX)  Special Function Register 14
#define AT91C_MATRIX_SFR1  ((AT91_REG *) 	0x400E0314) // (MATRIX)  Special Function Register 1
#define AT91C_MATRIX_SFR15 ((AT91_REG *) 	0x400E034C) // (MATRIX)  Special Function Register 15
#define AT91C_MATRIX_SFR6  ((AT91_REG *) 	0x400E0328) // (MATRIX)  Special Function Register 6
#define AT91C_MATRIX_SFR11 ((AT91_REG *) 	0x400E033C) // (MATRIX)  Special Function Register 11
#define AT91C_MATRIX_IPNAME2 ((AT91_REG *) 	0x400E03F4) // (MATRIX) HMATRIX2 IPNAME2 REGISTER 
#define AT91C_MATRIX_ADDRSIZE ((AT91_REG *) 	0x400E03EC) // (MATRIX) HMATRIX2 ADDRSIZE REGISTER 
#define AT91C_MATRIX_MCFG5 ((AT91_REG *) 	0x400E0214) // (MATRIX)  Master Configuration Register 5
#define AT91C_MATRIX_SFR9  ((AT91_REG *) 	0x400E0334) // (MATRIX)  Special Function Register 9
#define AT91C_MATRIX_MCFG3 ((AT91_REG *) 	0x400E020C) // (MATRIX)  Master Configuration Register 3
#define AT91C_MATRIX_SCFG4 ((AT91_REG *) 	0x400E0250) // (MATRIX)  Slave Configuration Register 4
#define AT91C_MATRIX_MCFG1 ((AT91_REG *) 	0x400E0204) // (MATRIX)  Master Configuration Register 1 : ARM S
#define AT91C_MATRIX_SCFG7 ((AT91_REG *) 	0x400E025C) // (MATRIX)  Slave Configuration Register 5
#define AT91C_MATRIX_SFR10 ((AT91_REG *) 	0x400E0338) // (MATRIX)  Special Function Register 10
#define AT91C_MATRIX_SCFG2 ((AT91_REG *) 	0x400E0248) // (MATRIX)  Slave Configuration Register 2
#define AT91C_MATRIX_SFR7  ((AT91_REG *) 	0x400E032C) // (MATRIX)  Special Function Register 7
#define AT91C_MATRIX_IPNAME1 ((AT91_REG *) 	0x400E03F0) // (MATRIX) HMATRIX2 IPNAME1 REGISTER 
#define AT91C_MATRIX_MCFG4 ((AT91_REG *) 	0x400E0210) // (MATRIX)  Master Configuration Register 4
#define AT91C_MATRIX_SFR0  ((AT91_REG *) 	0x400E0310) // (MATRIX)  Special Function Register 0
#define AT91C_MATRIX_FEATURES ((AT91_REG *) 	0x400E03F8) // (MATRIX) HMATRIX2 FEATURES REGISTER 
#define AT91C_MATRIX_SCFG5 ((AT91_REG *) 	0x400E0254) // (MATRIX)  Slave Configuration Register 5
#define AT91C_MATRIX_MCFG6 ((AT91_REG *) 	0x400E0218) // (MATRIX)  Master Configuration Register 6
#define AT91C_MATRIX_SCFG9 ((AT91_REG *) 	0x400E0264) // (MATRIX)  Slave Configuration Register 9
#define AT91C_MATRIX_SFR4  ((AT91_REG *) 	0x400E0320) // (MATRIX)  Special Function Register 4
// ========== Register definition for NVIC peripheral ========== 
#define AT91C_NVIC_MMAR ((AT91_REG *) 	0xE000ED34) // (NVIC) Mem Manage Address Register
#define AT91C_NVIC_STIR ((AT91_REG *) 	0xE000EF00) // (NVIC) Software Trigger Interrupt Register
#define AT91C_NVIC_MMFR2 ((AT91_REG *) 	0xE000ED58) // (NVIC) Memory Model Feature register2
#define AT91C_NVIC_CPUID ((AT91_REG *) 	0xE000ED00) // (NVIC) CPUID Base Register
#define AT91C_NVIC_DFSR ((AT91_REG *) 	0xE000ED30) // (NVIC) Debug Fault Status Register
#define AT91C_NVIC_HAND4PR ((AT91_REG *) 	0xE000ED18) // (NVIC) System Handlers 4-7 Priority Register
#define AT91C_NVIC_HFSR ((AT91_REG *) 	0xE000ED2C) // (NVIC) Hard Fault Status Register
#define AT91C_NVIC_PID6 ((AT91_REG *) 	0xE000EFD8) // (NVIC) Peripheral identification register
#define AT91C_NVIC_PFR0 ((AT91_REG *) 	0xE000ED40) // (NVIC) Processor Feature register0
#define AT91C_NVIC_VTOFFR ((AT91_REG *) 	0xE000ED08) // (NVIC) Vector Table Offset Register
#define AT91C_NVIC_ISPR ((AT91_REG *) 	0xE000E200) // (NVIC) Set Pending Register
#define AT91C_NVIC_PID0 ((AT91_REG *) 	0xE000EFE0) // (NVIC) Peripheral identification register b7:0
#define AT91C_NVIC_PID7 ((AT91_REG *) 	0xE000EFDC) // (NVIC) Peripheral identification register
#define AT91C_NVIC_STICKRVR ((AT91_REG *) 	0xE000E014) // (NVIC) SysTick Reload Value Register
#define AT91C_NVIC_PID2 ((AT91_REG *) 	0xE000EFE8) // (NVIC) Peripheral identification register b23:16
#define AT91C_NVIC_ISAR0 ((AT91_REG *) 	0xE000ED60) // (NVIC) ISA Feature register0
#define AT91C_NVIC_SCR  ((AT91_REG *) 	0xE000ED10) // (NVIC) System Control Register
#define AT91C_NVIC_PID4 ((AT91_REG *) 	0xE000EFD0) // (NVIC) Peripheral identification register
#define AT91C_NVIC_ISAR2 ((AT91_REG *) 	0xE000ED68) // (NVIC) ISA Feature register2
#define AT91C_NVIC_ISER ((AT91_REG *) 	0xE000E100) // (NVIC) Set Enable Register
#define AT91C_NVIC_IPR  ((AT91_REG *) 	0xE000E400) // (NVIC) Interrupt Mask Register
#define AT91C_NVIC_AIRCR ((AT91_REG *) 	0xE000ED0C) // (NVIC) Application Interrupt/Reset Control Reg
#define AT91C_NVIC_CID2 ((AT91_REG *) 	0xE000EFF8) // (NVIC) Component identification register b23:16
#define AT91C_NVIC_ICPR ((AT91_REG *) 	0xE000E280) // (NVIC) Clear Pending Register
#define AT91C_NVIC_CID3 ((AT91_REG *) 	0xE000EFFC) // (NVIC) Component identification register b31:24
#define AT91C_NVIC_CFSR ((AT91_REG *) 	0xE000ED28) // (NVIC) Configurable Fault Status Register
#define AT91C_NVIC_AFR0 ((AT91_REG *) 	0xE000ED4C) // (NVIC) Auxiliary Feature register0
#define AT91C_NVIC_ICSR ((AT91_REG *) 	0xE000ED04) // (NVIC) Interrupt Control State Register
#define AT91C_NVIC_CCR  ((AT91_REG *) 	0xE000ED14) // (NVIC) Configuration Control Register
#define AT91C_NVIC_CID0 ((AT91_REG *) 	0xE000EFF0) // (NVIC) Component identification register b7:0
#define AT91C_NVIC_ISAR1 ((AT91_REG *) 	0xE000ED64) // (NVIC) ISA Feature register1
#define AT91C_NVIC_STICKCVR ((AT91_REG *) 	0xE000E018) // (NVIC) SysTick Current Value Register
#define AT91C_NVIC_STICKCSR ((AT91_REG *) 	0xE000E010) // (NVIC) SysTick Control and Status Register
#define AT91C_NVIC_CID1 ((AT91_REG *) 	0xE000EFF4) // (NVIC) Component identification register b15:8
#define AT91C_NVIC_DFR0 ((AT91_REG *) 	0xE000ED48) // (NVIC) Debug Feature register0
#define AT91C_NVIC_MMFR3 ((AT91_REG *) 	0xE000ED5C) // (NVIC) Memory Model Feature register3
#define AT91C_NVIC_MMFR0 ((AT91_REG *) 	0xE000ED50) // (NVIC) Memory Model Feature register0
#define AT91C_NVIC_STICKCALVR ((AT91_REG *) 	0xE000E01C) // (NVIC) SysTick Calibration Value Register
#define AT91C_NVIC_PID1 ((AT91_REG *) 	0xE000EFE4) // (NVIC) Peripheral identification register b15:8
#define AT91C_NVIC_HAND12PR ((AT91_REG *) 	0xE000ED20) // (NVIC) System Handlers 12-15 Priority Register
#define AT91C_NVIC_MMFR1 ((AT91_REG *) 	0xE000ED54) // (NVIC) Memory Model Feature register1
#define AT91C_NVIC_AFSR ((AT91_REG *) 	0xE000ED3C) // (NVIC) Auxiliary Fault Status Register
#define AT91C_NVIC_HANDCSR ((AT91_REG *) 	0xE000ED24) // (NVIC) System Handler Control and State Register
#define AT91C_NVIC_ISAR4 ((AT91_REG *) 	0xE000ED70) // (NVIC) ISA Feature register4
#define AT91C_NVIC_ABR  ((AT91_REG *) 	0xE000E300) // (NVIC) Active Bit Register
#define AT91C_NVIC_PFR1 ((AT91_REG *) 	0xE000ED44) // (NVIC) Processor Feature register1
#define AT91C_NVIC_PID5 ((AT91_REG *) 	0xE000EFD4) // (NVIC) Peripheral identification register
#define AT91C_NVIC_ICTR ((AT91_REG *) 	0xE000E004) // (NVIC) Interrupt Control Type Register
#define AT91C_NVIC_ICER ((AT91_REG *) 	0xE000E180) // (NVIC) Clear enable Register
#define AT91C_NVIC_PID3 ((AT91_REG *) 	0xE000EFEC) // (NVIC) Peripheral identification register b31:24
#define AT91C_NVIC_ISAR3 ((AT91_REG *) 	0xE000ED6C) // (NVIC) ISA Feature register3
#define AT91C_NVIC_HAND8PR ((AT91_REG *) 	0xE000ED1C) // (NVIC) System Handlers 8-11 Priority Register
#define AT91C_NVIC_BFAR ((AT91_REG *) 	0xE000ED38) // (NVIC) Bus Fault Address Register
// ========== Register definition for MPU peripheral ========== 
#define AT91C_MPU_REG_BASE_ADDR3 ((AT91_REG *) 	0xE000EDB4) // (MPU) MPU Region Base Address Register alias 3
#define AT91C_MPU_REG_NB ((AT91_REG *) 	0xE000ED98) // (MPU) MPU Region Number Register
#define AT91C_MPU_ATTR_SIZE1 ((AT91_REG *) 	0xE000EDA8) // (MPU) MPU  Attribute and Size Register alias 1
#define AT91C_MPU_REG_BASE_ADDR1 ((AT91_REG *) 	0xE000EDA4) // (MPU) MPU Region Base Address Register alias 1
#define AT91C_MPU_ATTR_SIZE3 ((AT91_REG *) 	0xE000EDB8) // (MPU) MPU  Attribute and Size Register alias 3
#define AT91C_MPU_CTRL  ((AT91_REG *) 	0xE000ED94) // (MPU) MPU Control Register
#define AT91C_MPU_ATTR_SIZE2 ((AT91_REG *) 	0xE000EDB0) // (MPU) MPU  Attribute and Size Register alias 2
#define AT91C_MPU_REG_BASE_ADDR ((AT91_REG *) 	0xE000ED9C) // (MPU) MPU Region Base Address Register
#define AT91C_MPU_REG_BASE_ADDR2 ((AT91_REG *) 	0xE000EDAC) // (MPU) MPU Region Base Address Register alias 2
#define AT91C_MPU_ATTR_SIZE ((AT91_REG *) 	0xE000EDA0) // (MPU) MPU  Attribute and Size Register
#define AT91C_MPU_TYPE  ((AT91_REG *) 	0xE000ED90) // (MPU) MPU Type Register
// ========== Register definition for CM3 peripheral ========== 
#define AT91C_CM3_SHCSR ((AT91_REG *) 	0xE000ED24) // (CM3) System Handler Control and State Register
#define AT91C_CM3_CCR   ((AT91_REG *) 	0xE000ED14) // (CM3) Configuration Control Register
#define AT91C_CM3_ICSR  ((AT91_REG *) 	0xE000ED04) // (CM3) Interrupt Control State Register
#define AT91C_CM3_CPUID ((AT91_REG *) 	0xE000ED00) // (CM3) CPU ID Base Register
#define AT91C_CM3_SCR   ((AT91_REG *) 	0xE000ED10) // (CM3) System Controller Register
#define AT91C_CM3_AIRCR ((AT91_REG *) 	0xE000ED0C) // (CM3) Application Interrupt and Reset Control Register
#define AT91C_CM3_SHPR  ((AT91_REG *) 	0xE000ED18) // (CM3) System Handler Priority Register
#define AT91C_CM3_VTOR  ((AT91_REG *) 	0xE000ED08) // (CM3) Vector Table Offset Register
// ========== Register definition for PDC_DBGU peripheral ========== 
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0x400E0708) // (PDC_DBGU) Transmit Pointer Register
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0x400E0720) // (PDC_DBGU) PDC Transfer Control Register
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0x400E071C) // (PDC_DBGU) Transmit Next Counter Register
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0x400E0724) // (PDC_DBGU) PDC Transfer Status Register
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0x400E0714) // (PDC_DBGU) Receive Next Counter Register
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0x400E0700) // (PDC_DBGU) Receive Pointer Register
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0x400E070C) // (PDC_DBGU) Transmit Counter Register
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0x400E0710) // (PDC_DBGU) Receive Next Pointer Register
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0x400E0718) // (PDC_DBGU) Transmit Next Pointer Register
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0x400E0704) // (PDC_DBGU) Receive Counter Register
// ========== Register definition for DBGU peripheral ========== 
#define AT91C_DBGU_CR   ((AT91_REG *) 	0x400E0600) // (DBGU) Control Register
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0x400E060C) // (DBGU) Interrupt Disable Register
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0x400E0740) // (DBGU) Chip ID Register
#define AT91C_DBGU_IPNAME2 ((AT91_REG *) 	0x400E06F4) // (DBGU) DBGU IPNAME2 REGISTER 
#define AT91C_DBGU_FEATURES ((AT91_REG *) 	0x400E06F8) // (DBGU) DBGU FEATURES REGISTER 
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0x400E0648) // (DBGU) Force NTRST Register
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0x400E0618) // (DBGU) Receiver Holding Register
#define AT91C_DBGU_THR  ((AT91_REG *) 	0x400E061C) // (DBGU) Transmitter Holding Register
#define AT91C_DBGU_ADDRSIZE ((AT91_REG *) 	0x400E06EC) // (DBGU) DBGU ADDRSIZE REGISTER 
#define AT91C_DBGU_MR   ((AT91_REG *) 	0x400E0604) // (DBGU) Mode Register
#define AT91C_DBGU_IER  ((AT91_REG *) 	0x400E0608) // (DBGU) Interrupt Enable Register
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0x400E0620) // (DBGU) Baud Rate Generator Register
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0x400E0614) // (DBGU) Channel Status Register
#define AT91C_DBGU_VER  ((AT91_REG *) 	0x400E06FC) // (DBGU) DBGU VERSION REGISTER 
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0x400E0610) // (DBGU) Interrupt Mask Register
#define AT91C_DBGU_IPNAME1 ((AT91_REG *) 	0x400E06F0) // (DBGU) DBGU IPNAME1 REGISTER 
#define AT91C_DBGU_EXID ((AT91_REG *) 	0x400E0744) // (DBGU) Chip ID Extension Register
// ========== Register definition for PIOA peripheral ========== 
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0x400E0C04) // (PIOA) PIO Disable Register
#define AT91C_PIOA_FRLHSR ((AT91_REG *) 	0x400E0CD8) // (PIOA) Fall/Rise - Low/High Status Register
#define AT91C_PIOA_KIMR ((AT91_REG *) 	0x400E0D38) // (PIOA) Keypad Controller Interrupt Mask Register
#define AT91C_PIOA_LSR  ((AT91_REG *) 	0x400E0CC4) // (PIOA) Level Select Register
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0x400E0C28) // (PIOA) Input Filter Status Register
#define AT91C_PIOA_KKRR ((AT91_REG *) 	0x400E0D44) // (PIOA) Keypad Controller Key Release Register
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0x400E0C14) // (PIOA) Output Disable Registerr
#define AT91C_PIOA_SCIFSR ((AT91_REG *) 	0x400E0C80) // (PIOA) System Clock Glitch Input Filter Select Register
#define AT91C_PIOA_PER  ((AT91_REG *) 	0x400E0C00) // (PIOA) PIO Enable Register
#define AT91C_PIOA_VER  ((AT91_REG *) 	0x400E0CFC) // (PIOA) PIO VERSION REGISTER 
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0x400E0CA8) // (PIOA) Output Write Status Register
#define AT91C_PIOA_KSR  ((AT91_REG *) 	0x400E0D3C) // (PIOA) Keypad Controller Status Register
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0x400E0C48) // (PIOA) Interrupt Mask Register
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0x400E0CA4) // (PIOA) Output Write Disable Register
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0x400E0C58) // (PIOA) Multi-driver Status Register
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0x400E0C24) // (PIOA) Input Filter Disable Register
#define AT91C_PIOA_AIMDR ((AT91_REG *) 	0x400E0CB4) // (PIOA) Additional Interrupt Modes Disables Register
#define AT91C_PIOA_CODR ((AT91_REG *) 	0x400E0C34) // (PIOA) Clear Output Data Register
#define AT91C_PIOA_SCDR ((AT91_REG *) 	0x400E0C8C) // (PIOA) Slow Clock Divider Debouncing Register
#define AT91C_PIOA_KIER ((AT91_REG *) 	0x400E0D30) // (PIOA) Keypad Controller Interrupt Enable Register
#define AT91C_PIOA_REHLSR ((AT91_REG *) 	0x400E0CD4) // (PIOA) Rising Edge/ High Level Select Register
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0x400E0C4C) // (PIOA) Interrupt Status Register
#define AT91C_PIOA_ESR  ((AT91_REG *) 	0x400E0CC0) // (PIOA) Edge Select Register
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0x400E0C60) // (PIOA) Pull-up Disable Register
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0x400E0C54) // (PIOA) Multi-driver Disable Register
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0x400E0C08) // (PIOA) PIO Status Register
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0x400E0C3C) // (PIOA) Pin Data Status Register
#define AT91C_PIOA_IFDGSR ((AT91_REG *) 	0x400E0C88) // (PIOA) Glitch or Debouncing Input Filter Clock Selection Status Register
#define AT91C_PIOA_FELLSR ((AT91_REG *) 	0x400E0CD0) // (PIOA) Falling Edge/Low Level Select Register
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0x400E0C68) // (PIOA) Pull-up Status Register
#define AT91C_PIOA_OER  ((AT91_REG *) 	0x400E0C10) // (PIOA) Output Enable Register
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0x400E0C18) // (PIOA) Output Status Register
#define AT91C_PIOA_KKPR ((AT91_REG *) 	0x400E0D40) // (PIOA) Keypad Controller Key Press Register
#define AT91C_PIOA_AIMMR ((AT91_REG *) 	0x400E0CB8) // (PIOA) Additional Interrupt Modes Mask Register
#define AT91C_PIOA_KRCR ((AT91_REG *) 	0x400E0D24) // (PIOA) Keypad Controller Row Column Register
#define AT91C_PIOA_IER  ((AT91_REG *) 	0x400E0C40) // (PIOA) Interrupt Enable Register
#define AT91C_PIOA_KER  ((AT91_REG *) 	0x400E0D20) // (PIOA) Keypad Controller Enable Register
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0x400E0C64) // (PIOA) Pull-up Enable Register
#define AT91C_PIOA_KIDR ((AT91_REG *) 	0x400E0D34) // (PIOA) Keypad Controller Interrupt Disable Register
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0x400E0C70) // (PIOA) Peripheral AB Select Register
#define AT91C_PIOA_LOCKSR ((AT91_REG *) 	0x400E0CE0) // (PIOA) Lock Status Register
#define AT91C_PIOA_DIFSR ((AT91_REG *) 	0x400E0C84) // (PIOA) Debouncing Input Filter Select Register
#define AT91C_PIOA_MDER ((AT91_REG *) 	0x400E0C50) // (PIOA) Multi-driver Enable Register
