una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
#define AT91C_PIOA_AIMER ((AT91_REG *) 	0x400E0CB0) // (PIOA) Additional Interrupt Modes Enable Register
#define AT91C_PIOA_ELSR ((AT91_REG *) 	0x400E0CC8) // (PIOA) Edge/Level Status Register
#define AT91C_PIOA_IFER ((AT91_REG *) 	0x400E0C20) // (PIOA) Input Filter Enable Register
#define AT91C_PIOA_KDR  ((AT91_REG *) 	0x400E0D28) // (PIOA) Keypad Controller Debouncing Register
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0x400E0C44) // (PIOA) Interrupt Disable Register
#define AT91C_PIOA_OWER ((AT91_REG *) 	0x400E0CA0) // (PIOA) Output Write Enable Register
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0x400E0C38) // (PIOA) Output Data Status Register
#define AT91C_PIOA_SODR ((AT91_REG *) 	0x400E0C30) // (PIOA) Set Output Data Register
// ========== Register definition for PIOB peripheral ========== 
#define AT91C_PIOB_KIDR ((AT91_REG *) 	0x400E0F34) // (PIOB) Keypad Controller Interrupt Disable Register
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0x400E0EA8) // (PIOB) Output Write Status Register
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0x400E0E08) // (PIOB) PIO Status Register
#define AT91C_PIOB_MDER ((AT91_REG *) 	0x400E0E50) // (PIOB) Multi-driver Enable Register
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0x400E0E14) // (PIOB) Output Disable Registerr
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0x400E0E44) // (PIOB) Interrupt Disable Register
#define AT91C_PIOB_AIMER ((AT91_REG *) 	0x400E0EB0) // (PIOB) Additional Interrupt Modes Enable Register
#define AT91C_PIOB_DIFSR ((AT91_REG *) 	0x400E0E84) // (PIOB) Debouncing Input Filter Select Register
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0x400E0E04) // (PIOB) PIO Disable Register
#define AT91C_PIOB_REHLSR ((AT91_REG *) 	0x400E0ED4) // (PIOB) Rising Edge/ High Level Select Register
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0x400E0E3C) // (PIOB) Pin Data Status Register
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0x400E0E60) // (PIOB) Pull-up Disable Register
#define AT91C_PIOB_LSR  ((AT91_REG *) 	0x400E0EC4) // (PIOB) Level Select Register
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0x400E0EA4) // (PIOB) Output Write Disable Register
#define AT91C_PIOB_FELLSR ((AT91_REG *) 	0x400E0ED0) // (PIOB) Falling Edge/Low Level Select Register
#define AT91C_PIOB_IFER ((AT91_REG *) 	0x400E0E20) // (PIOB) Input Filter Enable Register
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0x400E0E70) // (PIOB) Peripheral AB Select Register
#define AT91C_PIOB_KIMR ((AT91_REG *) 	0x400E0F38) // (PIOB) Keypad Controller Interrupt Mask Register
#define AT91C_PIOB_KKPR ((AT91_REG *) 	0x400E0F40) // (PIOB) Keypad Controller Key Press Register
#define AT91C_PIOB_FRLHSR ((AT91_REG *) 	0x400E0ED8) // (PIOB) Fall/Rise - Low/High Status Register
#define AT91C_PIOB_AIMDR ((AT91_REG *) 	0x400E0EB4) // (PIOB) Additional Interrupt Modes Disables Register
#define AT91C_PIOB_SCIFSR ((AT91_REG *) 	0x400E0E80) // (PIOB) System Clock Glitch Input Filter Select Register
#define AT91C_PIOB_VER  ((AT91_REG *) 	0x400E0EFC) // (PIOB) PIO VERSION REGISTER 
#define AT91C_PIOB_PER  ((AT91_REG *) 	0x400E0E00) // (PIOB) PIO Enable Register
#define AT91C_PIOB_ELSR ((AT91_REG *) 	0x400E0EC8) // (PIOB) Edge/Level Status Register
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0x400E0E48) // (PIOB) Interrupt Mask Register
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0x400E0E68) // (PIOB) Pull-up Status Register
#define AT91C_PIOB_SCDR ((AT91_REG *) 	0x400E0E8C) // (PIOB) Slow Clock Divider Debouncing Register
#define AT91C_PIOB_KSR  ((AT91_REG *) 	0x400E0F3C) // (PIOB) Keypad Controller Status Register
#define AT91C_PIOB_IFDGSR ((AT91_REG *) 	0x400E0E88) // (PIOB) Glitch or Debouncing Input Filter Clock Selection Status Register
#define AT91C_PIOB_ESR  ((AT91_REG *) 	0x400E0EC0) // (PIOB) Edge Select Register
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0x400E0E38) // (PIOB) Output Data Status Register
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0x400E0E24) // (PIOB) Input Filter Disable Register
#define AT91C_PIOB_SODR ((AT91_REG *) 	0x400E0E30) // (PIOB) Set Output Data Register
#define AT91C_PIOB_IER  ((AT91_REG *) 	0x400E0E40) // (PIOB) Interrupt Enable Register
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0x400E0E58) // (PIOB) Multi-driver Status Register
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0x400E0E4C) // (PIOB) Interrupt Status Register
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0x400E0E28) // (PIOB) Input Filter Status Register
#define AT91C_PIOB_KER  ((AT91_REG *) 	0x400E0F20) // (PIOB) Keypad Controller Enable Register
#define AT91C_PIOB_KKRR ((AT91_REG *) 	0x400E0F44) // (PIOB) Keypad Controller Key Release Register
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0x400E0E64) // (PIOB) Pull-up Enable Register
#define AT91C_PIOB_LOCKSR ((AT91_REG *) 	0x400E0EE0) // (PIOB) Lock Status Register
#define AT91C_PIOB_OWER ((AT91_REG *) 	0x400E0EA0) // (PIOB) Output Write Enable Register
#define AT91C_PIOB_KIER ((AT91_REG *) 	0x400E0F30) // (PIOB) Keypad Controller Interrupt Enable Register
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0x400E0E54) // (PIOB) Multi-driver Disable Register
#define AT91C_PIOB_KRCR ((AT91_REG *) 	0x400E0F24) // (PIOB) Keypad Controller Row Column Register
#define AT91C_PIOB_CODR ((AT91_REG *) 	0x400E0E34) // (PIOB) Clear Output Data Register
#define AT91C_PIOB_KDR  ((AT91_REG *) 	0x400E0F28) // (PIOB) Keypad Controller Debouncing Register
#define AT91C_PIOB_AIMMR ((AT91_REG *) 	0x400E0EB8) // (PIOB) Additional Interrupt Modes Mask Register
#define AT91C_PIOB_OER  ((AT91_REG *) 	0x400E0E10) // (PIOB) Output Enable Register
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0x400E0E18) // (PIOB) Output Status Register
// ========== Register definition for PIOC peripheral ========== 
#define AT91C_PIOC_FELLSR ((AT91_REG *) 	0x400E10D0) // (PIOC) Falling Edge/Low Level Select Register
#define AT91C_PIOC_FRLHSR ((AT91_REG *) 	0x400E10D8) // (PIOC) Fall/Rise - Low/High Status Register
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0x400E1054) // (PIOC) Multi-driver Disable Register
#define AT91C_PIOC_IFDGSR ((AT91_REG *) 	0x400E1088) // (PIOC) Glitch or Debouncing Input Filter Clock Selection Status Register
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0x400E1070) // (PIOC) Peripheral AB Select Register
#define AT91C_PIOC_KIMR ((AT91_REG *) 	0x400E1138) // (PIOC) Keypad Controller Interrupt Mask Register
#define AT91C_PIOC_KRCR ((AT91_REG *) 	0x400E1124) // (PIOC) Keypad Controller Row Column Register
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0x400E1038) // (PIOC) Output Data Status Register
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0x400E1018) // (PIOC) Output Status Register
#define AT91C_PIOC_IFER ((AT91_REG *) 	0x400E1020) // (PIOC) Input Filter Enable Register
#define AT91C_PIOC_KKPR ((AT91_REG *) 	0x400E1140) // (PIOC) Keypad Controller Key Press Register
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0x400E1058) // (PIOC) Multi-driver Status Register
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0x400E1024) // (PIOC) Input Filter Disable Register
#define AT91C_PIOC_MDER ((AT91_REG *) 	0x400E1050) // (PIOC) Multi-driver Enable Register
#define AT91C_PIOC_SCDR ((AT91_REG *) 	0x400E108C) // (PIOC) Slow Clock Divider Debouncing Register
#define AT91C_PIOC_SCIFSR ((AT91_REG *) 	0x400E1080) // (PIOC) System Clock Glitch Input Filter Select Register
#define AT91C_PIOC_IER  ((AT91_REG *) 	0x400E1040) // (PIOC) Interrupt Enable Register
#define AT91C_PIOC_KDR  ((AT91_REG *) 	0x400E1128) // (PIOC) Keypad Controller Debouncing Register
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0x400E10A4) // (PIOC) Output Write Disable Register
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0x400E1028) // (PIOC) Input Filter Status Register
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0x400E104C) // (PIOC) Interrupt Status Register
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0x400E1060) // (PIOC) Pull-up Disable Register
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0x400E103C) // (PIOC) Pin Data Status Register
#define AT91C_PIOC_KKRR ((AT91_REG *) 	0x400E1144) // (PIOC) Keypad Controller Key Release Register
#define AT91C_PIOC_AIMDR ((AT91_REG *) 	0x400E10B4) // (PIOC) Additional Interrupt Modes Disables Register
#define AT91C_PIOC_LSR  ((AT91_REG *) 	0x400E10C4) // (PIOC) Level Select Register
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0x400E1064) // (PIOC) Pull-up Enable Register
#define AT91C_PIOC_AIMER ((AT91_REG *) 	0x400E10B0) // (PIOC) Additional Interrupt Modes Enable Register
#define AT91C_PIOC_OER  ((AT91_REG *) 	0x400E1010) // (PIOC) Output Enable Register
#define AT91C_PIOC_CODR ((AT91_REG *) 	0x400E1034) // (PIOC) Clear Output Data Register
#define AT91C_PIOC_AIMMR ((AT91_REG *) 	0x400E10B8) // (PIOC) Additional Interrupt Modes Mask Register
#define AT91C_PIOC_OWER ((AT91_REG *) 	0x400E10A0) // (PIOC) Output Write Enable Register
#define AT91C_PIOC_VER  ((AT91_REG *) 	0x400E10FC) // (PIOC) PIO VERSION REGISTER 
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0x400E1048) // (PIOC) Interrupt Mask Register
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0x400E1068) // (PIOC) Pull-up Status Register
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0x400E1044) // (PIOC) Interrupt Disable Register
#define AT91C_PIOC_DIFSR ((AT91_REG *) 	0x400E1084) // (PIOC) Debouncing Input Filter Select Register
#define AT91C_PIOC_KIDR ((AT91_REG *) 	0x400E1134) // (PIOC) Keypad Controller Interrupt Disable Register
#define AT91C_PIOC_KSR  ((AT91_REG *) 	0x400E113C) // (PIOC) Keypad Controller Status Register
#define AT91C_PIOC_REHLSR ((AT91_REG *) 	0x400E10D4) // (PIOC) Rising Edge/ High Level Select Register
#define AT91C_PIOC_ESR  ((AT91_REG *) 	0x400E10C0) // (PIOC) Edge Select Register
#define AT91C_PIOC_KIER ((AT91_REG *) 	0x400E1130) // (PIOC) Keypad Controller Interrupt Enable Register
#define AT91C_PIOC_ELSR ((AT91_REG *) 	0x400E10C8) // (PIOC) Edge/Level Status Register
#define AT91C_PIOC_SODR ((AT91_REG *) 	0x400E1030) // (PIOC) Set Output Data Register
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0x400E1008) // (PIOC) PIO Status Register
#define AT91C_PIOC_KER  ((AT91_REG *) 	0x400E1120) // (PIOC) Keypad Controller Enable Register
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0x400E1014) // (PIOC) Output Disable Registerr
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0x400E10A8) // (PIOC) Output Write Status Register
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0x400E1004) // (PIOC) PIO Disable Register
#define AT91C_PIOC_LOCKSR ((AT91_REG *) 	0x400E10E0) // (PIOC) Lock Status Register
#define AT91C_PIOC_PER  ((AT91_REG *) 	0x400E1000) // (PIOC) PIO Enable Register
// ========== Register definition for PMC peripheral ========== 
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0x400E0428) // (PMC) PLL Register
#define AT91C_PMC_UCKR  ((AT91_REG *) 	0x400E041C) // (PMC) UTMI Clock Configuration Register
#define AT91C_PMC_FSMR  ((AT91_REG *) 	0x400E0470) // (PMC) Fast Startup Mode Register
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0x400E0430) // (PMC) Master Clock Register
#define AT91C_PMC_SCER  ((AT91_REG *) 	0x400E0400) // (PMC) System Clock Enable Register
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0x400E0418) // (PMC) Peripheral Clock Status Register
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0x400E0424) // (PMC) Main Clock  Frequency Register
#define AT91C_PMC_FOCR  ((AT91_REG *) 	0x400E0478) // (PMC) Fault Output Clear Register
#define AT91C_PMC_FSPR  ((AT91_REG *) 	0x400E0474) // (PMC) Fast Startup Polarity Register
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0x400E0408) // (PMC) System Clock Status Register
#define AT91C_PMC_IDR   ((AT91_REG *) 	0x400E0464) // (PMC) Interrupt Disable Register
#define AT91C_PMC_VER   ((AT91_REG *) 	0x400E04FC) // (PMC) APMC VERSION REGISTER
#define AT91C_PMC_IMR   ((AT91_REG *) 	0x400E046C) // (PMC) Interrupt Mask Register
#define AT91C_PMC_IPNAME2 ((AT91_REG *) 	0x400E04F4) // (PMC) PMC IPNAME2 REGISTER 
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0x400E0404) // (PMC) System Clock Disable Register
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0x400E0440) // (PMC) Programmable Clock Register
#define AT91C_PMC_ADDRSIZE ((AT91_REG *) 	0x400E04EC) // (PMC) PMC ADDRSIZE REGISTER 
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0x400E0414) // (PMC) Peripheral Clock Disable Register
#define AT91C_PMC_MOR   ((AT91_REG *) 	0x400E0420) // (PMC) Main Oscillator Register
#define AT91C_PMC_SR    ((AT91_REG *) 	0x400E0468) // (PMC) Status Register
#define AT91C_PMC_IER   ((AT91_REG *) 	0x400E0460) // (PMC) Interrupt Enable Register
#define AT91C_PMC_IPNAME1 ((AT91_REG *) 	0x400E04F0) // (PMC) PMC IPNAME1 REGISTER 
#define AT91C_PMC_PCER  ((AT91_REG *) 	0x400E0410) // (PMC) Peripheral Clock Enable Register
#define AT91C_PMC_FEATURES ((AT91_REG *) 	0x400E04F8) // (PMC) PMC FEATURES REGISTER 
// ========== Register definition for CKGR peripheral ========== 
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0x400E0428) // (CKGR) PLL Register
#define AT91C_CKGR_UCKR ((AT91_REG *) 	0x400E041C) // (CKGR) UTMI Clock Configuration Register
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0x400E0420) // (CKGR) Main Oscillator Register
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0x400E0424) // (CKGR) Main Clock  Frequency Register
// ========== Register definition for RSTC peripheral ========== 
#define AT91C_RSTC_VER  ((AT91_REG *) 	0x400E12FC) // (RSTC) Version Register
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0x400E1200) // (RSTC) Reset Control Register
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0x400E1208) // (RSTC) Reset Mode Register
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0x400E1204) // (RSTC) Reset Status Register
// ========== Register definition for SUPC peripheral ========== 
#define AT91C_SUPC_WUIR ((AT91_REG *) 	0x400E1220) // (SUPC) Wake Up Inputs Register
#define AT91C_SUPC_CR   ((AT91_REG *) 	0x400E1210) // (SUPC) Control Register
#define AT91C_SUPC_MR   ((AT91_REG *) 	0x400E1218) // (SUPC) Mode Register
#define AT91C_SUPC_FWUTR ((AT91_REG *) 	0x400E1228) // (SUPC) Flash Wake-up Timer Register
#define AT91C_SUPC_SR   ((AT91_REG *) 	0x400E1224) // (SUPC) Status Register
#define AT91C_SUPC_WUMR ((AT91_REG *) 	0x400E121C) // (SUPC) Wake Up Mode Register
#define AT91C_SUPC_BOMR ((AT91_REG *) 	0x400E1214) // (SUPC) Brown Out Mode Register
// ========== Register definition for RTTC peripheral ========== 
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0x400E1238) // (RTTC) Real-time Value Register
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0x400E1234) // (RTTC) Real-time Alarm Register
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0x400E1230) // (RTTC) Real-time Mode Register
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0x400E123C) // (RTTC) Real-time Status Register
// ========== Register definition for WDTC peripheral ========== 
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0x400E1258) // (WDTC) Watchdog Status Register
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0x400E1254) // (WDTC) Watchdog Mode Register
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0x400E1250) // (WDTC) Watchdog Control Register
// ========== Register definition for RTC peripheral ========== 
#define AT91C_RTC_IMR   ((AT91_REG *) 	0x400E1288) // (RTC) Interrupt Mask Register
#define AT91C_RTC_SCCR  ((AT91_REG *) 	0x400E127C) // (RTC) Status Clear Command Register
#define AT91C_RTC_CALR  ((AT91_REG *) 	0x400E126C) // (RTC) Calendar Register
#define AT91C_RTC_MR    ((AT91_REG *) 	0x400E1264) // (RTC) Mode Register
#define AT91C_RTC_TIMR  ((AT91_REG *) 	0x400E1268) // (RTC) Time Register
#define AT91C_RTC_CALALR ((AT91_REG *) 	0x400E1274) // (RTC) Calendar Alarm Register
#define AT91C_RTC_VER   ((AT91_REG *) 	0x400E128C) // (RTC) Valid Entry Register
#define AT91C_RTC_CR    ((AT91_REG *) 	0x400E1260) // (RTC) Control Register
#define AT91C_RTC_IDR   ((AT91_REG *) 	0x400E1284) // (RTC) Interrupt Disable Register
#define AT91C_RTC_TIMALR ((AT91_REG *) 	0x400E1270) // (RTC) Time Alarm Register
#define AT91C_RTC_IER   ((AT91_REG *) 	0x400E1280) // (RTC) Interrupt Enable Register
#define AT91C_RTC_SR    ((AT91_REG *) 	0x400E1278) // (RTC) Status Register
// ========== Register definition for ADC0 peripheral ========== 
#define AT91C_ADC0_IPNAME2 ((AT91_REG *) 	0x400AC0F4) // (ADC0) ADC IPNAME2 REGISTER 
#define AT91C_ADC0_ADDRSIZE ((AT91_REG *) 	0x400AC0EC) // (ADC0) ADC ADDRSIZE REGISTER 
#define AT91C_ADC0_IDR  ((AT91_REG *) 	0x400AC028) // (ADC0) ADC Interrupt Disable Register
#define AT91C_ADC0_CHSR ((AT91_REG *) 	0x400AC018) // (ADC0) ADC Channel Status Register
#define AT91C_ADC0_FEATURES ((AT91_REG *) 	0x400AC0F8) // (ADC0) ADC FEATURES REGISTER 
#define AT91C_ADC0_CDR0 ((AT91_REG *) 	0x400AC030) // (ADC0) ADC Channel Data Register 0
#define AT91C_ADC0_LCDR ((AT91_REG *) 	0x400AC020) // (ADC0) ADC Last Converted Data Register
#define AT91C_ADC0_EMR  ((AT91_REG *) 	0x400AC068) // (ADC0) Extended Mode Register
#define AT91C_ADC0_CDR3 ((AT91_REG *) 	0x400AC03C) // (ADC0) ADC Channel Data Register 3
#define AT91C_ADC0_CDR7 ((AT91_REG *) 	0x400AC04C) // (ADC0) ADC Channel Data Register 7
#define AT91C_ADC0_SR   ((AT91_REG *) 	0x400AC01C) // (ADC0) ADC Status Register
#define AT91C_ADC0_ACR  ((AT91_REG *) 	0x400AC064) // (ADC0) Analog Control Register
#define AT91C_ADC0_CDR5 ((AT91_REG *) 	0x400AC044) // (ADC0) ADC Channel Data Register 5
#define AT91C_ADC0_IPNAME1 ((AT91_REG *) 	0x400AC0F0) // (ADC0) ADC IPNAME1 REGISTER 
#define AT91C_ADC0_CDR6 ((AT91_REG *) 	0x400AC048) // (ADC0) ADC Channel Data Register 6
#define AT91C_ADC0_MR   ((AT91_REG *) 	0x400AC004) // (ADC0) ADC Mode Register
#define AT91C_ADC0_CDR1 ((AT91_REG *) 	0x400AC034) // (ADC0) ADC Channel Data Register 1
#define AT91C_ADC0_CDR2 ((AT91_REG *) 	0x400AC038) // (ADC0) ADC Channel Data Register 2
#define AT91C_ADC0_CDR4 ((AT91_REG *) 	0x400AC040) // (ADC0) ADC Channel Data Register 4
#define AT91C_ADC0_CHER ((AT91_REG *) 	0x400AC010) // (ADC0) ADC Channel Enable Register
#define AT91C_ADC0_VER  ((AT91_REG *) 	0x400AC0FC) // (ADC0) ADC VERSION REGISTER
#define AT91C_ADC0_CHDR ((AT91_REG *) 	0x400AC014) // (ADC0) ADC Channel Disable Register
#define AT91C_ADC0_CR   ((AT91_REG *) 	0x400AC000) // (ADC0) ADC Control Register
#define AT91C_ADC0_IMR  ((AT91_REG *) 	0x400AC02C) // (ADC0) ADC Interrupt Mask Register
#define AT91C_ADC0_IER  ((AT91_REG *) 	0x400AC024) // (ADC0) ADC Interrupt Enable Register
// ========== Register definition for TC0 peripheral ========== 
#define AT91C_TC0_IER   ((AT91_REG *) 	0x40080024) // (TC0) Interrupt Enable Register
#define AT91C_TC0_CV    ((AT91_REG *) 	0x40080010) // (TC0) Counter Value
#define AT91C_TC0_RA    ((AT91_REG *) 	0x40080014) // (TC0) Register A
#define AT91C_TC0_RB    ((AT91_REG *) 	0x40080018) // (TC0) Register B
#define AT91C_TC0_IDR   ((AT91_REG *) 	0x40080028) // (TC0) Interrupt Disable Register
#define AT91C_TC0_SR    ((AT91_REG *) 	0x40080020) // (TC0) Status Register
#define AT91C_TC0_IMR   ((AT91_REG *) 	0x4008002C) // (TC0) Interrupt Mask Register
#define AT91C_TC0_CMR   ((AT91_REG *) 	0x40080004) // (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC0_RC    ((AT91_REG *) 	0x4008001C) // (TC0) Register C
#define AT91C_TC0_CCR   ((AT91_REG *) 	0x40080000) // (TC0) Channel Control Register
// ========== Register definition for TC1 peripheral ========== 
#define AT91C_TC1_SR    ((AT91_REG *) 	0x40080060) // (TC1) Status Register
#define AT91C_TC1_RA    ((AT91_REG *) 	0x40080054) // (TC1) Register A
#define AT91C_TC1_IER   ((AT91_REG *) 	0x40080064) // (TC1) Interrupt Enable Register
#define AT91C_TC1_RB    ((AT91_REG *) 	0x40080058) // (TC1) Register B
#define AT91C_TC1_IDR   ((AT91_REG *) 	0x40080068) // (TC1) Interrupt Disable Register
#define AT91C_TC1_CCR   ((AT91_REG *) 	0x40080040) // (TC1) Channel Control Register
#define AT91C_TC1_IMR   ((AT91_REG *) 	0x4008006C) // (TC1) Interrupt Mask Register
#define AT91C_TC1_RC    ((AT91_REG *) 	0x4008005C) // (TC1) Register C
#define AT91C_TC1_CMR   ((AT91_REG *) 	0x40080044) // (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC1_CV    ((AT91_REG *) 	0x40080050) // (TC1) Counter Value
// ========== Register definition for TC2 peripheral ========== 
#define AT91C_TC2_RA    ((AT91_REG *) 	0x40080094) // (TC2) Register A
#define AT91C_TC2_RB    ((AT91_REG *) 	0x40080098) // (TC2) Register B
#define AT91C_TC2_CMR   ((AT91_REG *) 	0x40080084) // (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC2_SR    ((AT91_REG *) 	0x400800A0) // (TC2) Status Register
#define AT91C_TC2_CCR   ((AT91_REG *) 	0x40080080) // (TC2) Channel Control Register
#define AT91C_TC2_IMR   ((AT91_REG *) 	0x400800AC) // (TC2) Interrupt Mask Register
#define AT91C_TC2_CV    ((AT91_REG *) 	0x40080090) // (TC2) Counter Value
#define AT91C_TC2_RC    ((AT91_REG *) 	0x4008009C) // (TC2) Register C
#define AT91C_TC2_IER   ((AT91_REG *) 	0x400800A4) // (TC2) Interrupt Enable Register
#define AT91C_TC2_IDR   ((AT91_REG *) 	0x400800A8) // (TC2) Interrupt Disable Register
// ========== Register definition for TCB0 peripheral ========== 
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0x400800C0) // (TCB0) TC Block Control Register
#define AT91C_TCB0_IPNAME2 ((AT91_REG *) 	0x400800F4) // (TCB0) TC IPNAME2 REGISTER 
#define AT91C_TCB0_IPNAME1 ((AT91_REG *) 	0x400800F0) // (TCB0) TC IPNAME1 REGISTER 
#define AT91C_TCB0_ADDRSIZE ((AT91_REG *) 	0x400800EC) // (TCB0) TC ADDRSIZE REGISTER 
#define AT91C_TCB0_FEATURES ((AT91_REG *) 	0x400800F8) // (TCB0) TC FEATURES REGISTER 
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0x400800C4) // (TCB0) TC Block Mode Register
#define AT91C_TCB0_VER  ((AT91_REG *) 	0x400800FC) // (TCB0)  Version Register
// ========== Register definition for TCB1 peripheral ========== 
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0x40080100) // (TCB1) TC Block Control Register
#define AT91C_TCB1_VER  ((AT91_REG *) 	0x4008013C) // (TCB1)  Version Register
#define AT91C_TCB1_FEATURES ((AT91_REG *) 	0x40080138) // (TCB1) TC FEATURES REGISTER 
#define AT91C_TCB1_IPNAME2 ((AT91_REG *) 	0x40080134) // (TCB1) TC IPNAME2 REGISTER 
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0x40080104) // (TCB1) TC Block Mode Register
#define AT91C_TCB1_ADDRSIZE ((AT91_REG *) 	0x4008012C) // (TCB1) TC ADDRSIZE REGISTER 
#define AT91C_TCB1_IPNAME1 ((AT91_REG *) 	0x40080130) // (TCB1) TC IPNAME1 REGISTER 
// ========== Register definition for TCB2 peripheral ========== 
#define AT91C_TCB2_FEATURES ((AT91_REG *) 	0x40080178) // (TCB2) TC FEATURES REGISTER 
#define AT91C_TCB2_VER  ((AT91_REG *) 	0x4008017C) // (TCB2)  Version Register
#define AT91C_TCB2_ADDRSIZE ((AT91_REG *) 	0x4008016C) // (TCB2) TC ADDRSIZE REGISTER 
#define AT91C_TCB2_IPNAME1 ((AT91_REG *) 	0x40080170) // (TCB2) TC IPNAME1 REGISTER 
#define AT91C_TCB2_IPNAME2 ((AT91_REG *) 	0x40080174) // (TCB2) TC IPNAME2 REGISTER 
#define AT91C_TCB2_BMR  ((AT91_REG *) 	0x40080144) // (TCB2) TC Block Mode Register
#define AT91C_TCB2_BCR  ((AT91_REG *) 	0x40080140) // (TCB2) TC Block Control Register
// ========== Register definition for EFC0 peripheral ========== 
#define AT91C_EFC0_FCR  ((AT91_REG *) 	0x400E0804) // (EFC0) EFC Flash Command Register
#define AT91C_EFC0_FRR  ((AT91_REG *) 	0x400E080C) // (EFC0) EFC Flash Result Register
#define AT91C_EFC0_FMR  ((AT91_REG *) 	0x400E0800) // (EFC0) EFC Flash Mode Register
#define AT91C_EFC0_FSR  ((AT91_REG *) 	0x400E0808) // (EFC0) EFC Flash Status Register
#define AT91C_EFC0_FVR  ((AT91_REG *) 	0x400E0814) // (EFC0) EFC Flash Version Register
// ========== Register definition for EFC1 peripheral ========== 
#define AT91C_EFC1_FMR  ((AT91_REG *) 	0x400E0A00) // (EFC1) EFC Flash Mode Register
#define AT91C_EFC1_FVR  ((AT91_REG *) 	0x400E0A14) // (EFC1) EFC Flash Version Register
#define AT91C_EFC1_FSR  ((AT91_REG *) 	0x400E0A08) // (EFC1) EFC Flash Status Register
#define AT91C_EFC1_FCR  ((AT91_REG *) 	0x400E0A04) // (EFC1) EFC Flash Command Register
#define AT91C_EFC1_FRR  ((AT91_REG *) 	0x400E0A0C) // (EFC1) EFC Flash Result Register
// ========== Register definition for MCI0 peripheral ========== 
