una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Supply Controller Interface
// - *****************************************************************************
// - -------- SUPC_CR : (SUPC Offset: 0x0) Control Register -------- 
AT91C_SUPC_SHDW           EQU (0x1 <<  0) ;- (SUPC) Shut Down Command
AT91C_SUPC_SHDWEOF        EQU (0x1 <<  1) ;- (SUPC) Shut Down after End Of Frame
AT91C_SUPC_VROFF          EQU (0x1 <<  2) ;- (SUPC) Voltage Regulator Off
AT91C_SUPC_XTALSEL        EQU (0x1 <<  3) ;- (SUPC) Crystal Oscillator Select
AT91C_SUPC_KEY            EQU (0xFF << 24) ;- (SUPC) Supply Controller Writing Protection Key
// - -------- SUPC_BOMR : (SUPC Offset: 0x4) Brown Out Mode Register -------- 
AT91C_SUPC_BODTH          EQU (0xF <<  0) ;- (SUPC) Brown Out Threshold
AT91C_SUPC_BODSMPL        EQU (0x7 <<  8) ;- (SUPC) Brown Out Sampling Period
AT91C_SUPC_BODSMPL_DISABLED EQU (0x0 <<  8) ;- (SUPC) Brown Out Detector disabled
AT91C_SUPC_BODSMPL_CONTINUOUS EQU (0x1 <<  8) ;- (SUPC) Continuous Brown Out Detector
AT91C_SUPC_BODSMPL_32_SLCK EQU (0x2 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 32 SLCK periods
AT91C_SUPC_BODSMPL_256_SLCK EQU (0x3 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 256 SLCK periods
AT91C_SUPC_BODSMPL_2048_SLCK EQU (0x4 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 2048 SLCK periods
AT91C_SUPC_BODRSTEN       EQU (0x1 << 12) ;- (SUPC) Brownout Reset Enable
// - -------- SUPC_MR : (SUPC Offset: 0x8) Supply Controller Mode Register -------- 
AT91C_SUPC_LCDOUT         EQU (0xF <<  0) ;- (SUPC) LCD Charge Pump Output Voltage Selection
AT91C_SUPC_LCDMODE        EQU (0x3 <<  4) ;- (SUPC) Segment LCD Supply Mode
AT91C_SUPC_LCDMODE_OFF    EQU (0x0 <<  4) ;- (SUPC) The internal and external supply sources are both deselected and the on-chip charge pump is turned off
AT91C_SUPC_LCDMODE_OFF_AFTER_EOF EQU (0x1 <<  4) ;- (SUPC) At the End Of Frame from LCD controller, the internal and external supply sources are both deselected and the on-chip charge pump is turned off
AT91C_SUPC_LCDMODE_EXTERNAL EQU (0x2 <<  4) ;- (SUPC) The external supply source is selected
AT91C_SUPC_LCDMODE_INTERNAL EQU (0x3 <<  4) ;- (SUPC) The internal supply source is selected and the on-chip charge pump is turned on
AT91C_SUPC_VRDEEP         EQU (0x1 <<  8) ;- (SUPC) Voltage Regulator Deep Mode
AT91C_SUPC_VRVDD          EQU (0x7 <<  9) ;- (SUPC) Voltage Regulator Output Voltage Selection
AT91C_SUPC_VRRSTEN        EQU (0x1 << 12) ;- (SUPC) Voltage Regulation Loss Reset Enable
AT91C_SUPC_GPBRON         EQU (0x1 << 16) ;- (SUPC) GPBR ON
AT91C_SUPC_SRAMON         EQU (0x1 << 17) ;- (SUPC) SRAM ON
AT91C_SUPC_RTCON          EQU (0x1 << 18) ;- (SUPC) Real Time Clock Power switch ON
AT91C_SUPC_FLASHON        EQU (0x1 << 19) ;- (SUPC) Flash Power switch On
AT91C_SUPC_BYPASS         EQU (0x1 << 20) ;- (SUPC) 32kHz oscillator bypass
AT91C_SUPC_MKEY           EQU (0xFF << 24) ;- (SUPC) Supply Controller Writing Protection Key
// - -------- SUPC_WUMR : (SUPC Offset: 0xc) Wake Up Mode Register -------- 
AT91C_SUPC_FWUPEN         EQU (0x1 <<  0) ;- (SUPC) Force Wake Up Enable
AT91C_SUPC_BODEN          EQU (0x1 <<  1) ;- (SUPC) Brown Out Wake Up Enable
AT91C_SUPC_RTTEN          EQU (0x1 <<  2) ;- (SUPC) Real Time Timer Wake Up Enable
AT91C_SUPC_RTCEN          EQU (0x1 <<  3) ;- (SUPC) Real Time Clock Wake Up Enable
AT91C_SUPC_FWUPDBC        EQU (0x7 <<  8) ;- (SUPC) Force Wake Up debouncer
AT91C_SUPC_FWUPDBC_IMMEDIATE EQU (0x0 <<  8) ;- (SUPC) Immediate, No debouncing, detected active at least one Slow clock edge
AT91C_SUPC_FWUPDBC_3_SLCK EQU (0x1 <<  8) ;- (SUPC) An enabled Wake Up input shall be low for at least 3 SLCK periods
AT91C_SUPC_FWUPDBC_32_SLCK EQU (0x2 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 32 SLCK periods
AT91C_SUPC_FWUPDBC_512_SLCK EQU (0x3 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 512 SLCK periods
AT91C_SUPC_FWUPDBC_4096_SLCK EQU (0x4 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 4096 SLCK periods
AT91C_SUPC_FWUPDBC_32768_SLCK EQU (0x5 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 32768 SLCK periods
AT91C_SUPC_WKUPDBC        EQU (0x7 << 12) ;- (SUPC) Force Wake Up debouncer
AT91C_SUPC_WKUPDBC_IMMEDIATE EQU (0x0 << 12) ;- (SUPC) Immediate, No debouncing, detected active at least one Slow clock edge
AT91C_SUPC_WKUPDBC_3_SLCK EQU (0x1 << 12) ;- (SUPC) FWUP shall be low for at least 3 SLCK periods
AT91C_SUPC_WKUPDBC_32_SLCK EQU (0x2 << 12) ;- (SUPC) FWUP shall be low for at least 32 SLCK periods
AT91C_SUPC_WKUPDBC_512_SLCK EQU (0x3 << 12) ;- (SUPC) FWUP shall be low for at least 512 SLCK periods
AT91C_SUPC_WKUPDBC_4096_SLCK EQU (0x4 << 12) ;- (SUPC) FWUP shall be low for at least 4096 SLCK periods
AT91C_SUPC_WKUPDBC_32768_SLCK EQU (0x5 << 12) ;- (SUPC) FWUP shall be low for at least 32768 SLCK periods
// - -------- SUPC_WUIR : (SUPC Offset: 0x10) Wake Up Inputs Register -------- 
AT91C_SUPC_WKUPEN0        EQU (0x1 <<  0) ;- (SUPC) Wake Up Input Enable 0
AT91C_SUPC_WKUPEN1        EQU (0x1 <<  1) ;- (SUPC) Wake Up Input Enable 1
AT91C_SUPC_WKUPEN2        EQU (0x1 <<  2) ;- (SUPC) Wake Up Input Enable 2
AT91C_SUPC_WKUPEN3        EQU (0x1 <<  3) ;- (SUPC) Wake Up Input Enable 3
AT91C_SUPC_WKUPEN4        EQU (0x1 <<  4) ;- (SUPC) Wake Up Input Enable 4
AT91C_SUPC_WKUPEN5        EQU (0x1 <<  5) ;- (SUPC) Wake Up Input Enable 5
AT91C_SUPC_WKUPEN6        EQU (0x1 <<  6) ;- (SUPC) Wake Up Input Enable 6
AT91C_SUPC_WKUPEN7        EQU (0x1 <<  7) ;- (SUPC) Wake Up Input Enable 7
AT91C_SUPC_WKUPEN8        EQU (0x1 <<  8) ;- (SUPC) Wake Up Input Enable 8
AT91C_SUPC_WKUPEN9        EQU (0x1 <<  9) ;- (SUPC) Wake Up Input Enable 9
AT91C_SUPC_WKUPEN10       EQU (0x1 << 10) ;- (SUPC) Wake Up Input Enable 10
AT91C_SUPC_WKUPEN11       EQU (0x1 << 11) ;- (SUPC) Wake Up Input Enable 11
AT91C_SUPC_WKUPEN12       EQU (0x1 << 12) ;- (SUPC) Wake Up Input Enable 12
AT91C_SUPC_WKUPEN13       EQU (0x1 << 13) ;- (SUPC) Wake Up Input Enable 13
AT91C_SUPC_WKUPEN14       EQU (0x1 << 14) ;- (SUPC) Wake Up Input Enable 14
AT91C_SUPC_WKUPEN15       EQU (0x1 << 15) ;- (SUPC) Wake Up Input Enable 15
AT91C_SUPC_WKUPT0         EQU (0x1 << 16) ;- (SUPC) Wake Up Input Transition 0
AT91C_SUPC_WKUPT1         EQU (0x1 << 17) ;- (SUPC) Wake Up Input Transition 1
AT91C_SUPC_WKUPT2         EQU (0x1 << 18) ;- (SUPC) Wake Up Input Transition 2
AT91C_SUPC_WKUPT3         EQU (0x1 << 19) ;- (SUPC) Wake Up Input Transition 3
AT91C_SUPC_WKUPT4         EQU (0x1 << 20) ;- (SUPC) Wake Up Input Transition 4
AT91C_SUPC_WKUPT5         EQU (0x1 << 21) ;- (SUPC) Wake Up Input Transition 5
AT91C_SUPC_WKUPT6         EQU (0x1 << 22) ;- (SUPC) Wake Up Input Transition 6
AT91C_SUPC_WKUPT7         EQU (0x1 << 23) ;- (SUPC) Wake Up Input Transition 7
AT91C_SUPC_WKUPT8         EQU (0x1 << 24) ;- (SUPC) Wake Up Input Transition 8
AT91C_SUPC_WKUPT9         EQU (0x1 << 25) ;- (SUPC) Wake Up Input Transition 9
AT91C_SUPC_WKUPT10        EQU (0x1 << 26) ;- (SUPC) Wake Up Input Transition 10
AT91C_SUPC_WKUPT11        EQU (0x1 << 27) ;- (SUPC) Wake Up Input Transition 11
AT91C_SUPC_WKUPT12        EQU (0x1 << 28) ;- (SUPC) Wake Up Input Transition 12
AT91C_SUPC_WKUPT13        EQU (0x1 << 29) ;- (SUPC) Wake Up Input Transition 13
AT91C_SUPC_WKUPT14        EQU (0x1 << 30) ;- (SUPC) Wake Up Input Transition 14
AT91C_SUPC_WKUPT15        EQU (0x1 << 31) ;- (SUPC) Wake Up Input Transition 15
// - -------- SUPC_SR : (SUPC Offset: 0x14) Status Register -------- 
AT91C_SUPC_FWUPS          EQU (0x1 <<  0) ;- (SUPC) Force Wake Up Status
AT91C_SUPC_WKUPS          EQU (0x1 <<  1) ;- (SUPC) Wake Up Status
AT91C_SUPC_BODWS          EQU (0x1 <<  2) ;- (SUPC) BOD Detection Wake Up Status
AT91C_SUPC_VRRSTS         EQU (0x1 <<  3) ;- (SUPC) Voltage regulation Loss Reset Status
AT91C_SUPC_BODRSTS        EQU (0x1 <<  4) ;- (SUPC) BOD detection Reset Status
AT91C_SUPC_BODS           EQU (0x1 <<  5) ;- (SUPC) BOD Status
AT91C_SUPC_BROWNOUT       EQU (0x1 <<  6) ;- (SUPC) BOD Output Status
AT91C_SUPC_OSCSEL         EQU (0x1 <<  7) ;- (SUPC) 32kHz Oscillator Selection Status
AT91C_SUPC_LCDS           EQU (0x1 <<  8) ;- (SUPC) LCD Status
AT91C_SUPC_GPBRS          EQU (0x1 <<  9) ;- (SUPC) General Purpose Back-up registers Status
AT91C_SUPC_RTS            EQU (0x1 << 10) ;- (SUPC) Clock Status
AT91C_SUPC_FLASHS         EQU (0x1 << 11) ;- (SUPC) FLASH Memory Status
AT91C_SUPC_FWUPIS         EQU (0x1 << 12) ;- (SUPC) WKUP Input Status
AT91C_SUPC_WKUPIS0        EQU (0x1 << 16) ;- (SUPC) WKUP Input 0 Status
AT91C_SUPC_WKUPIS1        EQU (0x1 << 17) ;- (SUPC) WKUP Input 1 Status
AT91C_SUPC_WKUPIS2        EQU (0x1 << 18) ;- (SUPC) WKUP Input 2 Status
AT91C_SUPC_WKUPIS3        EQU (0x1 << 19) ;- (SUPC) WKUP Input 3 Status
AT91C_SUPC_WKUPIS4        EQU (0x1 << 20) ;- (SUPC) WKUP Input 4 Status
AT91C_SUPC_WKUPIS5        EQU (0x1 << 21) ;- (SUPC) WKUP Input 5 Status
AT91C_SUPC_WKUPIS6        EQU (0x1 << 22) ;- (SUPC) WKUP Input 6 Status
AT91C_SUPC_WKUPIS7        EQU (0x1 << 23) ;- (SUPC) WKUP Input 7 Status
AT91C_SUPC_WKUPIS8        EQU (0x1 << 24) ;- (SUPC) WKUP Input 8 Status
AT91C_SUPC_WKUPIS9        EQU (0x1 << 25) ;- (SUPC) WKUP Input 9 Status
AT91C_SUPC_WKUPIS10       EQU (0x1 << 26) ;- (SUPC) WKUP Input 10 Status
AT91C_SUPC_WKUPIS11       EQU (0x1 << 27) ;- (SUPC) WKUP Input 11 Status
AT91C_SUPC_WKUPIS12       EQU (0x1 << 28) ;- (SUPC) WKUP Input 12 Status
AT91C_SUPC_WKUPIS13       EQU (0x1 << 29) ;- (SUPC) WKUP Input 13 Status
AT91C_SUPC_WKUPIS14       EQU (0x1 << 30) ;- (SUPC) WKUP Input 14 Status
AT91C_SUPC_WKUPIS15       EQU (0x1 << 31) ;- (SUPC) WKUP Input 15 Status
// - -------- SUPC_FWUTR : (SUPC Offset: 0x18) Flash Wake Up Timer Register -------- 
AT91C_SUPC_FWUT           EQU (0x3FF <<  0) ;- (SUPC) Flash Wake Up Timer

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real Time Timer Controller Interface
// - *****************************************************************************
// - -------- RTTC_RTMR : (RTTC Offset: 0x0) Real-time Mode Register -------- 
AT91C_RTTC_RTPRES         EQU (0xFFFF <<  0) ;- (RTTC) Real-time Timer Prescaler Value
AT91C_RTTC_ALMIEN         EQU (0x1 << 16) ;- (RTTC) Alarm Interrupt Enable
AT91C_RTTC_RTTINCIEN      EQU (0x1 << 17) ;- (RTTC) Real Time Timer Increment Interrupt Enable
AT91C_RTTC_RTTRST         EQU (0x1 << 18) ;- (RTTC) Real Time Timer Restart
// - -------- RTTC_RTAR : (RTTC Offset: 0x4) Real-time Alarm Register -------- 
AT91C_RTTC_ALMV           EQU (0x0 <<  0) ;- (RTTC) Alarm Value
// - -------- RTTC_RTVR : (RTTC Offset: 0x8) Current Real-time Value Register -------- 
AT91C_RTTC_CRTV           EQU (0x0 <<  0) ;- (RTTC) Current Real-time Value
// - -------- RTTC_RTSR : (RTTC Offset: 0xc) Real-time Status Register -------- 
AT91C_RTTC_ALMS           EQU (0x1 <<  0) ;- (RTTC) Real-time Alarm Status
AT91C_RTTC_RTTINC         EQU (0x1 <<  1) ;- (RTTC) Real-time Timer Increment

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Watchdog Timer Controller Interface
// - *****************************************************************************
// - -------- WDTC_WDCR : (WDTC Offset: 0x0) Periodic Interval Image Register -------- 
AT91C_WDTC_WDRSTT         EQU (0x1 <<  0) ;- (WDTC) Watchdog Restart
AT91C_WDTC_KEY            EQU (0xFF << 24) ;- (WDTC) Watchdog KEY Password
// - -------- WDTC_WDMR : (WDTC Offset: 0x4) Watchdog Mode Register -------- 
AT91C_WDTC_WDV            EQU (0xFFF <<  0) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDFIEN         EQU (0x1 << 12) ;- (WDTC) Watchdog Fault Interrupt Enable
AT91C_WDTC_WDRSTEN        EQU (0x1 << 13) ;- (WDTC) Watchdog Reset Enable
AT91C_WDTC_WDRPROC        EQU (0x1 << 14) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDDIS          EQU (0x1 << 15) ;- (WDTC) Watchdog Disable
AT91C_WDTC_WDD            EQU (0xFFF << 16) ;- (WDTC) Watchdog Delta Value
AT91C_WDTC_WDDBGHLT       EQU (0x1 << 28) ;- (WDTC) Watchdog Debug Halt
AT91C_WDTC_WDIDLEHLT      EQU (0x1 << 29) ;- (WDTC) Watchdog Idle Halt
// - -------- WDTC_WDSR : (WDTC Offset: 0x8) Watchdog Status Register -------- 
AT91C_WDTC_WDUNF          EQU (0x1 <<  0) ;- (WDTC) Watchdog Underflow
AT91C_WDTC_WDERR          EQU (0x1 <<  1) ;- (WDTC) Watchdog Error

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real-time Clock Alarm and Parallel Load Interface
// - *****************************************************************************
// - -------- RTC_CR : (RTC Offset: 0x0) RTC Control Register -------- 
AT91C_RTC_UPDTIM          EQU (0x1 <<  0) ;- (RTC) Update Request Time Register
AT91C_RTC_UPDCAL          EQU (0x1 <<  1) ;- (RTC) Update Request Calendar Register
AT91C_RTC_TIMEVSEL        EQU (0x3 <<  8) ;- (RTC) Time Event Selection
AT91C_RTC_TIMEVSEL_MINUTE EQU (0x0 <<  8) ;- (RTC) Minute change.
AT91C_RTC_TIMEVSEL_HOUR   EQU (0x1 <<  8) ;- (RTC) Hour change.
AT91C_RTC_TIMEVSEL_DAY24  EQU (0x2 <<  8) ;- (RTC) Every day at midnight.
AT91C_RTC_TIMEVSEL_DAY12  EQU (0x3 <<  8) ;- (RTC) Every day at noon.
AT91C_RTC_CALEVSEL        EQU (0x3 << 16) ;- (RTC) Calendar Event Selection
AT91C_RTC_CALEVSEL_WEEK   EQU (0x0 << 16) ;- (RTC) Week change (every Monday at time 00:00:00).
AT91C_RTC_CALEVSEL_MONTH  EQU (0x1 << 16) ;- (RTC) Month change (every 01 of each month at time 00:00:00).
AT91C_RTC_CALEVSEL_YEAR   EQU (0x2 << 16) ;- (RTC) Year change (every January 1 at time 00:00:00).
// - -------- RTC_MR : (RTC Offset: 0x4) RTC Mode Register -------- 
AT91C_RTC_HRMOD           EQU (0x1 <<  0) ;- (RTC) 12-24 hour Mode
// - -------- RTC_TIMR : (RTC Offset: 0x8) RTC Time Register -------- 
AT91C_RTC_SEC             EQU (0x7F <<  0) ;- (RTC) Current Second
AT91C_RTC_MIN             EQU (0x7F <<  8) ;- (RTC) Current Minute
AT91C_RTC_HOUR            EQU (0x3F << 16) ;- (RTC) Current Hour
AT91C_RTC_AMPM            EQU (0x1 << 22) ;- (RTC) Ante Meridiem, Post Meridiem Indicator
// - -------- RTC_CALR : (RTC Offset: 0xc) RTC Calendar Register -------- 
AT91C_RTC_CENT            EQU (0x3F <<  0) ;- (RTC) Current Century
AT91C_RTC_YEAR            EQU (0xFF <<  8) ;- (RTC) Current Year
AT91C_RTC_MONTH           EQU (0x1F << 16) ;- (RTC) Current Month
AT91C_RTC_DAY             EQU (0x7 << 21) ;- (RTC) Current Day
AT91C_RTC_DATE            EQU (0x3F << 24) ;- (RTC) Current Date
// - -------- RTC_TIMALR : (RTC Offset: 0x10) RTC Time Alarm Register -------- 
AT91C_RTC_SECEN           EQU (0x1 <<  7) ;- (RTC) Second Alarm Enable
AT91C_RTC_MINEN           EQU (0x1 << 15) ;- (RTC) Minute Alarm
AT91C_RTC_HOUREN          EQU (0x1 << 23) ;- (RTC) Current Hour
// - -------- RTC_CALALR : (RTC Offset: 0x14) RTC Calendar Alarm Register -------- 
AT91C_RTC_MONTHEN         EQU (0x1 << 23) ;- (RTC) Month Alarm Enable
AT91C_RTC_DATEEN          EQU (0x1 << 31) ;- (RTC) Date Alarm Enable
// - -------- RTC_SR : (RTC Offset: 0x18) RTC Status Register -------- 
AT91C_RTC_ACKUPD          EQU (0x1 <<  0) ;- (RTC) Acknowledge for Update
AT91C_RTC_ALARM           EQU (0x1 <<  1) ;- (RTC) Alarm Flag
AT91C_RTC_SECEV           EQU (0x1 <<  2) ;- (RTC) Second Event
AT91C_RTC_TIMEV           EQU (0x1 <<  3) ;- (RTC) Time Event
AT91C_RTC_CALEV           EQU (0x1 <<  4) ;- (RTC) Calendar event
// - -------- RTC_SCCR : (RTC Offset: 0x1c) RTC Status Clear Command Register -------- 
// - -------- RTC_IER : (RTC Offset: 0x20) RTC Interrupt Enable Register -------- 
// - -------- RTC_IDR : (RTC Offset: 0x24) RTC Interrupt Disable Register -------- 
// - -------- RTC_IMR : (RTC Offset: 0x28) RTC Interrupt Mask Register -------- 
// - -------- RTC_VER : (RTC Offset: 0x2c) RTC Valid Entry Register -------- 
AT91C_RTC_NVTIM           EQU (0x1 <<  0) ;- (RTC) Non valid Time
AT91C_RTC_NVCAL           EQU (0x1 <<  1) ;- (RTC) Non valid Calendar
AT91C_RTC_NVTIMALR        EQU (0x1 <<  2) ;- (RTC) Non valid time Alarm
AT91C_RTC_NVCALALR        EQU (0x1 <<  3) ;- (RTC) Nonvalid Calendar Alarm

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Analog to Digital Convertor
// - *****************************************************************************
// - -------- ADC_CR : (ADC Offset: 0x0) ADC Control Register -------- 
AT91C_ADC_SWRST           EQU (0x1 <<  0) ;- (ADC) Software Reset
AT91C_ADC_START           EQU (0x1 <<  1) ;- (ADC) Start Conversion
// - -------- ADC_MR : (ADC Offset: 0x4) ADC Mode Register -------- 
AT91C_ADC_TRGEN           EQU (0x1 <<  0) ;- (ADC) Trigger Enable
AT91C_ADC_TRGEN_DIS       EQU (0x0) ;- (ADC) Hradware triggers are disabled. Starting a conversion is only possible by software
AT91C_ADC_TRGEN_EN        EQU (0x1) ;- (ADC) Hardware trigger selected by TRGSEL field is enabled.
AT91C_ADC_TRGSEL          EQU (0x7 <<  1) ;- (ADC) Trigger Selection
AT91C_ADC_TRGSEL_EXT      EQU (0x0 <<  1) ;- (ADC) Selected TRGSEL = External Trigger
AT91C_ADC_TRGSEL_TIOA0    EQU (0x1 <<  1) ;- (ADC) Selected TRGSEL = TIAO0
AT91C_ADC_TRGSEL_TIOA1    EQU (0x2 <<  1) ;- (ADC) Selected TRGSEL = TIAO1
AT91C_ADC_TRGSEL_TIOA2    EQU (0x3 <<  1) ;- (ADC) Selected TRGSEL = TIAO2
AT91C_ADC_TRGSEL_PWM0_TRIG EQU (0x4 <<  1) ;- (ADC) Selected TRGSEL = PWM trigger
AT91C_ADC_TRGSEL_PWM1_TRIG EQU (0x5 <<  1) ;- (ADC) Selected TRGSEL = PWM Trigger
AT91C_ADC_TRGSEL_RESERVED EQU (0x6 <<  1) ;- (ADC) Selected TRGSEL = Reserved
AT91C_ADC_LOWRES          EQU (0x1 <<  4) ;- (ADC) Resolution.
AT91C_ADC_LOWRES_10_BIT   EQU (0x0 <<  4) ;- (ADC) 10-bit resolution
AT91C_ADC_LOWRES_8_BIT    EQU (0x1 <<  4) ;- (ADC) 8-bit resolution
AT91C_ADC_SLEEP           EQU (0x1 <<  5) ;- (ADC) Sleep Mode
AT91C_ADC_SLEEP_NORMAL_MODE EQU (0x0 <<  5) ;- (ADC) Normal Mode
AT91C_ADC_SLEEP_MODE      EQU (0x1 <<  5) ;- (ADC) Sleep Mode
AT91C_ADC_PRESCAL         EQU (0x3F <<  8) ;- (ADC) Prescaler rate selection
AT91C_ADC_STARTUP         EQU (0x1F << 16) ;- (ADC) Startup Time
AT91C_ADC_SHTIM           EQU (0xF << 24) ;- (ADC) Sample & Hold Time
// - -------- 	ADC_CHER : (ADC Offset: 0x10) ADC Channel Enable Register -------- 
AT91C_ADC_CH0             EQU (0x1 <<  0) ;- (ADC) Channel 0
AT91C_ADC_CH1             EQU (0x1 <<  1) ;- (ADC) Channel 1
AT91C_ADC_CH2             EQU (0x1 <<  2) ;- (ADC) Channel 2
AT91C_ADC_CH3             EQU (0x1 <<  3) ;- (ADC) Channel 3
AT91C_ADC_CH4             EQU (0x1 <<  4) ;- (ADC) Channel 4
AT91C_ADC_CH5             EQU (0x1 <<  5) ;- (ADC) Channel 5
AT91C_ADC_CH6             EQU (0x1 <<  6) ;- (ADC) Channel 6
AT91C_ADC_CH7             EQU (0x1 <<  7) ;- (ADC) Channel 7
// - -------- 	ADC_CHDR : (ADC Offset: 0x14) ADC Channel Disable Register -------- 
// - -------- 	ADC_CHSR : (ADC Offset: 0x18) ADC Channel Status Register -------- 
// - -------- ADC_SR : (ADC Offset: 0x1c) ADC Status Register -------- 
AT91C_ADC_EOC0            EQU (0x1 <<  0) ;- (ADC) End of Conversion
AT91C_ADC_EOC1            EQU (0x1 <<  1) ;- (ADC) End of Conversion
AT91C_ADC_EOC2            EQU (0x1 <<  2) ;- (ADC) End of Conversion
AT91C_ADC_EOC3            EQU (0x1 <<  3) ;- (ADC) End of Conversion
AT91C_ADC_EOC4            EQU (0x1 <<  4) ;- (ADC) End of Conversion
AT91C_ADC_EOC5            EQU (0x1 <<  5) ;- (ADC) End of Conversion
AT91C_ADC_EOC6            EQU (0x1 <<  6) ;- (ADC) End of Conversion
AT91C_ADC_EOC7            EQU (0x1 <<  7) ;- (ADC) End of Conversion
AT91C_ADC_OVRE0           EQU (0x1 <<  8) ;- (ADC) Overrun Error
AT91C_ADC_OVRE1           EQU (0x1 <<  9) ;- (ADC) Overrun Error
AT91C_ADC_OVRE2           EQU (0x1 << 10) ;- (ADC) Overrun Error
AT91C_ADC_OVRE3           EQU (0x1 << 11) ;- (ADC) Overrun Error
AT91C_ADC_OVRE4           EQU (0x1 << 12) ;- (ADC) Overrun Error
AT91C_ADC_OVRE5           EQU (0x1 << 13) ;- (ADC) Overrun Error
AT91C_ADC_OVRE6           EQU (0x1 << 14) ;- (ADC) Overrun Error
AT91C_ADC_OVRE7           EQU (0x1 << 15) ;- (ADC) Overrun Error
AT91C_ADC_DRDY            EQU (0x1 << 16) ;- (ADC) Data Ready
AT91C_ADC_GOVRE           EQU (0x1 << 17) ;- (ADC) General Overrun
AT91C_ADC_ENDRX           EQU (0x1 << 18) ;- (ADC) End of Receiver Transfer
AT91C_ADC_RXBUFF          EQU (0x1 << 19) ;- (ADC) RXBUFF Interrupt
// - -------- ADC_LCDR : (ADC Offset: 0x20) ADC Last Converted Data Register -------- 
AT91C_ADC_LDATA           EQU (0x3FF <<  0) ;- (ADC) Last Data Converted
// - -------- ADC_IER : (ADC Offset: 0x24) ADC Interrupt Enable Register -------- 
// - -------- ADC_IDR : (ADC Offset: 0x28) ADC Interrupt Disable Register -------- 
// - -------- ADC_IMR : (ADC Offset: 0x2c) ADC Interrupt Mask Register -------- 
// - -------- ADC_CDR0 : (ADC Offset: 0x30) ADC Channel Data Register 0 -------- 
AT91C_ADC_DATA            EQU (0x3FF <<  0) ;- (ADC) Converted Data
// - -------- ADC_CDR1 : (ADC Offset: 0x34) ADC Channel Data Register 1 -------- 
// - -------- ADC_CDR2 : (ADC Offset: 0x38) ADC Channel Data Register 2 -------- 
// - -------- ADC_CDR3 : (ADC Offset: 0x3c) ADC Channel Data Register 3 -------- 
// - -------- ADC_CDR4 : (ADC Offset: 0x40) ADC Channel Data Register 4 -------- 
// - -------- ADC_CDR5 : (ADC Offset: 0x44) ADC Channel Data Register 5 -------- 
// - -------- ADC_CDR6 : (ADC Offset: 0x48) ADC Channel Data Register 6 -------- 
// - -------- ADC_CDR7 : (ADC Offset: 0x4c) ADC Channel Data Register 7 -------- 
// - -------- ADC_ACR : (ADC Offset: 0x64) ADC Analog Controler Register -------- 
AT91C_ADC_GAIN            EQU (0x3 <<  0) ;- (ADC) Input Gain
AT91C_ADC_IBCTL           EQU (0x3 <<  6) ;- (ADC) Bias Current Control
AT91C_ADC_IBCTL_00        EQU (0x0 <<  6) ;- (ADC) typ - 20%
AT91C_ADC_IBCTL_01        EQU (0x1 <<  6) ;- (ADC) typ
AT91C_ADC_IBCTL_10        EQU (0x2 <<  6) ;- (ADC) typ + 20%
AT91C_ADC_IBCTL_11        EQU (0x3 <<  6) ;- (ADC) typ + 40%
AT91C_ADC_DIFF            EQU (0x1 << 16) ;- (ADC) Differential Mode
AT91C_ADC_OFFSET          EQU (0x1 << 17) ;- (ADC) Input OFFSET
// - -------- ADC_EMR : (ADC Offset: 0x68) ADC Extended Mode Register -------- 
AT91C_OFFMODES            EQU (0x1 <<  0) ;- (ADC) Off Mode if
AT91C_OFF_MODE_STARTUP_TIME EQU (0x1 << 16) ;- (ADC) Startup Time
// - -------- ADC_VER : (ADC Offset: 0xfc) ADC VER -------- 
AT91C_ADC_VER             EQU (0xF <<  0) ;- (ADC) ADC VER

