una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Multimedia Card Interface
// - *****************************************************************************
// - -------- MCI_CR : (MCI Offset: 0x0) MCI Control Register -------- 
AT91C_MCI_MCIEN           EQU (0x1 <<  0) ;- (MCI) Multimedia Interface Enable
AT91C_MCI_MCIEN_0         EQU (0x0) ;- (MCI) No effect
AT91C_MCI_MCIEN_1         EQU (0x1) ;- (MCI) Enable the MultiMedia Interface if MCIDIS is 0
AT91C_MCI_MCIDIS          EQU (0x1 <<  1) ;- (MCI) Multimedia Interface Disable
AT91C_MCI_MCIDIS_0        EQU (0x0 <<  1) ;- (MCI) No effect
AT91C_MCI_MCIDIS_1        EQU (0x1 <<  1) ;- (MCI) Disable the MultiMedia Interface
AT91C_MCI_PWSEN           EQU (0x1 <<  2) ;- (MCI) Power Save Mode Enable
AT91C_MCI_PWSEN_0         EQU (0x0 <<  2) ;- (MCI) No effect
AT91C_MCI_PWSEN_1         EQU (0x1 <<  2) ;- (MCI) Enable the Power-saving mode if PWSDIS is 0.
AT91C_MCI_PWSDIS          EQU (0x1 <<  3) ;- (MCI) Power Save Mode Disable
AT91C_MCI_PWSDIS_0        EQU (0x0 <<  3) ;- (MCI) No effect
AT91C_MCI_PWSDIS_1        EQU (0x1 <<  3) ;- (MCI) Disable the Power-saving mode.
AT91C_MCI_IOWAITEN        EQU (0x1 <<  4) ;- (MCI) SDIO Read Wait Enable
AT91C_MCI_IOWAITEN_0      EQU (0x0 <<  4) ;- (MCI) No effect
AT91C_MCI_IOWAITEN_1      EQU (0x1 <<  4) ;- (MCI) Enables the SDIO Read Wait Operation.
AT91C_MCI_IOWAITDIS       EQU (0x1 <<  5) ;- (MCI) SDIO Read Wait Disable
AT91C_MCI_IOWAITDIS_0     EQU (0x0 <<  5) ;- (MCI) No effect
AT91C_MCI_IOWAITDIS_1     EQU (0x1 <<  5) ;- (MCI) Disables the SDIO Read Wait Operation.
AT91C_MCI_SWRST           EQU (0x1 <<  7) ;- (MCI) MCI Software reset
AT91C_MCI_SWRST_0         EQU (0x0 <<  7) ;- (MCI) No effect
AT91C_MCI_SWRST_1         EQU (0x1 <<  7) ;- (MCI) Resets the MCI
// - -------- MCI_MR : (MCI Offset: 0x4) MCI Mode Register -------- 
AT91C_MCI_CLKDIV          EQU (0xFF <<  0) ;- (MCI) Clock Divider
AT91C_MCI_PWSDIV          EQU (0x7 <<  8) ;- (MCI) Power Saving Divider
AT91C_MCI_RDPROOF         EQU (0x1 << 11) ;- (MCI) Read Proof Enable
AT91C_MCI_RDPROOF_DISABLE EQU (0x0 << 11) ;- (MCI) Disables Read Proof
AT91C_MCI_RDPROOF_ENABLE  EQU (0x1 << 11) ;- (MCI) Enables Read Proof
AT91C_MCI_WRPROOF         EQU (0x1 << 12) ;- (MCI) Write Proof Enable
AT91C_MCI_WRPROOF_DISABLE EQU (0x0 << 12) ;- (MCI) Disables Write Proof
AT91C_MCI_WRPROOF_ENABLE  EQU (0x1 << 12) ;- (MCI) Enables Write Proof
AT91C_MCI_PDCFBYTE        EQU (0x1 << 13) ;- (MCI) PDC Force Byte Transfer
AT91C_MCI_PDCFBYTE_DISABLE EQU (0x0 << 13) ;- (MCI) Disables PDC Force Byte Transfer
AT91C_MCI_PDCFBYTE_ENABLE EQU (0x1 << 13) ;- (MCI) Enables PDC Force Byte Transfer
AT91C_MCI_PDCPADV         EQU (0x1 << 14) ;- (MCI) PDC Padding Value
AT91C_MCI_PDCMODE         EQU (0x1 << 15) ;- (MCI) PDC Oriented Mode
AT91C_MCI_PDCMODE_DISABLE EQU (0x0 << 15) ;- (MCI) Disables PDC Transfer
AT91C_MCI_PDCMODE_ENABLE  EQU (0x1 << 15) ;- (MCI) Enables PDC Transfer
AT91C_MCI_BLKLEN          EQU (0xFFFF << 16) ;- (MCI) Data Block Length
// - -------- MCI_DTOR : (MCI Offset: 0x8) MCI Data Timeout Register -------- 
AT91C_MCI_DTOCYC          EQU (0xF <<  0) ;- (MCI) Data Timeout Cycle Number
AT91C_MCI_DTOMUL          EQU (0x7 <<  4) ;- (MCI) Data Timeout Multiplier
AT91C_MCI_DTOMUL_1        EQU (0x0 <<  4) ;- (MCI) DTOCYC x 1
AT91C_MCI_DTOMUL_16       EQU (0x1 <<  4) ;- (MCI) DTOCYC x 16
AT91C_MCI_DTOMUL_128      EQU (0x2 <<  4) ;- (MCI) DTOCYC x 128
AT91C_MCI_DTOMUL_256      EQU (0x3 <<  4) ;- (MCI) DTOCYC x 256
AT91C_MCI_DTOMUL_1024     EQU (0x4 <<  4) ;- (MCI) DTOCYC x 1024
AT91C_MCI_DTOMUL_4096     EQU (0x5 <<  4) ;- (MCI) DTOCYC x 4096
AT91C_MCI_DTOMUL_65536    EQU (0x6 <<  4) ;- (MCI) DTOCYC x 65536
AT91C_MCI_DTOMUL_1048576  EQU (0x7 <<  4) ;- (MCI) DTOCYC x 1048576
// - -------- MCI_SDCR : (MCI Offset: 0xc) MCI SD Card Register -------- 
AT91C_MCI_SCDSEL          EQU (0x3 <<  0) ;- (MCI) SD Card/SDIO Selector
AT91C_MCI_SCDSEL_SLOTA    EQU (0x0) ;- (MCI) Slot A selected
AT91C_MCI_SCDSEL_SLOTB    EQU (0x1) ;- (MCI) Slot B selected
AT91C_MCI_SCDSEL_SLOTC    EQU (0x2) ;- (MCI) Slot C selected
AT91C_MCI_SCDSEL_SLOTD    EQU (0x3) ;- (MCI) Slot D selected
AT91C_MCI_SCDBUS          EQU (0x3 <<  6) ;- (MCI) SDCard/SDIO Bus Width
AT91C_MCI_SCDBUS_1BIT     EQU (0x0 <<  6) ;- (MCI) 1-bit data bus
AT91C_MCI_SCDBUS_4BITS    EQU (0x2 <<  6) ;- (MCI) 4-bits data bus
AT91C_MCI_SCDBUS_8BITS    EQU (0x3 <<  6) ;- (MCI) 8-bits data bus
// - -------- MCI_CMDR : (MCI Offset: 0x14) MCI Command Register -------- 
AT91C_MCI_CMDNB           EQU (0x3F <<  0) ;- (MCI) Command Number
AT91C_MCI_RSPTYP          EQU (0x3 <<  6) ;- (MCI) Response Type
AT91C_MCI_RSPTYP_NO       EQU (0x0 <<  6) ;- (MCI) No response
AT91C_MCI_RSPTYP_48       EQU (0x1 <<  6) ;- (MCI) 48-bit response
AT91C_MCI_RSPTYP_136      EQU (0x2 <<  6) ;- (MCI) 136-bit response
AT91C_MCI_RSPTYP_R1B      EQU (0x3 <<  6) ;- (MCI) R1b response
AT91C_MCI_SPCMD           EQU (0x7 <<  8) ;- (MCI) Special CMD
AT91C_MCI_SPCMD_NONE      EQU (0x0 <<  8) ;- (MCI) Not a special CMD
AT91C_MCI_SPCMD_INIT      EQU (0x1 <<  8) ;- (MCI) Initialization CMD
AT91C_MCI_SPCMD_SYNC      EQU (0x2 <<  8) ;- (MCI) Synchronized CMD
AT91C_MCI_SPCMD_CE_ATA    EQU (0x3 <<  8) ;- (MCI) CE-ATA Completion Signal disable CMD
AT91C_MCI_SPCMD_IT_CMD    EQU (0x4 <<  8) ;- (MCI) Interrupt command
AT91C_MCI_SPCMD_IT_REP    EQU (0x5 <<  8) ;- (MCI) Interrupt response
AT91C_MCI_OPDCMD          EQU (0x1 << 11) ;- (MCI) Open Drain Command
AT91C_MCI_OPDCMD_PUSHPULL EQU (0x0 << 11) ;- (MCI) Push/pull command
AT91C_MCI_OPDCMD_OPENDRAIN EQU (0x1 << 11) ;- (MCI) Open drain command
AT91C_MCI_MAXLAT          EQU (0x1 << 12) ;- (MCI) Maximum Latency for Command to respond
AT91C_MCI_MAXLAT_5        EQU (0x0 << 12) ;- (MCI) 5 cycles maximum latency
AT91C_MCI_MAXLAT_64       EQU (0x1 << 12) ;- (MCI) 64 cycles maximum latency
AT91C_MCI_TRCMD           EQU (0x3 << 16) ;- (MCI) Transfer CMD
AT91C_MCI_TRCMD_NO        EQU (0x0 << 16) ;- (MCI) No transfer
AT91C_MCI_TRCMD_START     EQU (0x1 << 16) ;- (MCI) Start transfer
AT91C_MCI_TRCMD_STOP      EQU (0x2 << 16) ;- (MCI) Stop transfer
AT91C_MCI_TRDIR           EQU (0x1 << 18) ;- (MCI) Transfer Direction
AT91C_MCI_TRDIR_WRITE     EQU (0x0 << 18) ;- (MCI) Write
AT91C_MCI_TRDIR_READ      EQU (0x1 << 18) ;- (MCI) Read
AT91C_MCI_TRTYP           EQU (0x7 << 19) ;- (MCI) Transfer Type
AT91C_MCI_TRTYP_BLOCK     EQU (0x0 << 19) ;- (MCI) MMC/SDCard Single Block Transfer type
AT91C_MCI_TRTYP_MULTIPLE  EQU (0x1 << 19) ;- (MCI) MMC/SDCard Multiple Block transfer type
AT91C_MCI_TRTYP_STREAM    EQU (0x2 << 19) ;- (MCI) MMC Stream transfer type
AT91C_MCI_TRTYP_SDIO_BYTE EQU (0x4 << 19) ;- (MCI) SDIO Byte transfer type
AT91C_MCI_TRTYP_SDIO_BLOCK EQU (0x5 << 19) ;- (MCI) SDIO Block transfer type
AT91C_MCI_IOSPCMD         EQU (0x3 << 24) ;- (MCI) SDIO Special Command
AT91C_MCI_IOSPCMD_NONE    EQU (0x0 << 24) ;- (MCI) NOT a special command
AT91C_MCI_IOSPCMD_SUSPEND EQU (0x1 << 24) ;- (MCI) SDIO Suspend Command
AT91C_MCI_IOSPCMD_RESUME  EQU (0x2 << 24) ;- (MCI) SDIO Resume Command
AT91C_MCI_ATACS           EQU (0x1 << 26) ;- (MCI) ATA with command completion signal
AT91C_MCI_ATACS_NORMAL    EQU (0x0 << 26) ;- (MCI) normal operation mode
AT91C_MCI_ATACS_COMPLETION EQU (0x1 << 26) ;- (MCI) completion signal is expected within MCI_CSTOR
// - -------- MCI_BLKR : (MCI Offset: 0x18) MCI Block Register -------- 
AT91C_MCI_BCNT            EQU (0xFFFF <<  0) ;- (MCI) MMC/SDIO Block Count / SDIO Byte Count
// - -------- MCI_CSTOR : (MCI Offset: 0x1c) MCI Completion Signal Timeout Register -------- 
AT91C_MCI_CSTOCYC         EQU (0xF <<  0) ;- (MCI) Completion Signal Timeout Cycle Number
AT91C_MCI_CSTOMUL         EQU (0x7 <<  4) ;- (MCI) Completion Signal Timeout Multiplier
AT91C_MCI_CSTOMUL_1       EQU (0x0 <<  4) ;- (MCI) CSTOCYC x 1
AT91C_MCI_CSTOMUL_16      EQU (0x1 <<  4) ;- (MCI) CSTOCYC x  16
AT91C_MCI_CSTOMUL_128     EQU (0x2 <<  4) ;- (MCI) CSTOCYC x  128
AT91C_MCI_CSTOMUL_256     EQU (0x3 <<  4) ;- (MCI) CSTOCYC x  256
AT91C_MCI_CSTOMUL_1024    EQU (0x4 <<  4) ;- (MCI) CSTOCYC x  1024
AT91C_MCI_CSTOMUL_4096    EQU (0x5 <<  4) ;- (MCI) CSTOCYC x  4096
AT91C_MCI_CSTOMUL_65536   EQU (0x6 <<  4) ;- (MCI) CSTOCYC x  65536
AT91C_MCI_CSTOMUL_1048576 EQU (0x7 <<  4) ;- (MCI) CSTOCYC x  1048576
// - -------- MCI_SR : (MCI Offset: 0x40) MCI Status Register -------- 
AT91C_MCI_CMDRDY          EQU (0x1 <<  0) ;- (MCI) Command Ready flag
AT91C_MCI_RXRDY           EQU (0x1 <<  1) ;- (MCI) RX Ready flag
AT91C_MCI_TXRDY           EQU (0x1 <<  2) ;- (MCI) TX Ready flag
AT91C_MCI_BLKE            EQU (0x1 <<  3) ;- (MCI) Data Block Transfer Ended flag
AT91C_MCI_DTIP            EQU (0x1 <<  4) ;- (MCI) Data Transfer in Progress flag
AT91C_MCI_NOTBUSY         EQU (0x1 <<  5) ;- (MCI) Data Line Not Busy flag
AT91C_MCI_ENDRX           EQU (0x1 <<  6) ;- (MCI) End of RX Buffer flag
AT91C_MCI_ENDTX           EQU (0x1 <<  7) ;- (MCI) End of TX Buffer flag
AT91C_MCI_SDIOIRQA        EQU (0x1 <<  8) ;- (MCI) SDIO Interrupt for Slot A
AT91C_MCI_SDIOIRQB        EQU (0x1 <<  9) ;- (MCI) SDIO Interrupt for Slot B
AT91C_MCI_SDIOIRQC        EQU (0x1 << 10) ;- (MCI) SDIO Interrupt for Slot C
AT91C_MCI_SDIOIRQD        EQU (0x1 << 11) ;- (MCI) SDIO Interrupt for Slot D
AT91C_MCI_SDIOWAIT        EQU (0x1 << 12) ;- (MCI) SDIO Read Wait operation flag
AT91C_MCI_CSRCV           EQU (0x1 << 13) ;- (MCI) CE-ATA Completion Signal flag
AT91C_MCI_RXBUFF          EQU (0x1 << 14) ;- (MCI) RX Buffer Full flag
AT91C_MCI_TXBUFE          EQU (0x1 << 15) ;- (MCI) TX Buffer Empty flag
AT91C_MCI_RINDE           EQU (0x1 << 16) ;- (MCI) Response Index Error flag
AT91C_MCI_RDIRE           EQU (0x1 << 17) ;- (MCI) Response Direction Error flag
AT91C_MCI_RCRCE           EQU (0x1 << 18) ;- (MCI) Response CRC Error flag
AT91C_MCI_RENDE           EQU (0x1 << 19) ;- (MCI) Response End Bit Error flag
AT91C_MCI_RTOE            EQU (0x1 << 20) ;- (MCI) Response Time-out Error flag
AT91C_MCI_DCRCE           EQU (0x1 << 21) ;- (MCI) data CRC Error flag
AT91C_MCI_DTOE            EQU (0x1 << 22) ;- (MCI) Data timeout Error flag
AT91C_MCI_CSTOE           EQU (0x1 << 23) ;- (MCI) Completion Signal timeout Error flag
AT91C_MCI_BLKOVRE         EQU (0x1 << 24) ;- (MCI) DMA Block Overrun Error flag
AT91C_MCI_DMADONE         EQU (0x1 << 25) ;- (MCI) DMA Transfer Done flag
AT91C_MCI_FIFOEMPTY       EQU (0x1 << 26) ;- (MCI) FIFO Empty flag
AT91C_MCI_XFRDONE         EQU (0x1 << 27) ;- (MCI) Transfer Done flag
AT91C_MCI_OVRE            EQU (0x1 << 30) ;- (MCI) Overrun flag
AT91C_MCI_UNRE            EQU (0x1 << 31) ;- (MCI) Underrun flag
// - -------- MCI_IER : (MCI Offset: 0x44) MCI Interrupt Enable Register -------- 
// - -------- MCI_IDR : (MCI Offset: 0x48) MCI Interrupt Disable Register -------- 
// - -------- MCI_IMR : (MCI Offset: 0x4c) MCI Interrupt Mask Register -------- 
// - -------- MCI_DMA : (MCI Offset: 0x50) MCI DMA Configuration Register -------- 
AT91C_MCI_OFFSET          EQU (0x3 <<  0) ;- (MCI) DMA Write Buffer Offset
AT91C_MCI_CHKSIZE         EQU (0x7 <<  4) ;- (MCI) DMA Channel Read/Write Chunk Size
AT91C_MCI_CHKSIZE_1       EQU (0x0 <<  4) ;- (MCI) Number of data transferred is 1
AT91C_MCI_CHKSIZE_4       EQU (0x1 <<  4) ;- (MCI) Number of data transferred is 4
AT91C_MCI_CHKSIZE_8       EQU (0x2 <<  4) ;- (MCI) Number of data transferred is 8
AT91C_MCI_CHKSIZE_16      EQU (0x3 <<  4) ;- (MCI) Number of data transferred is 16
AT91C_MCI_CHKSIZE_32      EQU (0x4 <<  4) ;- (MCI) Number of data transferred is 32
AT91C_MCI_DMAEN           EQU (0x1 <<  8) ;- (MCI) DMA Hardware Handshaking Enable
AT91C_MCI_DMAEN_DISABLE   EQU (0x0 <<  8) ;- (MCI) DMA interface is disabled
AT91C_MCI_DMAEN_ENABLE    EQU (0x1 <<  8) ;- (MCI) DMA interface is enabled
// - -------- MCI_CFG : (MCI Offset: 0x54) MCI Configuration Register -------- 
AT91C_MCI_FIFOMODE        EQU (0x1 <<  0) ;- (MCI) MCI Internal FIFO Control Mode
AT91C_MCI_FIFOMODE_AMOUNTDATA EQU (0x0) ;- (MCI) A write transfer starts when a sufficient amount of datas is written into the FIFO
AT91C_MCI_FIFOMODE_ONEDATA EQU (0x1) ;- (MCI) A write transfer starts as soon as one data is written into the FIFO
AT91C_MCI_FERRCTRL        EQU (0x1 <<  4) ;- (MCI) Flow Error Flag Reset Control Mode
AT91C_MCI_FERRCTRL_RWCMD  EQU (0x0 <<  4) ;- (MCI) When an underflow/overflow condition flag is set, a new Write/Read command is needed to reset the flag
AT91C_MCI_FERRCTRL_READSR EQU (0x1 <<  4) ;- (MCI) When an underflow/overflow condition flag is set, a read status resets the flag
AT91C_MCI_HSMODE          EQU (0x1 <<  8) ;- (MCI) High Speed Mode
AT91C_MCI_HSMODE_DISABLE  EQU (0x0 <<  8) ;- (MCI) Default Bus Timing Mode
AT91C_MCI_HSMODE_ENABLE   EQU (0x1 <<  8) ;- (MCI) High Speed Mode
AT91C_MCI_LSYNC           EQU (0x1 << 12) ;- (MCI) Synchronize on last block
AT91C_MCI_LSYNC_CURRENT   EQU (0x0 << 12) ;- (MCI) Pending command sent at end of current data block
AT91C_MCI_LSYNC_INFINITE  EQU (0x1 << 12) ;- (MCI) Pending command sent at end of block transfer when transfer length is not infinite
// - -------- MCI_WPCR : (MCI Offset: 0xe4) Write Protection Control Register -------- 
AT91C_MCI_WP_EN           EQU (0x1 <<  0) ;- (MCI) Write Protection Enable
AT91C_MCI_WP_EN_DISABLE   EQU (0x0) ;- (MCI) Write Operation is disabled (if WP_KEY corresponds)
AT91C_MCI_WP_EN_ENABLE    EQU (0x1) ;- (MCI) Write Operation is enabled (if WP_KEY corresponds)
AT91C_MCI_WP_KEY          EQU (0xFFFFFF <<  8) ;- (MCI) Write Protection Key
// - -------- MCI_WPSR : (MCI Offset: 0xe8) Write Protection Status Register -------- 
AT91C_MCI_WP_VS           EQU (0xF <<  0) ;- (MCI) Write Protection Violation Status
AT91C_MCI_WP_VS_NO_VIOLATION EQU (0x0) ;- (MCI) No Write Protection Violation detected since last read
AT91C_MCI_WP_VS_ON_WRITE  EQU (0x1) ;- (MCI) Write Protection Violation detected since last read
AT91C_MCI_WP_VS_ON_RESET  EQU (0x2) ;- (MCI) Software Reset Violation detected since last read
AT91C_MCI_WP_VS_ON_BOTH   EQU (0x3) ;- (MCI) Write Protection and Software Reset Violation detected since last read
AT91C_MCI_WP_VSRC         EQU (0xF <<  8) ;- (MCI) Write Protection Violation Source
AT91C_MCI_WP_VSRC_NO_VIOLATION EQU (0x0 <<  8) ;- (MCI) No Write Protection Violation detected since last read
AT91C_MCI_WP_VSRC_MCI_MR  EQU (0x1 <<  8) ;- (MCI) Write Protection Violation detected on MCI_MR since last read
AT91C_MCI_WP_VSRC_MCI_DTOR EQU (0x2 <<  8) ;- (MCI) Write Protection Violation detected on MCI_DTOR since last read
AT91C_MCI_WP_VSRC_MCI_SDCR EQU (0x3 <<  8) ;- (MCI) Write Protection Violation detected on MCI_SDCR since last read
AT91C_MCI_WP_VSRC_MCI_CSTOR EQU (0x4 <<  8) ;- (MCI) Write Protection Violation detected on MCI_CSTOR since last read
AT91C_MCI_WP_VSRC_MCI_DMA EQU (0x5 <<  8) ;- (MCI) Write Protection Violation detected on MCI_DMA since last read
AT91C_MCI_WP_VSRC_MCI_CFG EQU (0x6 <<  8) ;- (MCI) Write Protection Violation detected on MCI_CFG since last read
AT91C_MCI_WP_VSRC_MCI_DEL EQU (0x7 <<  8) ;- (MCI) Write Protection Violation detected on MCI_DEL since last read
// - -------- MCI_VER : (MCI Offset: 0xfc)  VERSION  Register -------- 
AT91C_MCI_VER             EQU (0xF <<  0) ;- (MCI)  VERSION  Register

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Two-wire Interface
// - *****************************************************************************
// - -------- TWI_CR : (TWI Offset: 0x0) TWI Control Register -------- 
AT91C_TWI_START           EQU (0x1 <<  0) ;- (TWI) Send a START Condition
AT91C_TWI_STOP            EQU (0x1 <<  1) ;- (TWI) Send a STOP Condition
AT91C_TWI_MSEN            EQU (0x1 <<  2) ;- (TWI) TWI Master Transfer Enabled
AT91C_TWI_MSDIS           EQU (0x1 <<  3) ;- (TWI) TWI Master Transfer Disabled
AT91C_TWI_SVEN            EQU (0x1 <<  4) ;- (TWI) TWI Slave mode Enabled
AT91C_TWI_SVDIS           EQU (0x1 <<  5) ;- (TWI) TWI Slave mode Disabled
AT91C_TWI_SWRST           EQU (0x1 <<  7) ;- (TWI) Software Reset
// - -------- TWI_MMR : (TWI Offset: 0x4) TWI Master Mode Register -------- 
AT91C_TWI_IADRSZ          EQU (0x3 <<  8) ;- (TWI) Internal Device Address Size
AT91C_TWI_IADRSZ_NO       EQU (0x0 <<  8) ;- (TWI) No internal device address
AT91C_TWI_IADRSZ_1_BYTE   EQU (0x1 <<  8) ;- (TWI) One-byte internal device address
AT91C_TWI_IADRSZ_2_BYTE   EQU (0x2 <<  8) ;- (TWI) Two-byte internal device address
AT91C_TWI_IADRSZ_3_BYTE   EQU (0x3 <<  8) ;- (TWI) Three-byte internal device address
AT91C_TWI_MREAD           EQU (0x1 << 12) ;- (TWI) Master Read Direction
AT91C_TWI_DADR            EQU (0x7F << 16) ;- (TWI) Device Address
// - -------- TWI_SMR : (TWI Offset: 0x8) TWI Slave Mode Register -------- 
AT91C_TWI_SADR            EQU (0x7F << 16) ;- (TWI) Slave Address
// - -------- TWI_CWGR : (TWI Offset: 0x10) TWI Clock Waveform Generator Register -------- 
AT91C_TWI_CLDIV           EQU (0xFF <<  0) ;- (TWI) Clock Low Divider
AT91C_TWI_CHDIV           EQU (0xFF <<  8) ;- (TWI) Clock High Divider
AT91C_TWI_CKDIV           EQU (0x7 << 16) ;- (TWI) Clock Divider
// - -------- TWI_SR : (TWI Offset: 0x20) TWI Status Register -------- 
AT91C_TWI_TXCOMP_SLAVE    EQU (0x1 <<  0) ;- (TWI) Transmission Completed
AT91C_TWI_TXCOMP_MASTER   EQU (0x1 <<  0) ;- (TWI) Transmission Completed
AT91C_TWI_RXRDY           EQU (0x1 <<  1) ;- (TWI) Receive holding register ReaDY
AT91C_TWI_TXRDY_MASTER    EQU (0x1 <<  2) ;- (TWI) Transmit holding register ReaDY
AT91C_TWI_TXRDY_SLAVE     EQU (0x1 <<  2) ;- (TWI) Transmit holding register ReaDY
AT91C_TWI_SVREAD          EQU (0x1 <<  3) ;- (TWI) Slave READ (used only in Slave mode)
AT91C_TWI_SVACC           EQU (0x1 <<  4) ;- (TWI) Slave ACCess (used only in Slave mode)
AT91C_TWI_GACC            EQU (0x1 <<  5) ;- (TWI) General Call ACcess (used only in Slave mode)
AT91C_TWI_OVRE            EQU (0x1 <<  6) ;- (TWI) Overrun Error (used only in Master and Multi-master mode)
AT91C_TWI_NACK_SLAVE      EQU (0x1 <<  8) ;- (TWI) Not Acknowledged
AT91C_TWI_NACK_MASTER     EQU (0x1 <<  8) ;- (TWI) Not Acknowledged
AT91C_TWI_ARBLST_MULTI_MASTER EQU (0x1 <<  9) ;- (TWI) Arbitration Lost (used only in Multimaster mode)
AT91C_TWI_SCLWS           EQU (0x1 << 10) ;- (TWI) Clock Wait State (used only in Slave mode)
AT91C_TWI_EOSACC          EQU (0x1 << 11) ;- (TWI) End Of Slave ACCess (used only in Slave mode)
AT91C_TWI_ENDRX           EQU (0x1 << 12) ;- (TWI) End of Receiver Transfer
AT91C_TWI_ENDTX           EQU (0x1 << 13) ;- (TWI) End of Receiver Transfer
AT91C_TWI_RXBUFF          EQU (0x1 << 14) ;- (TWI) RXBUFF Interrupt
AT91C_TWI_TXBUFE          EQU (0x1 << 15) ;- (TWI) TXBUFE Interrupt
// - -------- TWI_IER : (TWI Offset: 0x24) TWI Interrupt Enable Register -------- 
// - -------- TWI_IDR : (TWI Offset: 0x28) TWI Interrupt Disable Register -------- 
// - -------- TWI_IMR : (TWI Offset: 0x2c) TWI Interrupt Mask Register -------- 

