una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
AT91C_PWMC_OSSUPDH9       EQU (0x1 <<  9) ;- (PWMC) Output Selection Set for PWMH output of the channel 9
AT91C_PWMC_OSSUPDH10      EQU (0x1 << 10) ;- (PWMC) Output Selection Set for PWMH output of the channel 10
AT91C_PWMC_OSSUPDH11      EQU (0x1 << 11) ;- (PWMC) Output Selection Set for PWMH output of the channel 11
AT91C_PWMC_OSSUPDH12      EQU (0x1 << 12) ;- (PWMC) Output Selection Set for PWMH output of the channel 12
AT91C_PWMC_OSSUPDH13      EQU (0x1 << 13) ;- (PWMC) Output Selection Set for PWMH output of the channel 13
AT91C_PWMC_OSSUPDH14      EQU (0x1 << 14) ;- (PWMC) Output Selection Set for PWMH output of the channel 14
AT91C_PWMC_OSSUPDH15      EQU (0x1 << 15) ;- (PWMC) Output Selection Set for PWMH output of the channel 15
AT91C_PWMC_OSSUPDL0       EQU (0x1 << 16) ;- (PWMC) Output Selection Set for PWML output of the channel 0
AT91C_PWMC_OSSUPDL1       EQU (0x1 << 17) ;- (PWMC) Output Selection Set for PWML output of the channel 1
AT91C_PWMC_OSSUPDL2       EQU (0x1 << 18) ;- (PWMC) Output Selection Set for PWML output of the channel 2
AT91C_PWMC_OSSUPDL3       EQU (0x1 << 19) ;- (PWMC) Output Selection Set for PWML output of the channel 3
AT91C_PWMC_OSSUPDL4       EQU (0x1 << 20) ;- (PWMC) Output Selection Set for PWML output of the channel 4
AT91C_PWMC_OSSUPDL5       EQU (0x1 << 21) ;- (PWMC) Output Selection Set for PWML output of the channel 5
AT91C_PWMC_OSSUPDL6       EQU (0x1 << 22) ;- (PWMC) Output Selection Set for PWML output of the channel 6
AT91C_PWMC_OSSUPDL7       EQU (0x1 << 23) ;- (PWMC) Output Selection Set for PWML output of the channel 7
AT91C_PWMC_OSSUPDL8       EQU (0x1 << 24) ;- (PWMC) Output Selection Set for PWML output of the channel 8
AT91C_PWMC_OSSUPDL9       EQU (0x1 << 25) ;- (PWMC) Output Selection Set for PWML output of the channel 9
AT91C_PWMC_OSSUPDL10      EQU (0x1 << 26) ;- (PWMC) Output Selection Set for PWML output of the channel 10
AT91C_PWMC_OSSUPDL11      EQU (0x1 << 27) ;- (PWMC) Output Selection Set for PWML output of the channel 11
AT91C_PWMC_OSSUPDL12      EQU (0x1 << 28) ;- (PWMC) Output Selection Set for PWML output of the channel 12
AT91C_PWMC_OSSUPDL13      EQU (0x1 << 29) ;- (PWMC) Output Selection Set for PWML output of the channel 13
AT91C_PWMC_OSSUPDL14      EQU (0x1 << 30) ;- (PWMC) Output Selection Set for PWML output of the channel 14
AT91C_PWMC_OSSUPDL15      EQU (0x1 << 31) ;- (PWMC) Output Selection Set for PWML output of the channel 15
// - -------- PWMC_OSCUPD : (PWMC Offset: 0x58) Output Selection Clear for PWMH / PWML output of the channel x -------- 
AT91C_PWMC_OSCUPDH0       EQU (0x1 <<  0) ;- (PWMC) Output Selection Clear for PWMH output of the channel 0
AT91C_PWMC_OSCUPDH1       EQU (0x1 <<  1) ;- (PWMC) Output Selection Clear for PWMH output of the channel 1
AT91C_PWMC_OSCUPDH2       EQU (0x1 <<  2) ;- (PWMC) Output Selection Clear for PWMH output of the channel 2
AT91C_PWMC_OSCUPDH3       EQU (0x1 <<  3) ;- (PWMC) Output Selection Clear for PWMH output of the channel 3
AT91C_PWMC_OSCUPDH4       EQU (0x1 <<  4) ;- (PWMC) Output Selection Clear for PWMH output of the channel 4
AT91C_PWMC_OSCUPDH5       EQU (0x1 <<  5) ;- (PWMC) Output Selection Clear for PWMH output of the channel 5
AT91C_PWMC_OSCUPDH6       EQU (0x1 <<  6) ;- (PWMC) Output Selection Clear for PWMH output of the channel 6
AT91C_PWMC_OSCUPDH7       EQU (0x1 <<  7) ;- (PWMC) Output Selection Clear for PWMH output of the channel 7
AT91C_PWMC_OSCUPDH8       EQU (0x1 <<  8) ;- (PWMC) Output Selection Clear for PWMH output of the channel 8
AT91C_PWMC_OSCUPDH9       EQU (0x1 <<  9) ;- (PWMC) Output Selection Clear for PWMH output of the channel 9
AT91C_PWMC_OSCUPDH10      EQU (0x1 << 10) ;- (PWMC) Output Selection Clear for PWMH output of the channel 10
AT91C_PWMC_OSCUPDH11      EQU (0x1 << 11) ;- (PWMC) Output Selection Clear for PWMH output of the channel 11
AT91C_PWMC_OSCUPDH12      EQU (0x1 << 12) ;- (PWMC) Output Selection Clear for PWMH output of the channel 12
AT91C_PWMC_OSCUPDH13      EQU (0x1 << 13) ;- (PWMC) Output Selection Clear for PWMH output of the channel 13
AT91C_PWMC_OSCUPDH14      EQU (0x1 << 14) ;- (PWMC) Output Selection Clear for PWMH output of the channel 14
AT91C_PWMC_OSCUPDH15      EQU (0x1 << 15) ;- (PWMC) Output Selection Clear for PWMH output of the channel 15
AT91C_PWMC_OSCUPDL0       EQU (0x1 << 16) ;- (PWMC) Output Selection Clear for PWML output of the channel 0
AT91C_PWMC_OSCUPDL1       EQU (0x1 << 17) ;- (PWMC) Output Selection Clear for PWML output of the channel 1
AT91C_PWMC_OSCUPDL2       EQU (0x1 << 18) ;- (PWMC) Output Selection Clear for PWML output of the channel 2
AT91C_PWMC_OSCUPDL3       EQU (0x1 << 19) ;- (PWMC) Output Selection Clear for PWML output of the channel 3
AT91C_PWMC_OSCUPDL4       EQU (0x1 << 20) ;- (PWMC) Output Selection Clear for PWML output of the channel 4
AT91C_PWMC_OSCUPDL5       EQU (0x1 << 21) ;- (PWMC) Output Selection Clear for PWML output of the channel 5
AT91C_PWMC_OSCUPDL6       EQU (0x1 << 22) ;- (PWMC) Output Selection Clear for PWML output of the channel 6
AT91C_PWMC_OSCUPDL7       EQU (0x1 << 23) ;- (PWMC) Output Selection Clear for PWML output of the channel 7
AT91C_PWMC_OSCUPDL8       EQU (0x1 << 24) ;- (PWMC) Output Selection Clear for PWML output of the channel 8
AT91C_PWMC_OSCUPDL9       EQU (0x1 << 25) ;- (PWMC) Output Selection Clear for PWML output of the channel 9
AT91C_PWMC_OSCUPDL10      EQU (0x1 << 26) ;- (PWMC) Output Selection Clear for PWML output of the channel 10
AT91C_PWMC_OSCUPDL11      EQU (0x1 << 27) ;- (PWMC) Output Selection Clear for PWML output of the channel 11
AT91C_PWMC_OSCUPDL12      EQU (0x1 << 28) ;- (PWMC) Output Selection Clear for PWML output of the channel 12
AT91C_PWMC_OSCUPDL13      EQU (0x1 << 29) ;- (PWMC) Output Selection Clear for PWML output of the channel 13
AT91C_PWMC_OSCUPDL14      EQU (0x1 << 30) ;- (PWMC) Output Selection Clear for PWML output of the channel 14
AT91C_PWMC_OSCUPDL15      EQU (0x1 << 31) ;- (PWMC) Output Selection Clear for PWML output of the channel 15
// - -------- PWMC_FMR : (PWMC Offset: 0x5c) PWM Fault Mode Register -------- 
AT91C_PWMC_FPOL0          EQU (0x1 <<  0) ;- (PWMC) Fault Polarity on fault input 0
AT91C_PWMC_FPOL1          EQU (0x1 <<  1) ;- (PWMC) Fault Polarity on fault input 1
AT91C_PWMC_FPOL2          EQU (0x1 <<  2) ;- (PWMC) Fault Polarity on fault input 2
AT91C_PWMC_FPOL3          EQU (0x1 <<  3) ;- (PWMC) Fault Polarity on fault input 3
AT91C_PWMC_FPOL4          EQU (0x1 <<  4) ;- (PWMC) Fault Polarity on fault input 4
AT91C_PWMC_FPOL5          EQU (0x1 <<  5) ;- (PWMC) Fault Polarity on fault input 5
AT91C_PWMC_FPOL6          EQU (0x1 <<  6) ;- (PWMC) Fault Polarity on fault input 6
AT91C_PWMC_FPOL7          EQU (0x1 <<  7) ;- (PWMC) Fault Polarity on fault input 7
AT91C_PWMC_FMOD0          EQU (0x1 <<  8) ;- (PWMC) Fault Activation Mode on fault input 0
AT91C_PWMC_FMOD1          EQU (0x1 <<  9) ;- (PWMC) Fault Activation Mode on fault input 1
AT91C_PWMC_FMOD2          EQU (0x1 << 10) ;- (PWMC) Fault Activation Mode on fault input 2
AT91C_PWMC_FMOD3          EQU (0x1 << 11) ;- (PWMC) Fault Activation Mode on fault input 3
AT91C_PWMC_FMOD4          EQU (0x1 << 12) ;- (PWMC) Fault Activation Mode on fault input 4
AT91C_PWMC_FMOD5          EQU (0x1 << 13) ;- (PWMC) Fault Activation Mode on fault input 5
AT91C_PWMC_FMOD6          EQU (0x1 << 14) ;- (PWMC) Fault Activation Mode on fault input 6
AT91C_PWMC_FMOD7          EQU (0x1 << 15) ;- (PWMC) Fault Activation Mode on fault input 7
AT91C_PWMC_FFIL00         EQU (0x1 << 16) ;- (PWMC) Fault Filtering on fault input 0
AT91C_PWMC_FFIL01         EQU (0x1 << 17) ;- (PWMC) Fault Filtering on fault input 1
AT91C_PWMC_FFIL02         EQU (0x1 << 18) ;- (PWMC) Fault Filtering on fault input 2
AT91C_PWMC_FFIL03         EQU (0x1 << 19) ;- (PWMC) Fault Filtering on fault input 3
AT91C_PWMC_FFIL04         EQU (0x1 << 20) ;- (PWMC) Fault Filtering on fault input 4
AT91C_PWMC_FFIL05         EQU (0x1 << 21) ;- (PWMC) Fault Filtering on fault input 5
AT91C_PWMC_FFIL06         EQU (0x1 << 22) ;- (PWMC) Fault Filtering on fault input 6
AT91C_PWMC_FFIL07         EQU (0x1 << 23) ;- (PWMC) Fault Filtering on fault input 7
// - -------- PWMC_FSR : (PWMC Offset: 0x60) Fault Input x Value -------- 
AT91C_PWMC_FIV0           EQU (0x1 <<  0) ;- (PWMC) Fault Input 0 Value
AT91C_PWMC_FIV1           EQU (0x1 <<  1) ;- (PWMC) Fault Input 1 Value
AT91C_PWMC_FIV2           EQU (0x1 <<  2) ;- (PWMC) Fault Input 2 Value
AT91C_PWMC_FIV3           EQU (0x1 <<  3) ;- (PWMC) Fault Input 3 Value
AT91C_PWMC_FIV4           EQU (0x1 <<  4) ;- (PWMC) Fault Input 4 Value
AT91C_PWMC_FIV5           EQU (0x1 <<  5) ;- (PWMC) Fault Input 5 Value
AT91C_PWMC_FIV6           EQU (0x1 <<  6) ;- (PWMC) Fault Input 6 Value
AT91C_PWMC_FIV7           EQU (0x1 <<  7) ;- (PWMC) Fault Input 7 Value
AT91C_PWMC_FS0            EQU (0x1 <<  8) ;- (PWMC) Fault 0 Status
AT91C_PWMC_FS1            EQU (0x1 <<  9) ;- (PWMC) Fault 1 Status
AT91C_PWMC_FS2            EQU (0x1 << 10) ;- (PWMC) Fault 2 Status
AT91C_PWMC_FS3            EQU (0x1 << 11) ;- (PWMC) Fault 3 Status
AT91C_PWMC_FS4            EQU (0x1 << 12) ;- (PWMC) Fault 4 Status
AT91C_PWMC_FS5            EQU (0x1 << 13) ;- (PWMC) Fault 5 Status
AT91C_PWMC_FS6            EQU (0x1 << 14) ;- (PWMC) Fault 6 Status
AT91C_PWMC_FS7            EQU (0x1 << 15) ;- (PWMC) Fault 7 Status
// - -------- PWMC_FCR : (PWMC Offset: 0x64) Fault y Clear -------- 
AT91C_PWMC_FCLR0          EQU (0x1 <<  0) ;- (PWMC) Fault 0 Clear
AT91C_PWMC_FCLR1          EQU (0x1 <<  1) ;- (PWMC) Fault 1 Clear
AT91C_PWMC_FCLR2          EQU (0x1 <<  2) ;- (PWMC) Fault 2 Clear
AT91C_PWMC_FCLR3          EQU (0x1 <<  3) ;- (PWMC) Fault 3 Clear
AT91C_PWMC_FCLR4          EQU (0x1 <<  4) ;- (PWMC) Fault 4 Clear
AT91C_PWMC_FCLR5          EQU (0x1 <<  5) ;- (PWMC) Fault 5 Clear
AT91C_PWMC_FCLR6          EQU (0x1 <<  6) ;- (PWMC) Fault 6 Clear
AT91C_PWMC_FCLR7          EQU (0x1 <<  7) ;- (PWMC) Fault 7 Clear
// - -------- PWMC_FPV : (PWMC Offset: 0x68) PWM Fault Protection Value -------- 
AT91C_PWMC_FPVH0          EQU (0x1 <<  0) ;- (PWMC) Fault Protection Value for PWMH output on channel 0
AT91C_PWMC_FPVH1          EQU (0x1 <<  1) ;- (PWMC) Fault Protection Value for PWMH output on channel 1
AT91C_PWMC_FPVH2          EQU (0x1 <<  2) ;- (PWMC) Fault Protection Value for PWMH output on channel 2
AT91C_PWMC_FPVH3          EQU (0x1 <<  3) ;- (PWMC) Fault Protection Value for PWMH output on channel 3
AT91C_PWMC_FPVH4          EQU (0x1 <<  4) ;- (PWMC) Fault Protection Value for PWMH output on channel 4
AT91C_PWMC_FPVH5          EQU (0x1 <<  5) ;- (PWMC) Fault Protection Value for PWMH output on channel 5
AT91C_PWMC_FPVH6          EQU (0x1 <<  6) ;- (PWMC) Fault Protection Value for PWMH output on channel 6
AT91C_PWMC_FPVH7          EQU (0x1 <<  7) ;- (PWMC) Fault Protection Value for PWMH output on channel 7
AT91C_PWMC_FPVL0          EQU (0x1 << 16) ;- (PWMC) Fault Protection Value for PWML output on channel 0
AT91C_PWMC_FPVL1          EQU (0x1 << 17) ;- (PWMC) Fault Protection Value for PWML output on channel 1
AT91C_PWMC_FPVL2          EQU (0x1 << 18) ;- (PWMC) Fault Protection Value for PWML output on channel 2
AT91C_PWMC_FPVL3          EQU (0x1 << 19) ;- (PWMC) Fault Protection Value for PWML output on channel 3
AT91C_PWMC_FPVL4          EQU (0x1 << 20) ;- (PWMC) Fault Protection Value for PWML output on channel 4
AT91C_PWMC_FPVL5          EQU (0x1 << 21) ;- (PWMC) Fault Protection Value for PWML output on channel 5
AT91C_PWMC_FPVL6          EQU (0x1 << 22) ;- (PWMC) Fault Protection Value for PWML output on channel 6
AT91C_PWMC_FPVL7          EQU (0x1 << 23) ;- (PWMC) Fault Protection Value for PWML output on channel 7
// - -------- PWMC_FPER1 : (PWMC Offset: 0x6c) PWM Fault Protection Enable Register 1 -------- 
AT91C_PWMC_FPE0           EQU (0xFF <<  0) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 0
AT91C_PWMC_FPE1           EQU (0xFF <<  8) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 1
AT91C_PWMC_FPE2           EQU (0xFF << 16) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 2
AT91C_PWMC_FPE3           EQU (0xFF << 24) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 3
// - -------- PWMC_FPER2 : (PWMC Offset: 0x70) PWM Fault Protection Enable Register 2 -------- 
AT91C_PWMC_FPE4           EQU (0xFF <<  0) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 4
AT91C_PWMC_FPE5           EQU (0xFF <<  8) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 5
AT91C_PWMC_FPE6           EQU (0xFF << 16) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 6
AT91C_PWMC_FPE7           EQU (0xFF << 24) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 7
// - -------- PWMC_FPER3 : (PWMC Offset: 0x74) PWM Fault Protection Enable Register 3 -------- 
AT91C_PWMC_FPE8           EQU (0xFF <<  0) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 8
AT91C_PWMC_FPE9           EQU (0xFF <<  8) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 9
AT91C_PWMC_FPE10          EQU (0xFF << 16) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 10
AT91C_PWMC_FPE11          EQU (0xFF << 24) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 11
// - -------- PWMC_FPER4 : (PWMC Offset: 0x78) PWM Fault Protection Enable Register 4 -------- 
AT91C_PWMC_FPE12          EQU (0xFF <<  0) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 12
AT91C_PWMC_FPE13          EQU (0xFF <<  8) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 13
AT91C_PWMC_FPE14          EQU (0xFF << 16) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 14
AT91C_PWMC_FPE15          EQU (0xFF << 24) ;- (PWMC) Fault Protection Enable with Fault Input y for PWM channel 15
// - -------- PWMC_EL0MR : (PWMC Offset: 0x7c) PWM Event Line 0 Mode Register -------- 
AT91C_PWMC_L0CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L0CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L0CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L0CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L0CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L0CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L0CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L0CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL1MR : (PWMC Offset: 0x80) PWM Event Line 1 Mode Register -------- 
AT91C_PWMC_L1CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L1CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L1CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L1CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L1CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L1CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L1CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L1CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL2MR : (PWMC Offset: 0x84) PWM Event line 2 Mode Register -------- 
AT91C_PWMC_L2CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L2CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L2CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L2CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L2CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L2CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L2CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L2CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL3MR : (PWMC Offset: 0x88) PWM Event line 3 Mode Register -------- 
AT91C_PWMC_L3CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L3CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L3CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L3CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L3CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L3CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L3CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L3CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL4MR : (PWMC Offset: 0x8c) PWM Event line 4 Mode Register -------- 
AT91C_PWMC_L4CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L4CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L4CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L4CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L4CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L4CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L4CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L4CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL5MR : (PWMC Offset: 0x90) PWM Event line 5 Mode Register -------- 
AT91C_PWMC_L5CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L5CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L5CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L5CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L5CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L5CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L5CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L5CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL6MR : (PWMC Offset: 0x94) PWM Event line 6 Mode Register -------- 
AT91C_PWMC_L6CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L6CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L6CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L6CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L6CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L6CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L6CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L6CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_EL7MR : (PWMC Offset: 0x98) PWM Event line 7 Mode Register -------- 
AT91C_PWMC_L7CSEL0        EQU (0x1 <<  0) ;- (PWMC) Comparison 0 Selection
AT91C_PWMC_L7CSEL1        EQU (0x1 <<  1) ;- (PWMC) Comparison 1 Selection
AT91C_PWMC_L7CSEL2        EQU (0x1 <<  2) ;- (PWMC) Comparison 2 Selection
AT91C_PWMC_L7CSEL3        EQU (0x1 <<  3) ;- (PWMC) Comparison 3 Selection
AT91C_PWMC_L7CSEL4        EQU (0x1 <<  4) ;- (PWMC) Comparison 4 Selection
AT91C_PWMC_L7CSEL5        EQU (0x1 <<  5) ;- (PWMC) Comparison 5 Selection
AT91C_PWMC_L7CSEL6        EQU (0x1 <<  6) ;- (PWMC) Comparison 6 Selection
AT91C_PWMC_L7CSEL7        EQU (0x1 <<  7) ;- (PWMC) Comparison 7 Selection
// - -------- PWMC_WPCR : (PWMC Offset: 0xe4) PWM Write Protection Control Register -------- 
AT91C_PWMC_WPCMD          EQU (0x3 <<  0) ;- (PWMC) Write Protection Command
AT91C_PWMC_WPRG0          EQU (0x1 <<  2) ;- (PWMC) Write Protect Register Group 0
AT91C_PWMC_WPRG1          EQU (0x1 <<  3) ;- (PWMC) Write Protect Register Group 1
AT91C_PWMC_WPRG2          EQU (0x1 <<  4) ;- (PWMC) Write Protect Register Group 2
AT91C_PWMC_WPRG3          EQU (0x1 <<  5) ;- (PWMC) Write Protect Register Group 3
AT91C_PWMC_WPRG4          EQU (0x1 <<  6) ;- (PWMC) Write Protect Register Group 4
AT91C_PWMC_WPRG5          EQU (0x1 <<  7) ;- (PWMC) Write Protect Register Group 5
AT91C_PWMC_WPKEY          EQU (0xFFFFFF <<  8) ;- (PWMC) Protection Password
// - -------- PWMC_WPVS : (PWMC Offset: 0xe8) Write Protection Status Register -------- 
AT91C_PWMC_WPSWS0         EQU (0x1 <<  0) ;- (PWMC) Write Protect SW Group 0 Status 
AT91C_PWMC_WPSWS1         EQU (0x1 <<  1) ;- (PWMC) Write Protect SW Group 1 Status 
AT91C_PWMC_WPSWS2         EQU (0x1 <<  2) ;- (PWMC) Write Protect SW Group 2 Status 
AT91C_PWMC_WPSWS3         EQU (0x1 <<  3) ;- (PWMC) Write Protect SW Group 3 Status 
AT91C_PWMC_WPSWS4         EQU (0x1 <<  4) ;- (PWMC) Write Protect SW Group 4 Status 
AT91C_PWMC_WPSWS5         EQU (0x1 <<  5) ;- (PWMC) Write Protect SW Group 5 Status 
AT91C_PWMC_WPVS           EQU (0x1 <<  7) ;- (PWMC) Write Protection Enable
AT91C_PWMC_WPHWS0         EQU (0x1 <<  8) ;- (PWMC) Write Protect HW Group 0 Status 
AT91C_PWMC_WPHWS1         EQU (0x1 <<  9) ;- (PWMC) Write Protect HW Group 1 Status 
AT91C_PWMC_WPHWS2         EQU (0x1 << 10) ;- (PWMC) Write Protect HW Group 2 Status 
AT91C_PWMC_WPHWS3         EQU (0x1 << 11) ;- (PWMC) Write Protect HW Group 3 Status 
AT91C_PWMC_WPHWS4         EQU (0x1 << 12) ;- (PWMC) Write Protect HW Group 4 Status 
AT91C_PWMC_WPHWS5         EQU (0x1 << 13) ;- (PWMC) Write Protect HW Group 5 Status 
AT91C_PWMC_WPVSRC         EQU (0xFFFF << 16) ;- (PWMC) Write Protection Violation Source
// - -------- PWMC_CMP0V : (PWMC Offset: 0x130) PWM Comparison Value 0 Register -------- 
AT91C_PWMC_CV             EQU (0xFFFFFF <<  0) ;- (PWMC) PWM Comparison Value 0.
AT91C_PWMC_CVM            EQU (0x1 << 24) ;- (PWMC) Comparison Value 0 Mode.
// - -------- PWMC_CMP0VUPD : (PWMC Offset: 0x134) PWM Comparison Value 0 Update Register -------- 
AT91C_PWMC_CVUPD          EQU (0xFFFFFF <<  0) ;- (PWMC) PWM Comparison Value Update.
AT91C_PWMC_CVMUPD         EQU (0x1 << 24) ;- (PWMC) Comparison Value Update Mode.
// - -------- PWMC_CMP0M : (PWMC Offset: 0x138) PWM Comparison 0 Mode Register -------- 
AT91C_PWMC_CEN            EQU (0x1 <<  0) ;- (PWMC) Comparison Enable.
AT91C_PWMC_CTR            EQU (0xF <<  4) ;- (PWMC) PWM Comparison Trigger.
AT91C_PWMC_CPR            EQU (0xF <<  8) ;- (PWMC) PWM Comparison Period.
AT91C_PWMC_CPRCNT         EQU (0xF << 12) ;- (PWMC) PWM Comparison Period Counter.
AT91C_PWMC_CUPR           EQU (0xF << 16) ;- (PWMC) PWM Comparison Update Period.
AT91C_PWMC_CUPRCNT        EQU (0xF << 20) ;- (PWMC) PWM Comparison Update Period Counter.
// - -------- PWMC_CMP0MUPD : (PWMC Offset: 0x13c) PWM Comparison 0 Mode Update Register -------- 
AT91C_PWMC_CENUPD         EQU (0x1 <<  0) ;- (PWMC) Comparison Enable Update.
AT91C_PWMC_CTRUPD         EQU (0xF <<  4) ;- (PWMC) PWM Comparison Trigger Update.
AT91C_PWMC_CPRUPD         EQU (0xF <<  8) ;- (PWMC) PWM Comparison Period Update.
AT91C_PWMC_CUPRUPD        EQU (0xF << 16) ;- (PWMC) PWM Comparison Update Period Update.
// - -------- PWMC_CMP1V : (PWMC Offset: 0x140) PWM Comparison Value 1 Register -------- 
// - -------- PWMC_CMP1VUPD : (PWMC Offset: 0x144) PWM Comparison Value 1 Update Register -------- 
// - -------- PWMC_CMP1M : (PWMC Offset: 0x148) PWM Comparison 1 Mode Register -------- 
// - -------- PWMC_CMP1MUPD : (PWMC Offset: 0x14c) PWM Comparison 1 Mode Update Register -------- 
// - -------- PWMC_CMP2V : (PWMC Offset: 0x150) PWM Comparison Value 2 Register -------- 
// - -------- PWMC_CMP2VUPD : (PWMC Offset: 0x154) PWM Comparison Value 2 Update Register -------- 
// - -------- PWMC_CMP2M : (PWMC Offset: 0x158) PWM Comparison 2 Mode Register -------- 
