una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
AT91C_HDMA_STAL2_1        EQU (0x1 << 26) ;- (HDMA) Channel 2 stalled.
AT91C_HDMA_STAL3          EQU (0x1 << 27) ;- (HDMA) When set, channel 3 is stalled.
AT91C_HDMA_STAL3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_STAL3_1        EQU (0x1 << 27) ;- (HDMA) Channel 3 stalled.
AT91C_HDMA_STAL4          EQU (0x1 << 28) ;- (HDMA) When set, channel 4 is stalled.
AT91C_HDMA_STAL4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_STAL4_1        EQU (0x1 << 28) ;- (HDMA) Channel 4 stalled.
AT91C_HDMA_STAL5          EQU (0x1 << 29) ;- (HDMA) When set, channel 5 is stalled.
AT91C_HDMA_STAL5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_STAL5_1        EQU (0x1 << 29) ;- (HDMA) Channel 5 stalled.
AT91C_HDMA_STAL6          EQU (0x1 << 30) ;- (HDMA) When set, channel 6 is stalled.
AT91C_HDMA_STAL6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_STAL6_1        EQU (0x1 << 30) ;- (HDMA) Channel 6 stalled.
AT91C_HDMA_STAL7          EQU (0x1 << 31) ;- (HDMA) When set, channel 7 is stalled.
AT91C_HDMA_STAL7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_STAL7_1        EQU (0x1 << 31) ;- (HDMA) Channel 7 stalled.
// - -------- HDMA_VER : (HDMA Offset: 0x1fc)  -------- 

// - *****************************************************************************
// -               REGISTER ADDRESS DEFINITION FOR AT91SAM3U1
// - *****************************************************************************
// - ========== Register definition for SYS peripheral ========== 
AT91C_SYS_GPBR            EQU (0x400E1290) ;- (SYS) General Purpose Register
// - ========== Register definition for HSMC4_CS0 peripheral ========== 
AT91C_CS0_MODE            EQU (0x400E0080) ;- (HSMC4_CS0) Mode Register
AT91C_CS0_PULSE           EQU (0x400E0074) ;- (HSMC4_CS0) Pulse Register
AT91C_CS0_CYCLE           EQU (0x400E0078) ;- (HSMC4_CS0) Cycle Register
AT91C_CS0_TIMINGS         EQU (0x400E007C) ;- (HSMC4_CS0) Timmings Register
AT91C_CS0_SETUP           EQU (0x400E0070) ;- (HSMC4_CS0) Setup Register
// - ========== Register definition for HSMC4_CS1 peripheral ========== 
AT91C_CS1_CYCLE           EQU (0x400E008C) ;- (HSMC4_CS1) Cycle Register
AT91C_CS1_PULSE           EQU (0x400E0088) ;- (HSMC4_CS1) Pulse Register
AT91C_CS1_MODE            EQU (0x400E0094) ;- (HSMC4_CS1) Mode Register
AT91C_CS1_SETUP           EQU (0x400E0084) ;- (HSMC4_CS1) Setup Register
AT91C_CS1_TIMINGS         EQU (0x400E0090) ;- (HSMC4_CS1) Timmings Register
// - ========== Register definition for HSMC4_CS2 peripheral ========== 
AT91C_CS2_PULSE           EQU (0x400E009C) ;- (HSMC4_CS2) Pulse Register
AT91C_CS2_TIMINGS         EQU (0x400E00A4) ;- (HSMC4_CS2) Timmings Register
AT91C_CS2_CYCLE           EQU (0x400E00A0) ;- (HSMC4_CS2) Cycle Register
AT91C_CS2_MODE            EQU (0x400E00A8) ;- (HSMC4_CS2) Mode Register
AT91C_CS2_SETUP           EQU (0x400E0098) ;- (HSMC4_CS2) Setup Register
// - ========== Register definition for HSMC4_CS3 peripheral ========== 
AT91C_CS3_MODE            EQU (0x400E00BC) ;- (HSMC4_CS3) Mode Register
AT91C_CS3_TIMINGS         EQU (0x400E00B8) ;- (HSMC4_CS3) Timmings Register
AT91C_CS3_SETUP           EQU (0x400E00AC) ;- (HSMC4_CS3) Setup Register
AT91C_CS3_CYCLE           EQU (0x400E00B4) ;- (HSMC4_CS3) Cycle Register
AT91C_CS3_PULSE           EQU (0x400E00B0) ;- (HSMC4_CS3) Pulse Register
// - ========== Register definition for HSMC4_NFC peripheral ========== 
AT91C_NFC_MODE            EQU (0x400E010C) ;- (HSMC4_NFC) Mode Register
AT91C_NFC_CYCLE           EQU (0x400E0104) ;- (HSMC4_NFC) Cycle Register
AT91C_NFC_PULSE           EQU (0x400E0100) ;- (HSMC4_NFC) Pulse Register
AT91C_NFC_SETUP           EQU (0x400E00FC) ;- (HSMC4_NFC) Setup Register
AT91C_NFC_TIMINGS         EQU (0x400E0108) ;- (HSMC4_NFC) Timmings Register
// - ========== Register definition for HSMC4 peripheral ========== 
AT91C_HSMC4_IPNAME1       EQU (0x400E01F0) ;- (HSMC4) Write Protection Status Register
AT91C_HSMC4_ECCPR6        EQU (0x400E0048) ;- (HSMC4) ECC Parity register 6
AT91C_HSMC4_ADDRSIZE      EQU (0x400E01EC) ;- (HSMC4) Write Protection Status Register
AT91C_HSMC4_ECCPR11       EQU (0x400E005C) ;- (HSMC4) ECC Parity register 11
AT91C_HSMC4_SR            EQU (0x400E0008) ;- (HSMC4) Status Register
AT91C_HSMC4_IMR           EQU (0x400E0014) ;- (HSMC4) Interrupt Mask Register
AT91C_HSMC4_WPSR          EQU (0x400E01E8) ;- (HSMC4) Write Protection Status Register
AT91C_HSMC4_BANK          EQU (0x400E001C) ;- (HSMC4) Bank Register
AT91C_HSMC4_ECCPR8        EQU (0x400E0050) ;- (HSMC4) ECC Parity register 8
AT91C_HSMC4_WPCR          EQU (0x400E01E4) ;- (HSMC4) Write Protection Control register
AT91C_HSMC4_ECCPR2        EQU (0x400E0038) ;- (HSMC4) ECC Parity register 2
AT91C_HSMC4_ECCPR1        EQU (0x400E0030) ;- (HSMC4) ECC Parity register 1
AT91C_HSMC4_ECCSR2        EQU (0x400E0034) ;- (HSMC4) ECC Status register 2
AT91C_HSMC4_OCMS          EQU (0x400E0110) ;- (HSMC4) OCMS MODE register
AT91C_HSMC4_ECCPR9        EQU (0x400E0054) ;- (HSMC4) ECC Parity register 9
AT91C_HSMC4_DUMMY         EQU (0x400E0200) ;- (HSMC4) This rtegister was created only ti have AHB constants
AT91C_HSMC4_ECCPR5        EQU (0x400E0044) ;- (HSMC4) ECC Parity register 5
AT91C_HSMC4_ECCCR         EQU (0x400E0020) ;- (HSMC4) ECC reset register
AT91C_HSMC4_KEY2          EQU (0x400E0118) ;- (HSMC4) KEY2 Register
AT91C_HSMC4_IER           EQU (0x400E000C) ;- (HSMC4) Interrupt Enable Register
AT91C_HSMC4_ECCSR1        EQU (0x400E0028) ;- (HSMC4) ECC Status register 1
AT91C_HSMC4_IDR           EQU (0x400E0010) ;- (HSMC4) Interrupt Disable Register
AT91C_HSMC4_ECCPR0        EQU (0x400E002C) ;- (HSMC4) ECC Parity register 0
AT91C_HSMC4_FEATURES      EQU (0x400E01F8) ;- (HSMC4) Write Protection Status Register
AT91C_HSMC4_ECCPR7        EQU (0x400E004C) ;- (HSMC4) ECC Parity register 7
AT91C_HSMC4_ECCPR12       EQU (0x400E0060) ;- (HSMC4) ECC Parity register 12
AT91C_HSMC4_ECCPR10       EQU (0x400E0058) ;- (HSMC4) ECC Parity register 10
AT91C_HSMC4_KEY1          EQU (0x400E0114) ;- (HSMC4) KEY1 Register
AT91C_HSMC4_VER           EQU (0x400E01FC) ;- (HSMC4) HSMC4 Version Register
AT91C_HSMC4_Eccpr15       EQU (0x400E006C) ;- (HSMC4) ECC Parity register 15
AT91C_HSMC4_ECCPR4        EQU (0x400E0040) ;- (HSMC4) ECC Parity register 4
AT91C_HSMC4_IPNAME2       EQU (0x400E01F4) ;- (HSMC4) Write Protection Status Register
AT91C_HSMC4_ECCCMD        EQU (0x400E0024) ;- (HSMC4) ECC Page size register
AT91C_HSMC4_ADDR          EQU (0x400E0018) ;- (HSMC4) Address Cycle Zero Register
AT91C_HSMC4_ECCPR3        EQU (0x400E003C) ;- (HSMC4) ECC Parity register 3
AT91C_HSMC4_CFG           EQU (0x400E0000) ;- (HSMC4) Configuration Register
AT91C_HSMC4_CTRL          EQU (0x400E0004) ;- (HSMC4) Control Register
AT91C_HSMC4_ECCPR13       EQU (0x400E0064) ;- (HSMC4) ECC Parity register 13
AT91C_HSMC4_ECCPR14       EQU (0x400E0068) ;- (HSMC4) ECC Parity register 14
// - ========== Register definition for MATRIX peripheral ========== 
AT91C_MATRIX_SFR2         EQU (0x400E0318) ;- (MATRIX)  Special Function Register 2
AT91C_MATRIX_SFR3         EQU (0x400E031C) ;- (MATRIX)  Special Function Register 3
AT91C_MATRIX_SCFG8        EQU (0x400E0260) ;- (MATRIX)  Slave Configuration Register 8
AT91C_MATRIX_MCFG2        EQU (0x400E0208) ;- (MATRIX)  Master Configuration Register 2
AT91C_MATRIX_MCFG7        EQU (0x400E021C) ;- (MATRIX)  Master Configuration Register 7
AT91C_MATRIX_SCFG3        EQU (0x400E024C) ;- (MATRIX)  Slave Configuration Register 3
AT91C_MATRIX_SCFG0        EQU (0x400E0240) ;- (MATRIX)  Slave Configuration Register 0
AT91C_MATRIX_SFR12        EQU (0x400E0340) ;- (MATRIX)  Special Function Register 12
AT91C_MATRIX_SCFG1        EQU (0x400E0244) ;- (MATRIX)  Slave Configuration Register 1
AT91C_MATRIX_SFR8         EQU (0x400E0330) ;- (MATRIX)  Special Function Register 8
AT91C_MATRIX_VER          EQU (0x400E03FC) ;- (MATRIX) HMATRIX2 VERSION REGISTER 
AT91C_MATRIX_SFR13        EQU (0x400E0344) ;- (MATRIX)  Special Function Register 13
AT91C_MATRIX_SFR5         EQU (0x400E0324) ;- (MATRIX)  Special Function Register 5
AT91C_MATRIX_MCFG0        EQU (0x400E0200) ;- (MATRIX)  Master Configuration Register 0 : ARM I and D
AT91C_MATRIX_SCFG6        EQU (0x400E0258) ;- (MATRIX)  Slave Configuration Register 6
AT91C_MATRIX_SFR14        EQU (0x400E0348) ;- (MATRIX)  Special Function Register 14
AT91C_MATRIX_SFR1         EQU (0x400E0314) ;- (MATRIX)  Special Function Register 1
AT91C_MATRIX_SFR15        EQU (0x400E034C) ;- (MATRIX)  Special Function Register 15
AT91C_MATRIX_SFR6         EQU (0x400E0328) ;- (MATRIX)  Special Function Register 6
AT91C_MATRIX_SFR11        EQU (0x400E033C) ;- (MATRIX)  Special Function Register 11
AT91C_MATRIX_IPNAME2      EQU (0x400E03F4) ;- (MATRIX) HMATRIX2 IPNAME2 REGISTER 
AT91C_MATRIX_ADDRSIZE     EQU (0x400E03EC) ;- (MATRIX) HMATRIX2 ADDRSIZE REGISTER 
AT91C_MATRIX_MCFG5        EQU (0x400E0214) ;- (MATRIX)  Master Configuration Register 5
AT91C_MATRIX_SFR9         EQU (0x400E0334) ;- (MATRIX)  Special Function Register 9
AT91C_MATRIX_MCFG3        EQU (0x400E020C) ;- (MATRIX)  Master Configuration Register 3
AT91C_MATRIX_SCFG4        EQU (0x400E0250) ;- (MATRIX)  Slave Configuration Register 4
AT91C_MATRIX_MCFG1        EQU (0x400E0204) ;- (MATRIX)  Master Configuration Register 1 : ARM S
AT91C_MATRIX_SCFG7        EQU (0x400E025C) ;- (MATRIX)  Slave Configuration Register 5
AT91C_MATRIX_SFR10        EQU (0x400E0338) ;- (MATRIX)  Special Function Register 10
AT91C_MATRIX_SCFG2        EQU (0x400E0248) ;- (MATRIX)  Slave Configuration Register 2
AT91C_MATRIX_SFR7         EQU (0x400E032C) ;- (MATRIX)  Special Function Register 7
AT91C_MATRIX_IPNAME1      EQU (0x400E03F0) ;- (MATRIX) HMATRIX2 IPNAME1 REGISTER 
AT91C_MATRIX_MCFG4        EQU (0x400E0210) ;- (MATRIX)  Master Configuration Register 4
AT91C_MATRIX_SFR0         EQU (0x400E0310) ;- (MATRIX)  Special Function Register 0
AT91C_MATRIX_FEATURES     EQU (0x400E03F8) ;- (MATRIX) HMATRIX2 FEATURES REGISTER 
AT91C_MATRIX_SCFG5        EQU (0x400E0254) ;- (MATRIX)  Slave Configuration Register 5
AT91C_MATRIX_MCFG6        EQU (0x400E0218) ;- (MATRIX)  Master Configuration Register 6
AT91C_MATRIX_SCFG9        EQU (0x400E0264) ;- (MATRIX)  Slave Configuration Register 9
AT91C_MATRIX_SFR4         EQU (0x400E0320) ;- (MATRIX)  Special Function Register 4
// - ========== Register definition for NVIC peripheral ========== 
AT91C_NVIC_MMAR           EQU (0xE000ED34) ;- (NVIC) Mem Manage Address Register
AT91C_NVIC_STIR           EQU (0xE000EF00) ;- (NVIC) Software Trigger Interrupt Register
AT91C_NVIC_MMFR2          EQU (0xE000ED58) ;- (NVIC) Memory Model Feature register2
AT91C_NVIC_CPUID          EQU (0xE000ED00) ;- (NVIC) CPUID Base Register
AT91C_NVIC_DFSR           EQU (0xE000ED30) ;- (NVIC) Debug Fault Status Register
AT91C_NVIC_HAND4PR        EQU (0xE000ED18) ;- (NVIC) System Handlers 4-7 Priority Register
AT91C_NVIC_HFSR           EQU (0xE000ED2C) ;- (NVIC) Hard Fault Status Register
AT91C_NVIC_PID6           EQU (0xE000EFD8) ;- (NVIC) Peripheral identification register
AT91C_NVIC_PFR0           EQU (0xE000ED40) ;- (NVIC) Processor Feature register0
AT91C_NVIC_VTOFFR         EQU (0xE000ED08) ;- (NVIC) Vector Table Offset Register
AT91C_NVIC_ISPR           EQU (0xE000E200) ;- (NVIC) Set Pending Register
AT91C_NVIC_PID0           EQU (0xE000EFE0) ;- (NVIC) Peripheral identification register b7:0
AT91C_NVIC_PID7           EQU (0xE000EFDC) ;- (NVIC) Peripheral identification register
AT91C_NVIC_STICKRVR       EQU (0xE000E014) ;- (NVIC) SysTick Reload Value Register
AT91C_NVIC_PID2           EQU (0xE000EFE8) ;- (NVIC) Peripheral identification register b23:16
AT91C_NVIC_ISAR0          EQU (0xE000ED60) ;- (NVIC) ISA Feature register0
AT91C_NVIC_SCR            EQU (0xE000ED10) ;- (NVIC) System Control Register
AT91C_NVIC_PID4           EQU (0xE000EFD0) ;- (NVIC) Peripheral identification register
AT91C_NVIC_ISAR2          EQU (0xE000ED68) ;- (NVIC) ISA Feature register2
AT91C_NVIC_ISER           EQU (0xE000E100) ;- (NVIC) Set Enable Register
AT91C_NVIC_IPR            EQU (0xE000E400) ;- (NVIC) Interrupt Mask Register
AT91C_NVIC_AIRCR          EQU (0xE000ED0C) ;- (NVIC) Application Interrupt/Reset Control Reg
AT91C_NVIC_CID2           EQU (0xE000EFF8) ;- (NVIC) Component identification register b23:16
AT91C_NVIC_ICPR           EQU (0xE000E280) ;- (NVIC) Clear Pending Register
AT91C_NVIC_CID3           EQU (0xE000EFFC) ;- (NVIC) Component identification register b31:24
AT91C_NVIC_CFSR           EQU (0xE000ED28) ;- (NVIC) Configurable Fault Status Register
AT91C_NVIC_AFR0           EQU (0xE000ED4C) ;- (NVIC) Auxiliary Feature register0
AT91C_NVIC_ICSR           EQU (0xE000ED04) ;- (NVIC) Interrupt Control State Register
AT91C_NVIC_CCR            EQU (0xE000ED14) ;- (NVIC) Configuration Control Register
AT91C_NVIC_CID0           EQU (0xE000EFF0) ;- (NVIC) Component identification register b7:0
AT91C_NVIC_ISAR1          EQU (0xE000ED64) ;- (NVIC) ISA Feature register1
AT91C_NVIC_STICKCVR       EQU (0xE000E018) ;- (NVIC) SysTick Current Value Register
AT91C_NVIC_STICKCSR       EQU (0xE000E010) ;- (NVIC) SysTick Control and Status Register
AT91C_NVIC_CID1           EQU (0xE000EFF4) ;- (NVIC) Component identification register b15:8
AT91C_NVIC_DFR0           EQU (0xE000ED48) ;- (NVIC) Debug Feature register0
AT91C_NVIC_MMFR3          EQU (0xE000ED5C) ;- (NVIC) Memory Model Feature register3
AT91C_NVIC_MMFR0          EQU (0xE000ED50) ;- (NVIC) Memory Model Feature register0
AT91C_NVIC_STICKCALVR     EQU (0xE000E01C) ;- (NVIC) SysTick Calibration Value Register
AT91C_NVIC_PID1           EQU (0xE000EFE4) ;- (NVIC) Peripheral identification register b15:8
AT91C_NVIC_HAND12PR       EQU (0xE000ED20) ;- (NVIC) System Handlers 12-15 Priority Register
AT91C_NVIC_MMFR1          EQU (0xE000ED54) ;- (NVIC) Memory Model Feature register1
AT91C_NVIC_AFSR           EQU (0xE000ED3C) ;- (NVIC) Auxiliary Fault Status Register
AT91C_NVIC_HANDCSR        EQU (0xE000ED24) ;- (NVIC) System Handler Control and State Register
AT91C_NVIC_ISAR4          EQU (0xE000ED70) ;- (NVIC) ISA Feature register4
AT91C_NVIC_ABR            EQU (0xE000E300) ;- (NVIC) Active Bit Register
AT91C_NVIC_PFR1           EQU (0xE000ED44) ;- (NVIC) Processor Feature register1
AT91C_NVIC_PID5           EQU (0xE000EFD4) ;- (NVIC) Peripheral identification register
AT91C_NVIC_ICTR           EQU (0xE000E004) ;- (NVIC) Interrupt Control Type Register
AT91C_NVIC_ICER           EQU (0xE000E180) ;- (NVIC) Clear enable Register
AT91C_NVIC_PID3           EQU (0xE000EFEC) ;- (NVIC) Peripheral identification register b31:24
AT91C_NVIC_ISAR3          EQU (0xE000ED6C) ;- (NVIC) ISA Feature register3
AT91C_NVIC_HAND8PR        EQU (0xE000ED1C) ;- (NVIC) System Handlers 8-11 Priority Register
AT91C_NVIC_BFAR           EQU (0xE000ED38) ;- (NVIC) Bus Fault Address Register
// - ========== Register definition for MPU peripheral ========== 
AT91C_MPU_REG_BASE_ADDR3  EQU (0xE000EDB4) ;- (MPU) MPU Region Base Address Register alias 3
AT91C_MPU_REG_NB          EQU (0xE000ED98) ;- (MPU) MPU Region Number Register
AT91C_MPU_ATTR_SIZE1      EQU (0xE000EDA8) ;- (MPU) MPU  Attribute and Size Register alias 1
AT91C_MPU_REG_BASE_ADDR1  EQU (0xE000EDA4) ;- (MPU) MPU Region Base Address Register alias 1
AT91C_MPU_ATTR_SIZE3      EQU (0xE000EDB8) ;- (MPU) MPU  Attribute and Size Register alias 3
AT91C_MPU_CTRL            EQU (0xE000ED94) ;- (MPU) MPU Control Register
AT91C_MPU_ATTR_SIZE2      EQU (0xE000EDB0) ;- (MPU) MPU  Attribute and Size Register alias 2
AT91C_MPU_REG_BASE_ADDR   EQU (0xE000ED9C) ;- (MPU) MPU Region Base Address Register
AT91C_MPU_REG_BASE_ADDR2  EQU (0xE000EDAC) ;- (MPU) MPU Region Base Address Register alias 2
AT91C_MPU_ATTR_SIZE       EQU (0xE000EDA0) ;- (MPU) MPU  Attribute and Size Register
AT91C_MPU_TYPE            EQU (0xE000ED90) ;- (MPU) MPU Type Register
// - ========== Register definition for CM3 peripheral ========== 
AT91C_CM3_SHCSR           EQU (0xE000ED24) ;- (CM3) System Handler Control and State Register
AT91C_CM3_CCR             EQU (0xE000ED14) ;- (CM3) Configuration Control Register
AT91C_CM3_ICSR            EQU (0xE000ED04) ;- (CM3) Interrupt Control State Register
AT91C_CM3_CPUID           EQU (0xE000ED00) ;- (CM3) CPU ID Base Register
AT91C_CM3_SCR             EQU (0xE000ED10) ;- (CM3) System Controller Register
AT91C_CM3_AIRCR           EQU (0xE000ED0C) ;- (CM3) Application Interrupt and Reset Control Register
AT91C_CM3_SHPR            EQU (0xE000ED18) ;- (CM3) System Handler Priority Register
AT91C_CM3_VTOR            EQU (0xE000ED08) ;- (CM3) Vector Table Offset Register
// - ========== Register definition for PDC_DBGU peripheral ========== 
AT91C_DBGU_TPR            EQU (0x400E0708) ;- (PDC_DBGU) Transmit Pointer Register
AT91C_DBGU_PTCR           EQU (0x400E0720) ;- (PDC_DBGU) PDC Transfer Control Register
AT91C_DBGU_TNCR           EQU (0x400E071C) ;- (PDC_DBGU) Transmit Next Counter Register
AT91C_DBGU_PTSR           EQU (0x400E0724) ;- (PDC_DBGU) PDC Transfer Status Register
AT91C_DBGU_RNCR           EQU (0x400E0714) ;- (PDC_DBGU) Receive Next Counter Register
AT91C_DBGU_RPR            EQU (0x400E0700) ;- (PDC_DBGU) Receive Pointer Register
AT91C_DBGU_TCR            EQU (0x400E070C) ;- (PDC_DBGU) Transmit Counter Register
AT91C_DBGU_RNPR           EQU (0x400E0710) ;- (PDC_DBGU) Receive Next Pointer Register
AT91C_DBGU_TNPR           EQU (0x400E0718) ;- (PDC_DBGU) Transmit Next Pointer Register
AT91C_DBGU_RCR            EQU (0x400E0704) ;- (PDC_DBGU) Receive Counter Register
// - ========== Register definition for DBGU peripheral ========== 
AT91C_DBGU_CR             EQU (0x400E0600) ;- (DBGU) Control Register
AT91C_DBGU_IDR            EQU (0x400E060C) ;- (DBGU) Interrupt Disable Register
AT91C_DBGU_CIDR           EQU (0x400E0740) ;- (DBGU) Chip ID Register
AT91C_DBGU_IPNAME2        EQU (0x400E06F4) ;- (DBGU) DBGU IPNAME2 REGISTER 
AT91C_DBGU_FEATURES       EQU (0x400E06F8) ;- (DBGU) DBGU FEATURES REGISTER 
AT91C_DBGU_FNTR           EQU (0x400E0648) ;- (DBGU) Force NTRST Register
AT91C_DBGU_RHR            EQU (0x400E0618) ;- (DBGU) Receiver Holding Register
AT91C_DBGU_THR            EQU (0x400E061C) ;- (DBGU) Transmitter Holding Register
AT91C_DBGU_ADDRSIZE       EQU (0x400E06EC) ;- (DBGU) DBGU ADDRSIZE REGISTER 
AT91C_DBGU_MR             EQU (0x400E0604) ;- (DBGU) Mode Register
AT91C_DBGU_IER            EQU (0x400E0608) ;- (DBGU) Interrupt Enable Register
AT91C_DBGU_BRGR           EQU (0x400E0620) ;- (DBGU) Baud Rate Generator Register
AT91C_DBGU_CSR            EQU (0x400E0614) ;- (DBGU) Channel Status Register
AT91C_DBGU_VER            EQU (0x400E06FC) ;- (DBGU) DBGU VERSION REGISTER 
AT91C_DBGU_IMR            EQU (0x400E0610) ;- (DBGU) Interrupt Mask Register
AT91C_DBGU_IPNAME1        EQU (0x400E06F0) ;- (DBGU) DBGU IPNAME1 REGISTER 
AT91C_DBGU_EXID           EQU (0x400E0744) ;- (DBGU) Chip ID Extension Register
// - ========== Register definition for PIOA peripheral ========== 
AT91C_PIOA_PDR            EQU (0x400E0C04) ;- (PIOA) PIO Disable Register
AT91C_PIOA_FRLHSR         EQU (0x400E0CD8) ;- (PIOA) Fall/Rise - Low/High Status Register
AT91C_PIOA_KIMR           EQU (0x400E0D38) ;- (PIOA) Keypad Controller Interrupt Mask Register
AT91C_PIOA_LSR            EQU (0x400E0CC4) ;- (PIOA) Level Select Register
AT91C_PIOA_IFSR           EQU (0x400E0C28) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_KKRR           EQU (0x400E0D44) ;- (PIOA) Keypad Controller Key Release Register
AT91C_PIOA_ODR            EQU (0x400E0C14) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_SCIFSR         EQU (0x400E0C80) ;- (PIOA) System Clock Glitch Input Filter Select Register
AT91C_PIOA_PER            EQU (0x400E0C00) ;- (PIOA) PIO Enable Register
AT91C_PIOA_VER            EQU (0x400E0CFC) ;- (PIOA) PIO VERSION REGISTER 
AT91C_PIOA_OWSR           EQU (0x400E0CA8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_KSR            EQU (0x400E0D3C) ;- (PIOA) Keypad Controller Status Register
AT91C_PIOA_IMR            EQU (0x400E0C48) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_OWDR           EQU (0x400E0CA4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_MDSR           EQU (0x400E0C58) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_IFDR           EQU (0x400E0C24) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_AIMDR          EQU (0x400E0CB4) ;- (PIOA) Additional Interrupt Modes Disables Register
AT91C_PIOA_CODR           EQU (0x400E0C34) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_SCDR           EQU (0x400E0C8C) ;- (PIOA) Slow Clock Divider Debouncing Register
AT91C_PIOA_KIER           EQU (0x400E0D30) ;- (PIOA) Keypad Controller Interrupt Enable Register
AT91C_PIOA_REHLSR         EQU (0x400E0CD4) ;- (PIOA) Rising Edge/ High Level Select Register
AT91C_PIOA_ISR            EQU (0x400E0C4C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_ESR            EQU (0x400E0CC0) ;- (PIOA) Edge Select Register
AT91C_PIOA_PPUDR          EQU (0x400E0C60) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_MDDR           EQU (0x400E0C54) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_PSR            EQU (0x400E0C08) ;- (PIOA) PIO Status Register
AT91C_PIOA_PDSR           EQU (0x400E0C3C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_IFDGSR         EQU (0x400E0C88) ;- (PIOA) Glitch or Debouncing Input Filter Clock Selection Status Register
AT91C_PIOA_FELLSR         EQU (0x400E0CD0) ;- (PIOA) Falling Edge/Low Level Select Register
AT91C_PIOA_PPUSR          EQU (0x400E0C68) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_OER            EQU (0x400E0C10) ;- (PIOA) Output Enable Register
AT91C_PIOA_OSR            EQU (0x400E0C18) ;- (PIOA) Output Status Register
AT91C_PIOA_KKPR           EQU (0x400E0D40) ;- (PIOA) Keypad Controller Key Press Register
AT91C_PIOA_AIMMR          EQU (0x400E0CB8) ;- (PIOA) Additional Interrupt Modes Mask Register
AT91C_PIOA_KRCR           EQU (0x400E0D24) ;- (PIOA) Keypad Controller Row Column Register
AT91C_PIOA_IER            EQU (0x400E0C40) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_KER            EQU (0x400E0D20) ;- (PIOA) Keypad Controller Enable Register
AT91C_PIOA_PPUER          EQU (0x400E0C64) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_KIDR           EQU (0x400E0D34) ;- (PIOA) Keypad Controller Interrupt Disable Register
AT91C_PIOA_ABSR           EQU (0x400E0C70) ;- (PIOA) Peripheral AB Select Register
AT91C_PIOA_LOCKSR         EQU (0x400E0CE0) ;- (PIOA) Lock Status Register
AT91C_PIOA_DIFSR          EQU (0x400E0C84) ;- (PIOA) Debouncing Input Filter Select Register
AT91C_PIOA_MDER           EQU (0x400E0C50) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_AIMER          EQU (0x400E0CB0) ;- (PIOA) Additional Interrupt Modes Enable Register
AT91C_PIOA_ELSR           EQU (0x400E0CC8) ;- (PIOA) Edge/Level Status Register
AT91C_PIOA_IFER           EQU (0x400E0C20) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_KDR            EQU (0x400E0D28) ;- (PIOA) Keypad Controller Debouncing Register
AT91C_PIOA_IDR            EQU (0x400E0C44) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_OWER           EQU (0x400E0CA0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_ODSR           EQU (0x400E0C38) ;- (PIOA) Output Data Status Register
AT91C_PIOA_SODR           EQU (0x400E0C30) ;- (PIOA) Set Output Data Register
// - ========== Register definition for PIOB peripheral ========== 
AT91C_PIOB_KIDR           EQU (0x400E0F34) ;- (PIOB) Keypad Controller Interrupt Disable Register
AT91C_PIOB_OWSR           EQU (0x400E0EA8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_PSR            EQU (0x400E0E08) ;- (PIOB) PIO Status Register
AT91C_PIOB_MDER           EQU (0x400E0E50) ;- (PIOB) Multi-driver Enable Register
