una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3u1.h
AT91C_PIOB_ODR            EQU (0x400E0E14) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_IDR            EQU (0x400E0E44) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_AIMER          EQU (0x400E0EB0) ;- (PIOB) Additional Interrupt Modes Enable Register
AT91C_PIOB_DIFSR          EQU (0x400E0E84) ;- (PIOB) Debouncing Input Filter Select Register
AT91C_PIOB_PDR            EQU (0x400E0E04) ;- (PIOB) PIO Disable Register
AT91C_PIOB_REHLSR         EQU (0x400E0ED4) ;- (PIOB) Rising Edge/ High Level Select Register
AT91C_PIOB_PDSR           EQU (0x400E0E3C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_PPUDR          EQU (0x400E0E60) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_LSR            EQU (0x400E0EC4) ;- (PIOB) Level Select Register
AT91C_PIOB_OWDR           EQU (0x400E0EA4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_FELLSR         EQU (0x400E0ED0) ;- (PIOB) Falling Edge/Low Level Select Register
AT91C_PIOB_IFER           EQU (0x400E0E20) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_ABSR           EQU (0x400E0E70) ;- (PIOB) Peripheral AB Select Register
AT91C_PIOB_KIMR           EQU (0x400E0F38) ;- (PIOB) Keypad Controller Interrupt Mask Register
AT91C_PIOB_KKPR           EQU (0x400E0F40) ;- (PIOB) Keypad Controller Key Press Register
AT91C_PIOB_FRLHSR         EQU (0x400E0ED8) ;- (PIOB) Fall/Rise - Low/High Status Register
AT91C_PIOB_AIMDR          EQU (0x400E0EB4) ;- (PIOB) Additional Interrupt Modes Disables Register
AT91C_PIOB_SCIFSR         EQU (0x400E0E80) ;- (PIOB) System Clock Glitch Input Filter Select Register
AT91C_PIOB_VER            EQU (0x400E0EFC) ;- (PIOB) PIO VERSION REGISTER 
AT91C_PIOB_PER            EQU (0x400E0E00) ;- (PIOB) PIO Enable Register
AT91C_PIOB_ELSR           EQU (0x400E0EC8) ;- (PIOB) Edge/Level Status Register
AT91C_PIOB_IMR            EQU (0x400E0E48) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_PPUSR          EQU (0x400E0E68) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_SCDR           EQU (0x400E0E8C) ;- (PIOB) Slow Clock Divider Debouncing Register
AT91C_PIOB_KSR            EQU (0x400E0F3C) ;- (PIOB) Keypad Controller Status Register
AT91C_PIOB_IFDGSR         EQU (0x400E0E88) ;- (PIOB) Glitch or Debouncing Input Filter Clock Selection Status Register
AT91C_PIOB_ESR            EQU (0x400E0EC0) ;- (PIOB) Edge Select Register
AT91C_PIOB_ODSR           EQU (0x400E0E38) ;- (PIOB) Output Data Status Register
AT91C_PIOB_IFDR           EQU (0x400E0E24) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_SODR           EQU (0x400E0E30) ;- (PIOB) Set Output Data Register
AT91C_PIOB_IER            EQU (0x400E0E40) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_MDSR           EQU (0x400E0E58) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_ISR            EQU (0x400E0E4C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_IFSR           EQU (0x400E0E28) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_KER            EQU (0x400E0F20) ;- (PIOB) Keypad Controller Enable Register
AT91C_PIOB_KKRR           EQU (0x400E0F44) ;- (PIOB) Keypad Controller Key Release Register
AT91C_PIOB_PPUER          EQU (0x400E0E64) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_LOCKSR         EQU (0x400E0EE0) ;- (PIOB) Lock Status Register
AT91C_PIOB_OWER           EQU (0x400E0EA0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_KIER           EQU (0x400E0F30) ;- (PIOB) Keypad Controller Interrupt Enable Register
AT91C_PIOB_MDDR           EQU (0x400E0E54) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_KRCR           EQU (0x400E0F24) ;- (PIOB) Keypad Controller Row Column Register
AT91C_PIOB_CODR           EQU (0x400E0E34) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_KDR            EQU (0x400E0F28) ;- (PIOB) Keypad Controller Debouncing Register
AT91C_PIOB_AIMMR          EQU (0x400E0EB8) ;- (PIOB) Additional Interrupt Modes Mask Register
AT91C_PIOB_OER            EQU (0x400E0E10) ;- (PIOB) Output Enable Register
AT91C_PIOB_OSR            EQU (0x400E0E18) ;- (PIOB) Output Status Register
// - ========== Register definition for PIOC peripheral ========== 
AT91C_PIOC_FELLSR         EQU (0x400E10D0) ;- (PIOC) Falling Edge/Low Level Select Register
AT91C_PIOC_FRLHSR         EQU (0x400E10D8) ;- (PIOC) Fall/Rise - Low/High Status Register
AT91C_PIOC_MDDR           EQU (0x400E1054) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_IFDGSR         EQU (0x400E1088) ;- (PIOC) Glitch or Debouncing Input Filter Clock Selection Status Register
AT91C_PIOC_ABSR           EQU (0x400E1070) ;- (PIOC) Peripheral AB Select Register
AT91C_PIOC_KIMR           EQU (0x400E1138) ;- (PIOC) Keypad Controller Interrupt Mask Register
AT91C_PIOC_KRCR           EQU (0x400E1124) ;- (PIOC) Keypad Controller Row Column Register
AT91C_PIOC_ODSR           EQU (0x400E1038) ;- (PIOC) Output Data Status Register
AT91C_PIOC_OSR            EQU (0x400E1018) ;- (PIOC) Output Status Register
AT91C_PIOC_IFER           EQU (0x400E1020) ;- (PIOC) Input Filter Enable Register
AT91C_PIOC_KKPR           EQU (0x400E1140) ;- (PIOC) Keypad Controller Key Press Register
AT91C_PIOC_MDSR           EQU (0x400E1058) ;- (PIOC) Multi-driver Status Register
AT91C_PIOC_IFDR           EQU (0x400E1024) ;- (PIOC) Input Filter Disable Register
AT91C_PIOC_MDER           EQU (0x400E1050) ;- (PIOC) Multi-driver Enable Register
AT91C_PIOC_SCDR           EQU (0x400E108C) ;- (PIOC) Slow Clock Divider Debouncing Register
AT91C_PIOC_SCIFSR         EQU (0x400E1080) ;- (PIOC) System Clock Glitch Input Filter Select Register
AT91C_PIOC_IER            EQU (0x400E1040) ;- (PIOC) Interrupt Enable Register
AT91C_PIOC_KDR            EQU (0x400E1128) ;- (PIOC) Keypad Controller Debouncing Register
AT91C_PIOC_OWDR           EQU (0x400E10A4) ;- (PIOC) Output Write Disable Register
AT91C_PIOC_IFSR           EQU (0x400E1028) ;- (PIOC) Input Filter Status Register
AT91C_PIOC_ISR            EQU (0x400E104C) ;- (PIOC) Interrupt Status Register
AT91C_PIOC_PPUDR          EQU (0x400E1060) ;- (PIOC) Pull-up Disable Register
AT91C_PIOC_PDSR           EQU (0x400E103C) ;- (PIOC) Pin Data Status Register
AT91C_PIOC_KKRR           EQU (0x400E1144) ;- (PIOC) Keypad Controller Key Release Register
AT91C_PIOC_AIMDR          EQU (0x400E10B4) ;- (PIOC) Additional Interrupt Modes Disables Register
AT91C_PIOC_LSR            EQU (0x400E10C4) ;- (PIOC) Level Select Register
AT91C_PIOC_PPUER          EQU (0x400E1064) ;- (PIOC) Pull-up Enable Register
AT91C_PIOC_AIMER          EQU (0x400E10B0) ;- (PIOC) Additional Interrupt Modes Enable Register
AT91C_PIOC_OER            EQU (0x400E1010) ;- (PIOC) Output Enable Register
AT91C_PIOC_CODR           EQU (0x400E1034) ;- (PIOC) Clear Output Data Register
AT91C_PIOC_AIMMR          EQU (0x400E10B8) ;- (PIOC) Additional Interrupt Modes Mask Register
AT91C_PIOC_OWER           EQU (0x400E10A0) ;- (PIOC) Output Write Enable Register
AT91C_PIOC_VER            EQU (0x400E10FC) ;- (PIOC) PIO VERSION REGISTER 
AT91C_PIOC_IMR            EQU (0x400E1048) ;- (PIOC) Interrupt Mask Register
AT91C_PIOC_PPUSR          EQU (0x400E1068) ;- (PIOC) Pull-up Status Register
AT91C_PIOC_IDR            EQU (0x400E1044) ;- (PIOC) Interrupt Disable Register
AT91C_PIOC_DIFSR          EQU (0x400E1084) ;- (PIOC) Debouncing Input Filter Select Register
AT91C_PIOC_KIDR           EQU (0x400E1134) ;- (PIOC) Keypad Controller Interrupt Disable Register
AT91C_PIOC_KSR            EQU (0x400E113C) ;- (PIOC) Keypad Controller Status Register
AT91C_PIOC_REHLSR         EQU (0x400E10D4) ;- (PIOC) Rising Edge/ High Level Select Register
AT91C_PIOC_ESR            EQU (0x400E10C0) ;- (PIOC) Edge Select Register
AT91C_PIOC_KIER           EQU (0x400E1130) ;- (PIOC) Keypad Controller Interrupt Enable Register
AT91C_PIOC_ELSR           EQU (0x400E10C8) ;- (PIOC) Edge/Level Status Register
AT91C_PIOC_SODR           EQU (0x400E1030) ;- (PIOC) Set Output Data Register
AT91C_PIOC_PSR            EQU (0x400E1008) ;- (PIOC) PIO Status Register
AT91C_PIOC_KER            EQU (0x400E1120) ;- (PIOC) Keypad Controller Enable Register
AT91C_PIOC_ODR            EQU (0x400E1014) ;- (PIOC) Output Disable Registerr
AT91C_PIOC_OWSR           EQU (0x400E10A8) ;- (PIOC) Output Write Status Register
AT91C_PIOC_PDR            EQU (0x400E1004) ;- (PIOC) PIO Disable Register
AT91C_PIOC_LOCKSR         EQU (0x400E10E0) ;- (PIOC) Lock Status Register
AT91C_PIOC_PER            EQU (0x400E1000) ;- (PIOC) PIO Enable Register
// - ========== Register definition for PMC peripheral ========== 
AT91C_PMC_PLLAR           EQU (0x400E0428) ;- (PMC) PLL Register
AT91C_PMC_UCKR            EQU (0x400E041C) ;- (PMC) UTMI Clock Configuration Register
AT91C_PMC_FSMR            EQU (0x400E0470) ;- (PMC) Fast Startup Mode Register
AT91C_PMC_MCKR            EQU (0x400E0430) ;- (PMC) Master Clock Register
AT91C_PMC_SCER            EQU (0x400E0400) ;- (PMC) System Clock Enable Register
AT91C_PMC_PCSR            EQU (0x400E0418) ;- (PMC) Peripheral Clock Status Register
AT91C_PMC_MCFR            EQU (0x400E0424) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_FOCR            EQU (0x400E0478) ;- (PMC) Fault Output Clear Register
AT91C_PMC_FSPR            EQU (0x400E0474) ;- (PMC) Fast Startup Polarity Register
AT91C_PMC_SCSR            EQU (0x400E0408) ;- (PMC) System Clock Status Register
AT91C_PMC_IDR             EQU (0x400E0464) ;- (PMC) Interrupt Disable Register
AT91C_PMC_VER             EQU (0x400E04FC) ;- (PMC) APMC VERSION REGISTER
AT91C_PMC_IMR             EQU (0x400E046C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IPNAME2         EQU (0x400E04F4) ;- (PMC) PMC IPNAME2 REGISTER 
AT91C_PMC_SCDR            EQU (0x400E0404) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCKR            EQU (0x400E0440) ;- (PMC) Programmable Clock Register
AT91C_PMC_ADDRSIZE        EQU (0x400E04EC) ;- (PMC) PMC ADDRSIZE REGISTER 
AT91C_PMC_PCDR            EQU (0x400E0414) ;- (PMC) Peripheral Clock Disable Register
AT91C_PMC_MOR             EQU (0x400E0420) ;- (PMC) Main Oscillator Register
AT91C_PMC_SR              EQU (0x400E0468) ;- (PMC) Status Register
AT91C_PMC_IER             EQU (0x400E0460) ;- (PMC) Interrupt Enable Register
AT91C_PMC_IPNAME1         EQU (0x400E04F0) ;- (PMC) PMC IPNAME1 REGISTER 
AT91C_PMC_PCER            EQU (0x400E0410) ;- (PMC) Peripheral Clock Enable Register
AT91C_PMC_FEATURES        EQU (0x400E04F8) ;- (PMC) PMC FEATURES REGISTER 
// - ========== Register definition for CKGR peripheral ========== 
AT91C_CKGR_PLLAR          EQU (0x400E0428) ;- (CKGR) PLL Register
AT91C_CKGR_UCKR           EQU (0x400E041C) ;- (CKGR) UTMI Clock Configuration Register
AT91C_CKGR_MOR            EQU (0x400E0420) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_MCFR           EQU (0x400E0424) ;- (CKGR) Main Clock  Frequency Register
// - ========== Register definition for RSTC peripheral ========== 
AT91C_RSTC_VER            EQU (0x400E12FC) ;- (RSTC) Version Register
AT91C_RSTC_RCR            EQU (0x400E1200) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0x400E1208) ;- (RSTC) Reset Mode Register
AT91C_RSTC_RSR            EQU (0x400E1204) ;- (RSTC) Reset Status Register
// - ========== Register definition for SUPC peripheral ========== 
AT91C_SUPC_WUIR           EQU (0x400E1220) ;- (SUPC) Wake Up Inputs Register
AT91C_SUPC_CR             EQU (0x400E1210) ;- (SUPC) Control Register
AT91C_SUPC_MR             EQU (0x400E1218) ;- (SUPC) Mode Register
AT91C_SUPC_FWUTR          EQU (0x400E1228) ;- (SUPC) Flash Wake-up Timer Register
AT91C_SUPC_SR             EQU (0x400E1224) ;- (SUPC) Status Register
AT91C_SUPC_WUMR           EQU (0x400E121C) ;- (SUPC) Wake Up Mode Register
AT91C_SUPC_BOMR           EQU (0x400E1214) ;- (SUPC) Brown Out Mode Register
// - ========== Register definition for RTTC peripheral ========== 
AT91C_RTTC_RTVR           EQU (0x400E1238) ;- (RTTC) Real-time Value Register
AT91C_RTTC_RTAR           EQU (0x400E1234) ;- (RTTC) Real-time Alarm Register
AT91C_RTTC_RTMR           EQU (0x400E1230) ;- (RTTC) Real-time Mode Register
AT91C_RTTC_RTSR           EQU (0x400E123C) ;- (RTTC) Real-time Status Register
// - ========== Register definition for WDTC peripheral ========== 
AT91C_WDTC_WDSR           EQU (0x400E1258) ;- (WDTC) Watchdog Status Register
AT91C_WDTC_WDMR           EQU (0x400E1254) ;- (WDTC) Watchdog Mode Register
AT91C_WDTC_WDCR           EQU (0x400E1250) ;- (WDTC) Watchdog Control Register
// - ========== Register definition for RTC peripheral ========== 
AT91C_RTC_IMR             EQU (0x400E1288) ;- (RTC) Interrupt Mask Register
AT91C_RTC_SCCR            EQU (0x400E127C) ;- (RTC) Status Clear Command Register
AT91C_RTC_CALR            EQU (0x400E126C) ;- (RTC) Calendar Register
AT91C_RTC_MR              EQU (0x400E1264) ;- (RTC) Mode Register
AT91C_RTC_TIMR            EQU (0x400E1268) ;- (RTC) Time Register
AT91C_RTC_CALALR          EQU (0x400E1274) ;- (RTC) Calendar Alarm Register
AT91C_RTC_VER             EQU (0x400E128C) ;- (RTC) Valid Entry Register
AT91C_RTC_CR              EQU (0x400E1260) ;- (RTC) Control Register
AT91C_RTC_IDR             EQU (0x400E1284) ;- (RTC) Interrupt Disable Register
AT91C_RTC_TIMALR          EQU (0x400E1270) ;- (RTC) Time Alarm Register
AT91C_RTC_IER             EQU (0x400E1280) ;- (RTC) Interrupt Enable Register
AT91C_RTC_SR              EQU (0x400E1278) ;- (RTC) Status Register
// - ========== Register definition for ADC0 peripheral ========== 
AT91C_ADC0_IPNAME2        EQU (0x400AC0F4) ;- (ADC0) ADC IPNAME2 REGISTER 
AT91C_ADC0_ADDRSIZE       EQU (0x400AC0EC) ;- (ADC0) ADC ADDRSIZE REGISTER 
AT91C_ADC0_IDR            EQU (0x400AC028) ;- (ADC0) ADC Interrupt Disable Register
AT91C_ADC0_CHSR           EQU (0x400AC018) ;- (ADC0) ADC Channel Status Register
AT91C_ADC0_FEATURES       EQU (0x400AC0F8) ;- (ADC0) ADC FEATURES REGISTER 
AT91C_ADC0_CDR0           EQU (0x400AC030) ;- (ADC0) ADC Channel Data Register 0
AT91C_ADC0_LCDR           EQU (0x400AC020) ;- (ADC0) ADC Last Converted Data Register
AT91C_ADC0_EMR            EQU (0x400AC068) ;- (ADC0) Extended Mode Register
AT91C_ADC0_CDR3           EQU (0x400AC03C) ;- (ADC0) ADC Channel Data Register 3
AT91C_ADC0_CDR7           EQU (0x400AC04C) ;- (ADC0) ADC Channel Data Register 7
AT91C_ADC0_SR             EQU (0x400AC01C) ;- (ADC0) ADC Status Register
AT91C_ADC0_ACR            EQU (0x400AC064) ;- (ADC0) Analog Control Register
AT91C_ADC0_CDR5           EQU (0x400AC044) ;- (ADC0) ADC Channel Data Register 5
AT91C_ADC0_IPNAME1        EQU (0x400AC0F0) ;- (ADC0) ADC IPNAME1 REGISTER 
AT91C_ADC0_CDR6           EQU (0x400AC048) ;- (ADC0) ADC Channel Data Register 6
AT91C_ADC0_MR             EQU (0x400AC004) ;- (ADC0) ADC Mode Register
AT91C_ADC0_CDR1           EQU (0x400AC034) ;- (ADC0) ADC Channel Data Register 1
AT91C_ADC0_CDR2           EQU (0x400AC038) ;- (ADC0) ADC Channel Data Register 2
AT91C_ADC0_CDR4           EQU (0x400AC040) ;- (ADC0) ADC Channel Data Register 4
AT91C_ADC0_CHER           EQU (0x400AC010) ;- (ADC0) ADC Channel Enable Register
AT91C_ADC0_VER            EQU (0x400AC0FC) ;- (ADC0) ADC VERSION REGISTER
AT91C_ADC0_CHDR           EQU (0x400AC014) ;- (ADC0) ADC Channel Disable Register
AT91C_ADC0_CR             EQU (0x400AC000) ;- (ADC0) ADC Control Register
AT91C_ADC0_IMR            EQU (0x400AC02C) ;- (ADC0) ADC Interrupt Mask Register
AT91C_ADC0_IER            EQU (0x400AC024) ;- (ADC0) ADC Interrupt Enable Register
// - ========== Register definition for TC0 peripheral ========== 
AT91C_TC0_IER             EQU (0x40080024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_CV              EQU (0x40080010) ;- (TC0) Counter Value
AT91C_TC0_RA              EQU (0x40080014) ;- (TC0) Register A
AT91C_TC0_RB              EQU (0x40080018) ;- (TC0) Register B
AT91C_TC0_IDR             EQU (0x40080028) ;- (TC0) Interrupt Disable Register
AT91C_TC0_SR              EQU (0x40080020) ;- (TC0) Status Register
AT91C_TC0_IMR             EQU (0x4008002C) ;- (TC0) Interrupt Mask Register
AT91C_TC0_CMR             EQU (0x40080004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_RC              EQU (0x4008001C) ;- (TC0) Register C
AT91C_TC0_CCR             EQU (0x40080000) ;- (TC0) Channel Control Register
// - ========== Register definition for TC1 peripheral ========== 
AT91C_TC1_SR              EQU (0x40080060) ;- (TC1) Status Register
AT91C_TC1_RA              EQU (0x40080054) ;- (TC1) Register A
AT91C_TC1_IER             EQU (0x40080064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_RB              EQU (0x40080058) ;- (TC1) Register B
AT91C_TC1_IDR             EQU (0x40080068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_CCR             EQU (0x40080040) ;- (TC1) Channel Control Register
AT91C_TC1_IMR             EQU (0x4008006C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_RC              EQU (0x4008005C) ;- (TC1) Register C
AT91C_TC1_CMR             EQU (0x40080044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_CV              EQU (0x40080050) ;- (TC1) Counter Value
// - ========== Register definition for TC2 peripheral ========== 
AT91C_TC2_RA              EQU (0x40080094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0x40080098) ;- (TC2) Register B
AT91C_TC2_CMR             EQU (0x40080084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_SR              EQU (0x400800A0) ;- (TC2) Status Register
AT91C_TC2_CCR             EQU (0x40080080) ;- (TC2) Channel Control Register
AT91C_TC2_IMR             EQU (0x400800AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_CV              EQU (0x40080090) ;- (TC2) Counter Value
AT91C_TC2_RC              EQU (0x4008009C) ;- (TC2) Register C
AT91C_TC2_IER             EQU (0x400800A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_IDR             EQU (0x400800A8) ;- (TC2) Interrupt Disable Register
// - ========== Register definition for TCB0 peripheral ========== 
AT91C_TCB0_BCR            EQU (0x400800C0) ;- (TCB0) TC Block Control Register
AT91C_TCB0_IPNAME2        EQU (0x400800F4) ;- (TCB0) TC IPNAME2 REGISTER 
AT91C_TCB0_IPNAME1        EQU (0x400800F0) ;- (TCB0) TC IPNAME1 REGISTER 
AT91C_TCB0_ADDRSIZE       EQU (0x400800EC) ;- (TCB0) TC ADDRSIZE REGISTER 
AT91C_TCB0_FEATURES       EQU (0x400800F8) ;- (TCB0) TC FEATURES REGISTER 
AT91C_TCB0_BMR            EQU (0x400800C4) ;- (TCB0) TC Block Mode Register
AT91C_TCB0_VER            EQU (0x400800FC) ;- (TCB0)  Version Register
// - ========== Register definition for TCB1 peripheral ========== 
AT91C_TCB1_BCR            EQU (0x40080100) ;- (TCB1) TC Block Control Register
AT91C_TCB1_VER            EQU (0x4008013C) ;- (TCB1)  Version Register
AT91C_TCB1_FEATURES       EQU (0x40080138) ;- (TCB1) TC FEATURES REGISTER 
AT91C_TCB1_IPNAME2        EQU (0x40080134) ;- (TCB1) TC IPNAME2 REGISTER 
AT91C_TCB1_BMR            EQU (0x40080104) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_ADDRSIZE       EQU (0x4008012C) ;- (TCB1) TC ADDRSIZE REGISTER 
AT91C_TCB1_IPNAME1        EQU (0x40080130) ;- (TCB1) TC IPNAME1 REGISTER 
// - ========== Register definition for TCB2 peripheral ========== 
AT91C_TCB2_FEATURES       EQU (0x40080178) ;- (TCB2) TC FEATURES REGISTER 
AT91C_TCB2_VER            EQU (0x4008017C) ;- (TCB2)  Version Register
AT91C_TCB2_ADDRSIZE       EQU (0x4008016C) ;- (TCB2) TC ADDRSIZE REGISTER 
AT91C_TCB2_IPNAME1        EQU (0x40080170) ;- (TCB2) TC IPNAME1 REGISTER 
AT91C_TCB2_IPNAME2        EQU (0x40080174) ;- (TCB2) TC IPNAME2 REGISTER 
AT91C_TCB2_BMR            EQU (0x40080144) ;- (TCB2) TC Block Mode Register
AT91C_TCB2_BCR            EQU (0x40080140) ;- (TCB2) TC Block Control Register
// - ========== Register definition for EFC0 peripheral ========== 
AT91C_EFC0_FCR            EQU (0x400E0804) ;- (EFC0) EFC Flash Command Register
AT91C_EFC0_FRR            EQU (0x400E080C) ;- (EFC0) EFC Flash Result Register
AT91C_EFC0_FMR            EQU (0x400E0800) ;- (EFC0) EFC Flash Mode Register
AT91C_EFC0_FSR            EQU (0x400E0808) ;- (EFC0) EFC Flash Status Register
AT91C_EFC0_FVR            EQU (0x400E0814) ;- (EFC0) EFC Flash Version Register
// - ========== Register definition for EFC1 peripheral ========== 
AT91C_EFC1_FMR            EQU (0x400E0A00) ;- (EFC1) EFC Flash Mode Register
AT91C_EFC1_FVR            EQU (0x400E0A14) ;- (EFC1) EFC Flash Version Register
AT91C_EFC1_FSR            EQU (0x400E0A08) ;- (EFC1) EFC Flash Status Register
AT91C_EFC1_FCR            EQU (0x400E0A04) ;- (EFC1) EFC Flash Command Register
AT91C_EFC1_FRR            EQU (0x400E0A0C) ;- (EFC1) EFC Flash Result Register
// - ========== Register definition for MCI0 peripheral ========== 
AT91C_MCI0_DMA            EQU (0x40000050) ;- (MCI0) MCI DMA Configuration Register
AT91C_MCI0_SDCR           EQU (0x4000000C) ;- (MCI0) MCI SD/SDIO Card Register
AT91C_MCI0_IPNAME1        EQU (0x400000F0) ;- (MCI0) MCI IPNAME1 REGISTER 
AT91C_MCI0_CSTOR          EQU (0x4000001C) ;- (MCI0) MCI Completion Signal Timeout Register
AT91C_MCI0_RDR            EQU (0x40000030) ;- (MCI0) MCI Receive Data Register
AT91C_MCI0_CMDR           EQU (0x40000014) ;- (MCI0) MCI Command Register
AT91C_MCI0_IDR            EQU (0x40000048) ;- (MCI0) MCI Interrupt Disable Register
AT91C_MCI0_ADDRSIZE       EQU (0x400000EC) ;- (MCI0) MCI ADDRSIZE REGISTER 
AT91C_MCI0_WPCR           EQU (0x400000E4) ;- (MCI0) MCI Write Protection Control Register
AT91C_MCI0_RSPR           EQU (0x40000020) ;- (MCI0) MCI Response Register
AT91C_MCI0_IPNAME2        EQU (0x400000F4) ;- (MCI0) MCI IPNAME2 REGISTER 
AT91C_MCI0_CR             EQU (0x40000000) ;- (MCI0) MCI Control Register
AT91C_MCI0_IMR            EQU (0x4000004C) ;- (MCI0) MCI Interrupt Mask Register
AT91C_MCI0_WPSR           EQU (0x400000E8) ;- (MCI0) MCI Write Protection Status Register
AT91C_MCI0_DTOR           EQU (0x40000008) ;- (MCI0) MCI Data Timeout Register
AT91C_MCI0_MR             EQU (0x40000004) ;- (MCI0) MCI Mode Register
AT91C_MCI0_SR             EQU (0x40000040) ;- (MCI0) MCI Status Register
AT91C_MCI0_IER            EQU (0x40000044) ;- (MCI0) MCI Interrupt Enable Register
AT91C_MCI0_VER            EQU (0x400000FC) ;- (MCI0) MCI VERSION REGISTER 
AT91C_MCI0_FEATURES       EQU (0x400000F8) ;- (MCI0) MCI FEATURES REGISTER 
AT91C_MCI0_BLKR           EQU (0x40000018) ;- (MCI0) MCI Block Register
AT91C_MCI0_ARGR           EQU (0x40000010) ;- (MCI0) MCI Argument Register
AT91C_MCI0_FIFO           EQU (0x40000200) ;- (MCI0) MCI FIFO Aperture Register
AT91C_MCI0_TDR            EQU (0x40000034) ;- (MCI0) MCI Transmit Data Register
AT91C_MCI0_CFG            EQU (0x40000054) ;- (MCI0) MCI Configuration Register
// - ========== Register definition for PDC_TWI0 peripheral ========== 
AT91C_TWI0_TNCR           EQU (0x4008411C) ;- (PDC_TWI0) Transmit Next Counter Register
AT91C_TWI0_PTCR           EQU (0x40084120) ;- (PDC_TWI0) PDC Transfer Control Register
AT91C_TWI0_PTSR           EQU (0x40084124) ;- (PDC_TWI0) PDC Transfer Status Register
AT91C_TWI0_RCR            EQU (0x40084104) ;- (PDC_TWI0) Receive Counter Register
AT91C_TWI0_TNPR           EQU (0x40084118) ;- (PDC_TWI0) Transmit Next Pointer Register
AT91C_TWI0_RNPR           EQU (0x40084110) ;- (PDC_TWI0) Receive Next Pointer Register
AT91C_TWI0_RPR            EQU (0x40084100) ;- (PDC_TWI0) Receive Pointer Register
AT91C_TWI0_RNCR           EQU (0x40084114) ;- (PDC_TWI0) Receive Next Counter Register
AT91C_TWI0_TPR            EQU (0x40084108) ;- (PDC_TWI0) Transmit Pointer Register
AT91C_TWI0_TCR            EQU (0x4008410C) ;- (PDC_TWI0) Transmit Counter Register
// - ========== Register definition for PDC_TWI1 peripheral ========== 
AT91C_TWI1_TNCR           EQU (0x4008811C) ;- (PDC_TWI1) Transmit Next Counter Register
AT91C_TWI1_PTCR           EQU (0x40088120) ;- (PDC_TWI1) PDC Transfer Control Register
